{"pageProps":{"post":{"title":"Мошенники обзванивают клиентов Сбербанка","date":"2020-09-23T14:15:07.322Z","slug":"banks-clients-fraud","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"<p>Доброе время суток, товарищи. Этот пост про всеми нами ненавистного почти-монополиста на рынке рашкинского банкинга. Банк, про клиентоориентированность и профессионализм сотрудников которого слагают легенды. Но по какой-то неизвестной мне причине, люди продолжают <strong>страдать</strong> и <strong>пользоваться</strong> услугами этого бгмерзкого <em>зелёного банка</em>.</p>\n<p><strong>Самое</strong> страшное в этом, что люди продолжают доверять им <strong>СВОИ ДЕНЬГИ</strong>. Абсолютно не заботясь о том, что в компании уже <strong>несколько раз</strong> были прецеденты утечек данных карт клиентов в сеть. Вы действительно готовы этим людям доверять то, что заработали тяжелым трудом?</p>\n<p><img src=\"../assets/blog/banks-clients-fraud/ne_bylo.jpg\" alt=\"Никогда не было и вот опять\"></p>\n<ol>\n<li><a href=\"https://www.rbc.ru/finances/14/02/2020/5e46339a9a794720b519014f\">никогда</a></li>\n<li><a href=\"https://www.rbc.ru/finances/07/10/2019/5d9b874f9a79475c84375ca0\">не было</a></li>\n<li><a href=\"https://www.cnews.ru/news/top/2019-10-03_sberbank_dopustil_krupnejshuyu\">и вот опять</a> . </li>\n</ol>\n<p>Но этот пост связан с <strong>зеленым</strong> лишь опосредованно. </p>\n<p>Я лишь хочу предупредить <em>(читающих этот корявый текст)</em>, что в последнее время <strong>сильно</strong> участились звонки мошенников моим знакомым, имеющим карточки <strong>сбера</strong>. Это очередной слив базы данных, или у мошенников другие источники информации — об этом знает только аллах.</p>\n<p><img src=\"../assets/blog/banks-clients-fraud/overdraft.jpg\" alt=\"Сбер-овердрафт\"></p>\n<h2>Предупрежден — значит вооружен</h2>\n<p>Было бы глупо с моей стороны рассказывать прописные истины о том, что никому и никогда нельзя диктовать CVV код карты или коды подтверждения из смс. Даже если у этого \"кого-то\" <del>очень милый голос</del> убедительные аргументы, и он представился сотрудницей банка. Но в этот раз люди столкнулись с более интересными схемами, чем выпрашивание данных с карты \"в лоб\". </p>\n<p>Видимо, сейчас у мошенников на карантине больше свободного времени, или к концу лета у них появилось более игривое настроение. Но теперь они прибегают к методам, об использовании которых я раньше не слышал. </p>\n<h2>Новые фичи</h2>\n<p>Как и раньше, все схемы заточены на доверчивых людей в возрасте:</p>\n<h3>Пунктик номер раз:</h3>\n<p>Теперь эти ребятки научились обзванивать ещё и близких людей и под видом старого знакомого/соцопроса/дальнего родственника сначала выспрашивать информацию о будущей жертве. Ведь чем больше они информации сообщат непосредственно в разговоре с жертвой, тем больше они доверия смогут завоевать на первых парах. </p>\n<p>Так что, если вас достают звонками с соцопросами — есть ненулевая вероятность, что вашей бабушке скоро позвонит фейковый сотрудник банка.</p>\n<h3>Пунктик номер два:</h3>\n<p>Для получения ништяков от жертвы они теперь не спрашивают CVV код. А пытаются \"развести\" на включение переадресации вызовов на <strong>их</strong> номер.</p>\n<ol>\n<li>Звонит якобы \"Служба поддержки банка\". Спрашивает — на этот номер <em>%называет номер%</em> переводили сумму <em>%сумма%</em> минуту назад?</li>\n<li>Получает отрицательный ответ</li>\n<li>Предлагает для отмены операции ввести на телефоне USSD команду:</li>\n</ol>\n<pre><code>** 21 * названный ранее номер # [вызов]\n</code></pre>\n<p>Даже не знаю, как они дальше собираются эту переадресацию монетизировать. Ведь нужно в таком случае заставить банк позвонить самостоятельно. Но, к счастью, пока никому не удалось эту схему проверить на себе. </p>\n<p>История с USSD командой выглядит <strong>очень</strong> правдоподобной для неподготовленного человека в возрасте! Пожалуйста, предупредите об этом близких.</p>\n<h2>И чо?</h2>\n<p>Насколько я понял, бороться с этим дерьмом жалобами/заявлениями в полицию бесполезно. Т.к. это толком не ищется.</p>\n<p>Так что, остаётся лишь вырабатывать критическое мышление у своих близких. В идеале, нужно дать им запомнить, что при <strong>любом</strong> подозрительном звонке (особенно из банка) — нужно перепроверять информацию. </p>\n<p><strong>В случае со сбером</strong> — лучше всего сбросить текущий звонок и самостоятельно позвонить на номер 900. А <strong>ЕЩЁ</strong> лучше — наведаться в офис банка и <del>если вас не пошлют найух</del> уточнить всю необходимую информацию.</p>\n<h2>P.S.</h2>\n<p>Не надо трогать рукой лицо. Всё-таки ковид.\n<img src=\"../assets/blog/banks-clients-fraud/password_hash.jpg\" alt=\"Логин и пароль не чувствительны к регистру\"></p>\n<p><a href=\"/tags/%D0%B1%D0%BE%D0%BB%D1%82%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8%D1%8F\">#болтология</a></p>\n","ogImage":{"url":"/assets/blog/banks-clients-fraud/background.jpg"},"coverImage":"/assets/blog/banks-clients-fraud/background.jpg","issueId":"14"}},"__N_SSG":true}