{"pageProps":{"allPosts":[{"title":"Пробросить VPN+RDP подключение на домашний компьютер: пособие для маленьких и тупых","date":"2021-06-11T19:06:05.108Z","slug":"hamachi-on-chromebooks","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"\nТак уж вышло, что бывает нужно с работы/поездки/откуда-то_ещё подключаться к домашнему компьютеру. Например, чтобы показать свой проект на презентации. Или подключиться к локальному сервису, развернутому на машине.\n\nНо что, если ситуация усложняется тем, что ты дурак и купил хромбук вместо нормального устройства?\n\n![Chromebook meme](../public/assets/blog/hamachi-on-chromebooks/chromebooks.jpg)\n\nВыход через оконный проём всегда имеется. И даже есть простой и понятный путь решения задачи: развернуть *l2tp/ipsec* VPN-сервер (например, великолепный [SoftEtherVPN](https://www.softether.org/)) и подключить к нему все необходимые устройства. \n\nБолее того, **именно такая схема** у меня и была раньше. *(Пока я не забывал платить за VDS)*\n\n## Ковальски, варианты!\n\nЕсть максимально **тупой и небезопасный** путь: вытащить из-за **NAT/фаерволов** \"*наружу*\" домашний компьютер и подключать напрямую. Но если комплюхтер на шиндоусе, все мы с вами знаем, с какой скоростью к нему получит доступ кто-нибудь ещё... \n\nКакой-нибудь абстрактный лейтенант *КейДжиБи* спустя несколько секунд сделает из домашнего компьютера хранилище **ц**ентральных **п**роцессоров. И меня же за это набутылит. \n\n## А есть какой-то VPN для бедных?\n\nМне вспомнился легендарный сервис, который знал каждый школьник моего детства. Именно через него играли во всякие доты, контерстрайки, и [убойные дела](https://smallgames.ws/18239-uboijnoe-delo.html) — [Hamachi](https://www.vpn.net/).\n\nС тех пор, как я им в последний раз пользовался, он сильно коммерциализировался и стал ограничивать сети лишь 5-ю устройствами, а за увеличение лимита вымогать деньги. Довольно мерзко, но для личного использования должно хватить. \n\nСуть этой софтины в том, что она *не предоставляет* VPN-сервер в классическом понимании (не пропускает весь шифрованный трафик через себя). А лишь *\"знакомит\"* устройства сети друг с другом, и помогает им поднять **P2P** подключение. Т.е. пинг и скорость подключения будут ровно такими же, как если бы устройства подключались напрямую без дополнительного софта. Но при этом устройства будут продолжать быть глубоко за NAT и быть недоступны для внешних глаз. \n\n## А дальше что?\n\nСоздать аккаунт и свою приватную сеть на [официальном сайте](https://www.vpn.net/) элементарно. Но для меня оставалось загадкой: смогу ли я подключиться к этой сети со своего экзотического хромбука?\n\nНайти клиент под windows не составляет труда. А вот страница скачивания ARM-linux-клиента меня встретила вот таким выбором:\n\n![Выбор клиента под ARM](../public/assets/blog/hamachi-on-chromebooks/hamachi.png)\n\nВо-первых, вы узнаём, что билд под **ARM** до сих пор остаётся в *beta*. Но мы не будем использовать его в *production*, так ведь? :) \n\nВо-вторых, мне предлагают выбрать между **ARMEL** и **ARMHF** версиями. И тут я впервые столкнулся с этими аббревиатурами. \n\n[Быстрым гуглением выяснилось](https://linuxhint.com/about-arm64-armel-armhf/), что **ARMHF** — это процессоры с хардварным обработчиком операций над *floating-point-числами*, а **ARMEL**, соответственно, софтверным. \n\nПоскольку я живу в 2021 году, то выбрал deb-пакет с ARMHF. Но при установке меня ждало следующее испытание:\nустановщик сваливался с ошибкой, где ругался на то, что архитектура ARM64 != ARMHF. \n\n## Що робити? Гуглити!\n\n[Вот тут](https://community.logmein.com/t5/LogMeIn-Hamachi-Discussions/Hamachi-for-ARM-HF-getting-error-167-while-trying-to-connect-to/td-p/138634) нашел возможное решение. Там юзверь смог установить и запустить ARMHF-версию после того, как добавил эту архитектуру в **dpkg** и установил для неё libc6 и libstdc.\n\n```bash\nsudo dpkg —add-architecture armhf\nsudo apt-get update\nsudo apt-get install libc6:armhf\nsudo ln -s /lib/ld-linux-armhf.so.3 /lib/ld-linux.so.3\nsudo apt-get install libstdc++6:armhf\n```\n\nПосле таких танцев с бубном deb-пакет с hamachi успешно устанавливается. Осталось подключиться к созданной ранее сети:\n\n```bash\nsudo /etc/init.d/logmein-hamachi start\nsudo hamachi set-nick chromebook\n# sudo hamachi join %network id% %network password% у меня (как и у того пользователя) не завелось\n# возвращая безымянную ошибку #167 \n# но можно привязать свой аккаунт logmein к этому клиенту. И подключиться к сети через веб-интерфейс\nsudo hamachi attach %почта, используемая при регистрации%\n```\n\nПосле этого в [личном кабинете](https://www.vpn.net/) появится запрос на подключение клиента. Нужно его подтвердить и привязать к сети. На этом любопытная часть закончилась. VPN на хромбуке поднят. Если всё пошло, как и ожидалось — в терминале мы должны видеть примерно следующее:\n\n```bash\nsudo hamachi \n  # version    : 2.1.0.203\n  # pid        : 1150\n  # status     : logged in\n  # client id  : XXX-XXX-XXX\n  # address    : XXX.XXX.XXX.XXX    %ipv6addr%\n  # nickname   : chromebook\n  # lmi account: %your email%\nsudo hamachi list\n#  * [XXX-XXX-XXX]%network name%  capacity: 1/5, subscription type: Free, owner: %your email%\nip addr show\n# >> Появился интерфейс\n#3: ham0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1404 qdisc pfifo_fast state UNKNOWN group default qlen 1000\n```\n\n## На стороне домашнего компьютера\n\nПодключение к Hamachi из-под windows-x64 происходит без каких-либо дополнительных сложностей: просто скачиваем клиент, запускаем, логинимся, радуемся поднятым VPN.\n\n## Поднимаем RDP сервер\n\n### А нахрена?\n\nКонечно, для простого удалённого управления можно воспользоваться **Chrome Remote Desktop**. Но в нём очень куцая функциональность. Например, он не может шарить буфер обмена, файлы и подключенные по USB устройства между компьютерами. А классический RDP делает это элементарно из коробки. \n\nЧто ж. Чтобы включить RDP сервер на PRO* версиях windows, нужно лишь нажать на переключатель в настройках. Но если вы  ~~жадный русский~~ бедный житель страны третьего мира, то внезапно можете обнаружить вот такую заглушку:\n\n![Windows 10 home: try to enable RDP server](../public/assets/blog/hamachi-on-chromebooks/rdp_not_working.png)\n\nПо умолчанию в \"домашние\" сборки Windows не входит RDP сервер. Но есть замечательный проект на гитхабе, который поможет решить проблему: [RDPWrap](https://github.com/stascorp/rdpwrap). Сия шайтан-софтина не очень friendly в установке и у меня завелась только после такого алгоритма действий ([который я подсмотрел здесь](https://github.com/stascorp/rdpwrap/issues/999)):\n\n* Скачал релиз в zip (а не инсталлятор)\n* Добавил папку с распакованными файлами в исключения защитника шиндовс\n\n![Исключение защитника](../public/assets/blog/hamachi-on-chromebooks/exceptions_microsoft_guard.png)\n\n* Запустил install-скрипт\n* Погасил сервис\n* Заменил ini-файл [на тот, что здесь](https://raw.githubusercontent.com/affinityv/INI-RDPWRAP/master/rdpwrap.ini).\n* Запустил сервис\n\n```bash\ninstall.bat\nnet stop termservice\n# Подменил ini-файл в директории C:\\Program Files\\RDP Wrapper\\rdpwrap.ini\nnet start termservice\n```\n* ...\n* PROFIT!\n\n![PROFIT](../public/assets/blog/hamachi-on-chromebooks/profit.jpg)\n\n## Всо\n\nНа этом этапе должно уже всё заработать. Из-под хромбука по RDP можно подключаться через [FreeRDP](https://www.freerdp.com/) клиент, который есть в apt и уже был [описан вот здесь](./remote-workplace-linux).\n\nК остальным поднятым сервисам можно будет \"достучаться\" так же, как если бы компьютеры были в локальной сети. ¯\\\\_(ツ)_/¯\n\n<iframe frameborder=\"0\" style=\"border:none;width:100%;height:180px;\" width=\"100%\" height=\"180\" src=\"https://music.yandex.ru/iframe/#track/76128507/13437222\">Слушайте <a href='https://music.yandex.ru/album/13437222/track/76128507'>Веснянка</a> — <a href='https://music.yandex.ru/artist/4827898'>Go_A</a> на Яндекс.Музыке</iframe>\n\n#linux #танцы_с_бубном #vpn","ogImage":{"url":"/assets/blog/hamachi-on-chromebooks/background.jpg"},"coverImage":"/assets/blog/hamachi-on-chromebooks/background.jpg","issueId":"21","excerpt":"Так уж вышло, что часто бывает нужно с работы/поездки/откуда-то ещё подключаться к домашнему компьютеру. Например, чтобы показать свой проект на презентации. Но что, если ситуация усложняется тем, что ты дурак и купил хромбук вместо нормального устройства?"},{"title":"Экспорт данных из SAP Query-отчета во внутреннюю таблицу через SPOOL","date":"2021-03-20T08:40:14.217Z","slug":"export-data-to-sap-spool","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"\nГоспода, м'сье абапье и прочие любители подглядывать за страданиями! Представляю вашему вниманию очередной результат танцев с бубенцами. Который в этот раз будет чуть менее бесполезным. И (быть может) сэкономит время какому-нибудь заблудившемуся **SAP**-кодерасту.\n\nИногда хочется выть от боли, когда в очередной раз появляются требования выгрузки данных из стандартных или квази-стандартных отчетов SAP. Которые зачастую вообще не предусматривают какой-либо экспорт или расширение.\n\nДальше будет **ABAP** и рассказывания о подноготной **SAP ERP**. Если у вас нет вуайеристских наклонностей или профессионального интереса в дальнейшем тексте, то рекомендую закрыть страницу, чтобы не испытать экзистенциальный ужас от полученной информации.\n\nЧто ж, погружаемся, товарищи. Так сказать, пристегните ремни. Будет немного трясти ~~и пованивать~~.\n\n![Погружаемся!](../public/assets/blog/export-data-to-sap-spool/dipping.jpg)\n\n## Поехали.\nИтак, представим ситуацию: Вы сидите, неспешно ковыряете код. И тут прилетает задача —  достать данные из древнего отчета, нарисованного в **SAP Query** через **Report painter**; их немного обработать и отдать в другой интерфейс.\n\nКазалось бы, что может быть сложного? Ну, например, всё. \n\n### SAP Query (далее SQ)\nЭто сраный **SAP Query**. Пользователь мышой натыкивает нужные ему поля и форму отчета, а на выходе получает готовый отчет. Софтина сама собирает ABAP-программу по конфигу. Класна? Нет. \n\nКаждая дальнейшая правка отчета в пользовательской морде пересобирает целиком *всё*. Более того, никто не гарантирует, что программа пересоберется с тем же техническим названием. Ну и при переезде правок по ландшафту дев-тест-прод -> будет генерироваться разное название.\n\n**Вывод:** Вписаться в код отчета и вытащить данные перед их отображением —  не получится. Юзверь перезатрёт всё прямзавтра. А скорее всего —  вчера.\n\n![userflow](../public/assets/blog/export-data-to-sap-spool/userflow.jpg)\n\n### Report Painter\nЯ нарвался на *\"не совсем классическое\"*  использование **SQ**! Данные выводятся не напрямую, а проходят через *\"прослойку отрисовщика\"* (Report Painter). И воспользоваться стандартным FM **RSAQ_REMOTE_QUERY_CALL**, увы, не выйдет. \n\nТ.к. для заданного отчета вообще нет таких параметров, как *\"имя запроса\"* и  *\"группа пользователей\"*. Просто н**е**чего подавать в аргументы функции.\n\n**Вывод:** Увы, воспользоваться предусмотренными FM невозможно. \n\n### Это, мать вашу, не ALV\nА жаль. При отображении, ALV-таблицы постят свои мета-(и не очень мета)данные в глобальный скоуп сессии пользователя. И оттуда элементарно вытащить что угодно. Например, вот так:\n\n```abap\ncl_salv_bs_runtime_info=>set( EXPORTING display  = abap_false  \n\t\t\t\t\t\t\t\t\t\tmetadata = abap_true  \n\t\t\t\t\t\t\t\t\t\tdata     = abap_true ).\n\t\t\t\t\t\t\t\t\t\t\n\" submit report and return\n\ncl_salv_bs_runtime_info=>get_data_ref( IMPORTING r_data = ro_data ).\n\n\" do with ro_data what you want\n```\n\n### Не работает ... exporting list to memory\nНеобъяснимо, но факт. Несмотря на то, что SQ-отчеты де-факто рендерят стандартный лист!\n\nПопытка экспортировать таким способом просто подвешивает основной поток выполнения и ничего не делает. Чому? Об этом знает только аллах. \n\n```abap\nsubmit prog and return exporting list to memory. \" not working\n```\n\n### Но выход всегда есть\n*(особенно, если вы живёте достаточно высоко)*\n\nДавайте подумаем, **что может быть общего** между матричными принтерами, и решением моей задачи? \n\n![printer](../public/assets/blog/export-data-to-sap-spool/printer.jpeg)\n\nДа, теми самыми принтерами с рулоном ленты. Которые буквально печатают \"стуча\" по бумаге, как старые печатающие машинки. И которые могут использовать только *ASCII* символы. \n\n**А то**, что **SAP** *(Эдакая древняя громадина)* из коробки поддерживает *ASCII*-фикацию и печать всех отчетов, которые отрисовываются \"стандартным\" способом. Так это же то, что мне нужно! Такой текст будет элементарно распарсить после получения.\n\nДостаточно дёрнуть печать отчета, и вовремя подхватить *ASCII*-фицированный документ кодом! Получается что-то вроде этого:\n\nСоздаём фоновое задание, где будет выполняться рендеринг и попытка печати.\n\n```abap\nCALL FUNCTION 'JOB_OPEN'\n  EXPORTING\n    jobname          = kv_job_name\n  IMPORTING\n    jobcount         = lv_jobcount.\n```\n\nСобираем параметры печати. Нам нужно попросить программу напечататься сразу же после выполнения, и не показывать никаких диалогов. \n\n```abap\nCALL FUNCTION 'GET_PRINT_PARAMETERS'\n  EXPORTING\n    list_name      = 'TEST'\n    list_text      = 'SUBMIT this fucking program TO SAP-SPOOL'\n    immediately    = abap_true\n    no_dialog      = abap_true\n  IMPORTING\n    out_parameters = ls_params\n    valid          = lv_valid.\n```\n\nВызываем программу в фоне со всеми собранными параметрами. Конструкция **to sap-spool ... without spool** нисколько сап не смущает. И вполне корректно отрабатывает. \n\n```abap\nSUBMIT program_technical_name USING SELECTION-SET 'VAR1' \n      TO SAP-SPOOL SPOOL PARAMETERS ls_params \n      WITHOUT SPOOL DYNPRO \n      VIA JOB kv_job_name NUMBER lv_jobcount \n      AND RETURN.\n```\n\nТак, программу мы вызвали, теперь придется костылём дожидаться завершения фоновой задачи. Никаких ивентов и коллбэков тут нет. \n\n```abap\n\" Костыль ожидания завершения асинхронной жобы\nWHILE ls_empty IS INITIAL.\n  WAIT UP TO 5 SECONDS.\n  SELECT SINGLE * FROM tbtco INTO ls_empty WHERE jobname = kv_job_name AND jobcount = lv_jobcount AND status = 'F'.\nENDWHILE.\n```\n\nНу, собственно, всё. Фоновая задача завершена. В системе уже хранятся отрендеренные данные, и нам остаётся лишь их подхватить. \n\n```abap\nSELECT SINGLE listident\n  FROM tbtcp\n  INTO lv_listident\n  WHERE jobname = kv_job_name\n    AND jobcount = lv_jobcount.\n \nCHECK lv_listident IS NOT INITIAL.\n \nlv_rqident = lv_listident.\n \nCALL FUNCTION 'RSPO_RETURN_ABAP_SPOOLJOB'\n  EXPORTING\n    rqident              = lv_rqident\n  TABLES\n    buffer               = lt_buffer.\n```\n\nВ результате получаем внутрённюю таблицу **lt_buffer** из строк отчета. Её элементарно разбирать на куски, и вытаскивать нужные нам значения.\n \nСтолбцы в такой таблице разделены символом вертикальной черты '|' и ничего не стоит распарсить поля по отдельности. \n \n[Полный код на github gists здесь](https://gist.github.com/JustAddAcid/450d4cd5f1069dbac61c3e842508b969)\n\n<iframe frameborder=\"0\" style=\"border:none;width:100%;height:180px;\" width=\"100%\" height=\"180\" src=\"https://music.yandex.ru/iframe/#track/57987781/8763763\">Слушайте <a href='https://music.yandex.ru/album/8763763/track/57987781'>What the Fuck</a> — <a href='https://music.yandex.ru/artist/7756103'>RHODAMINE</a> на Яндекс.Музыке</iframe>\n\n#abap #танцы_с_бубном\n","ogImage":{"url":"/assets/blog/export-data-to-sap-spool/background.jpg"},"coverImage":"/assets/blog/export-data-to-sap-spool/background.jpg","issueId":"18","excerpt":"Объясняю необычный подход экспорта данных из отчетов SAP Query, которые отрисовывают данные через Report Painter. Через... Спул печати!"},{"title":"Авторитарные замашки у проектировщиков интерфейсов TV","date":"2020-09-24T13:20:05.316Z","slug":"authoritarian-tv-interfaces","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"\nМинутка признания. Больше всего в этом мире я ненавижу \"неотключаемые опции\". Есть в этом что-то авторитарное. Когда создатель какой-либо системы играет в бога и заявляет: \"Я просто знаю, что вот эта функция нужна будет всегда. И не отвертитесь! Будете жрать говно до конца!\"\n\nИ такое дерьмо проявляется везде: не только в айтишечке, а даже в обычной жизни! Приведу несколько примеров, чтобы вы поняли, о чем я говорю:\n\n### Интернет в ADSL-эпоху\nВот пришел ты в нулевые года к интернет-провайдеру и говоришь: \"Хочу провести себе тырнет по медному проводу аж **5мб/с**, чтобы смотреть ютуб в 480p и орать с демотиваторов.\"\n\nА тебя заставляют выбирать сразу два тарифа: на интернет и на телефон. Доводы: \"Я не хочу домашний телефон, мне мобилки хватает\" — не работают. И приходится соглашаться с требованиями монополиста — Ростелекома, и платить дополнительный прайс за телефон, которым никто и не воспользовался ни разу. \n\n![Ни единого разрыва](../public/assets/blog/authoritarian-tv-interfaces/without_disconnects.jpg)\n\n### Прекрасное пенсионное и медицинское страхование в рашке\nДля этих штук можно спокойно использовать лозунг \"плати и не пользуйся\". Никого абсолютно не волнует, что человек может просто не дожить до пенсии. Или он самостоятельно хочет накопить себе на старость и не доверяет очень невыгодному вкладу под названием \"пенсионный фонд\", который уже много лет не начисляет проценты. Он просто **не может** отказаться от выплат туда.\n\nС медстраховкой аналогичное дерьмо — ты можешь наблюдаться в частных клиниках за свой счет. **НО** ты **ОБЯЗАН** финансировать безумную и отвратительную систему государственных поликлиник. Зачем? Почему я не могу отказаться выплачивать деньги в фонд, при этом не пользуясь государственной медициной? Потому что какой-то дядька давно решил, что эта опция нужна **всем без исключения** и её нельзя отключить.\n\nИ вот мы подходим к самому главному — юзабилити интерфейсов. И я считаю, что за отсутствие \"выключателя\" у основных функций систем пора уже вводить уголовную ответственность ~~хотя, средневековые развлечения с забиванием камнями тоже подойдут~~ .\n\n## Низкий поклон ребяткам из TOSHIBA\n\nЗадаю вам школьную задачку. **Дано:**\n\n1. Ковидо-карантин, когда закрыты все магазины = 1шт.\n2. Обезьяна, уверенная в том, что она может работать из дома = 1шт.\n3. Ноутбук с экраном 1366x768 = 1шт.\n4. В меру старенький LCD-телевизор TOSHIBA 19AV501 со странным разрешением 1440x900 и возможностью законнектиться по HDMI \n\n![TOSHIBA 19AV501](../public/assets/blog/authoritarian-tv-interfaces/toshiba.jpg)\n\n**Вопрос:** за сколько миллисекунд сгорит стул?\n\n## Суть\n\n![Встал вопрос](../public/assets/blog/authoritarian-tv-interfaces/question.jpg)\n\n~~Во времена моей молодости~~ Когда начался карантин, *встал вопрос* о том, как реализовать своё рабочее место на дому. Мощностью железок я толком не был ограничен, т.к. [подключался по RDP](./remote-workplace-linux) к удалённому компьютеру. Но вот с размером экрана ноутбука у меня возникли проблемы: просто физически не помещались нужные окна на крошечный экран, и постоянно переключаться между окнами было чертовски неудобно. \n\nПоэтому, чтобы хоть как-то сгладить ситуацию, я решил оккупировать ~~Польшу~~ телевизор с кухни и подключить его по *HDMI*. Казалось бы, что может пойти не так в этой ситуации? Берем телевизор, кабель и ноутбук и совмещаем. Но как бы не так! \n\nИменно в момент соития моего ноутбука и телевизора я узнал, ~~откуда взялся оптимус прайм~~ что такое \"неотключаемый оверскан\". **Оверскан** — это когда телевизор увеличивает **всю картинку** на +-5% (при том замыливая), а те куски, которые не влезли на экран — просто отбрасывает, словно их и не было. Т.е. он показывает только середину экрана: без нижней панели с часами и шапок окон сверху.\n\nНаверное, при просмотре каких-то телепередач в этом есть смысл, но при работе за компом це пiздец. А в настройках телевизора нет ничего похожего на отключение этого режима. Совсем ничего. И как с этим жить?\n\n## Поиск информации\n\nВооружившись гуглом и шаманским супер-бубном, я принялся искать инфу об этой проблеме. И что вы думаете? Оказывается, что это говно не связано с конкретной моделью телевизоров. Оверскан у **многих** неотключаемый!\n\nВыходит, это не ошибка разработчиков, а какая-то **устоявшаяся практика**. Я уверен, что существует лобби маньяков-проектировщиков интерфейсов, которые наслаждаются страданиями пользователей по всему миру. Казалось бы, что сложного в добавлении переключателя в меню?\n\n![Маньяки-проектировщики интерфейсов](../public/assets/blog/authoritarian-tv-interfaces/maniac.jpg)\n\n## Попытки решения\n\nСразу после подключения *HDMI* к ноутбуку, телевизор даже не рассказывает о том, что его родное разрешение *1440x900*. И пытается запуститься в дефолтном режиме (1920x1080i).\n\n```bash\n# Ответ xrandr\n\nHDMI-1 connected\n   1920x1080i    50.00 +  60.00    59.94  \n   1280x720      60.00    50.00    59.94  \n   1440x576      50.00  \n   1024x768      75.03    70.07    60.00  \n   1440x480      60.00    59.94  \n   800x600       72.19    75.00    60.32  \n   720x576       50.00  \n   720x576i      50.00  \n   720x480       60.00    59.94  \n   720x480i      60.00    59.94  \n   640x480       75.00    72.81    60.00    59.94  \n\n```\n\nПеребрав все режимы из списка, я увидел, что в режиме 640x480 всё-таки оверскан отключается! То есть, телевизор умеет это делать. Но такое разрешение совсем никуда не годится. Будем копать дальше. \n\nА что будет, если ему насильно объявить родное разрешение?\n\n```bash\ncvt 1440 900 60 # получаем данные для создания режима 1440х900 60 кадров в секунду\n\n>> # 1440x900 59.89 Hz (CVT 1.30MA) hsync: 55.93 kHz; pclk: 106.50 MHz\n>> Modeline \"1440x900_60.00\"  106.50  1440 1528 1672 1904  900 903 909 934 -hsync +vsync\n\nxrandr --newmode \"1440x900_60.00\"  106.50  1440 1528 1672 1904  900 903 909 934 -hsync +vsync\n\nxrandr --addmode HDMI-1 1440x900_60.00 # Добавляем созданный режим к этому подключению\nxrandr --output HDMI-1 --mode 1440x900_60.00 # Запускаем\n```\n\nИ... Ничего! Оверскан продолжает работать. Также на форумах нашел рекомендацию выключить стриминг аудио по HDMI. Казалось бы, при чем здесь оверскан? Но можно попробовать:\n\n```bash\nxrandr --output HDMI-1 --set audio force-dvi\n```\n\nИ опять никакого эффекта. Ни в максимально близком \"стандартном\" режиме (1280x720), ни в \"родном\" разрешении.\n\n### Но выход есть! \n~~в окно~~\n\nПокопавшись в интернете и почти-разочаровавшись в этом мире, я наткнулся на [совершенно отвлеченный сайт](https://zoom.cnews.ru/goods_card/item/1758052/toshiba-19av501), на котором собраны характеристики этой модельки телевизора.\n\nИ там были две очень интересные строки: (Естественно, этой информации не было в официальной инструкции. Потому что страдай.)\n\n[![Скриншот с сайта](../public/assets/blog/authoritarian-tv-interfaces/screenshot.png)](../public/assets/blog/authoritarian-tv-interfaces/screenshot.png)\n\nТам есть разделение на *\"Поддерживаемые форматы входного сигнала\"* и *\"Доступные разрешения при подключении к ПК\"*. Так чем же они отличаются? \n\nКак выяснилось методом тыка — **именно стримингом звука**. Если отключить звук командой, указанной выше, и выставить разрешение из списка *\"Доступные разрешения при подключении к ПК\"*, то телевизор автоматически переходит в режим \"монитора\" и начинает отображать картинку в том же размере, как она отправляется с компьютера. \n\nНо, ЧСХ, среди этого списка \"доступных\" разрешений **НЕТ родного**. Так что, полностью от мыла **избавиться не удастся**. Но это уже кое-что. Затаив лёгкую злобу на разработчиков, выбираем максимальное разрешение из доступных.\n\nИтоговый скрипт запуска этого монитора в нормальном режиме выглядит следующим образом:\n\n```bash\n#! /bin/bash\n\nxrandr --output HDMI-1 --set audio force-dvi\nxrandr --newmode \"1360x768_60.00\"   84.75  1360 1432 1568 1776  768 771 781 798 -hsync +vsync\nxrandr --addmode HDMI-1 1360x768_60.00\nxrandr --output HDMI-1 --mode 1360x768_60.00\n```\n\nЯ его не стал вешать на автозапуск, т.к. иногда подключаю другие устройства по HDMI, и у них со стандартными настройками всё в порядке. Не хотелось бы ломать с ними связь. Так что, я запускаю скрипт после подключения конкретно этого телевизора. \n\n## Финал\n\nЯ очень рад, что основные проблемы разрешились и телевизор заработал в приемлемом режиме. Но длительных танцев с бубном можно было бы **избежать**, если бы переключение с режима **\"телевизора\"** на режим **\"монитора\"** (без оверскана) происходило нормально в меню телевизора, а не отключением стриминга аудио по HDMI. (Что характерно, на windows его вообще не выключить.)\n\nА отсутствие родного разрешения экрана в списке \"поддерживаемых\" — это вообще отдельная шутка инженеров над пользователями. Но с ней можно мириться. \n\nВсех благ\n\n<iframe frameborder=\"0\" style=\"border:none;width:100%;height:180px;\" width=\"100%\" height=\"180\" src=\"https://music.yandex.ru/iframe/#track/63801314/10183597\">Слушайте <a href='https://music.yandex.ru/album/10183597/track/63801314'>Тоталитаризм</a> — <a href='https://music.yandex.ru/artist/8896777'>808hardcore</a> на Яндекс.Музыке</iframe>\n\n#linux #танцы_с_бубном","ogImage":{"url":"/assets/blog/authoritarian-tv-interfaces/background.jpg"},"coverImage":"/assets/blog/authoritarian-tv-interfaces/background.jpg","issueId":"15","excerpt":"Делюсь собственной болью использования LCD-телевизора в качестве монитора на карантине"},{"title":"Экспортируем нужные нам данные из openStreetMap","date":"2020-07-05T14:15:07.322Z","slug":"exporting_data_form_osm","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"\nИногда возникает ситуация, в которой нам жизненно необходимо получить структурированные геоданные для своих проектов. Но где их искать? Делать на коленке парсер *google maps*?\n\nНа самом деле нет — всё куда прозаичнее. Их можно без зазрения совести скоммуниздить из прекрасного проекта *openStreetMaps*, попутно дополнив и исправив текущие данные в их базах.\n\n**Краткая справка для тех, кто в танке:** *openStreetMaps* (или кратко *OSM*) — *open source* картографический проект, где каждый пользователь может чуть-чуть дорисовать карту. И по принципу \"с миру по нитке\" собирается свободная и бесплатная карта мира. (как с википедией, только карта)\n\n## Процесс раскулачивания геосервиса запущен\n![Псс, парень, не хочешь немного геоданных?](../public/assets/blog/exporting_data_form_osm/meme.jpg)\n\nИтак, в моём конкретном случае, мне нужно получить данные **по всем железнодорожным станциям России**: название, её код в какой-нибудь международной классификации + координаты. У вас это могут любые другие данные, принцип получения от этого толком не изменяется. \n\nДля вытаскивания небольших данных из *OSM* есть онлайновый инструмент, который позволяет делать запросы и получать результат в *JSON*.\n\nНо лично для меня этот язык запросов выглядит слишком странным + этот инструмент работает до невозможности медленно (а иногда благополучно лежит). [overpass-turbo](https://overpass-turbo.eu/)\n\nНо можно пойти куда **более простым и понятным** путём:\n\n1. Скачать дамп всех данных *OSM* (или маленький кусочек нужной нам территории)\n2. Отфильтровать объекты (оставить только те типы объектов, которые нам нужны)\n3. Преобразовать в формат, который пригоден для загрузки в БД\n\n## Небольшая вставка теории:\nЧтобы придумать, как вытащить железнодорожные станции, нужно понимать, какие данные и с какой структурой там в принципе есть. \n\nЕсть очень хорошая [вводная статья на хабре](https://habr.com/ru/post/146503/).<br>\nА также имеется [официальная дока](https://wiki.openstreetmap.org/wiki/Map_Features).\n\n**Если кратко:**\n\nДамп данных из *OpenStreetMap* можно представить в виде здоровенного XML файла, который содержит в себе ~~помойку~~ большое скопление тэгов трёх типов:\n\n1. Точки (**node**)\n2. Линии (**way**)\n3. Отношения (**relation**)\n\nВнутри этих тэгов заполняется всякая информация о них в виде **key:value**.\n\n**Например:**\nДавайте попробуем найти в интерфейсе *OSM* любую станцию и посмотреть, что там внутри.\n\nСтанция **Шушары** и её информация (слева в таблице):\n\n![Станция Шушары в интерфейсе](../public/assets/blog/exporting_data_form_osm/shushary.png)\n\nТеперь посмотрим, как она выглядит в данных:\n```xml\n<node id=\"1377619868\" lat=\"59.8057985\" lon=\"30.3884693\" version=\"9\" timestamp=\"2019-05-08T05:34:15Z\" changeset=\"70007449\" uid=\"474169\" user=\"Yevgeny Gromov\">\n    <tag k=\"esr:user\" v=\"033004\"/>\n    <tag k=\"name\" v=\"Шушары\"/>\n    <tag k=\"railway\" v=\"station\"/>\n    <tag k=\"uic_ref\" v=\"2005166\"/>\n    <tag k=\"wikidata\" v=\"Q4528146\"/>\n    <tag k=\"wikipedia\" v=\"ru:Шушары (станция)\"/>\n</node>\n```\n\nДанные хранятся в виде\n```xml\n<tag k=\"key\" v=\"value\"> \n```\nвнутри нашей точки *\"Шушары\"*. А координаты хранятся в атрибутах самого тега \"node\" (lat/lon).\n\nЗамечаем, что признак \"железнодорожная станция\" — это вот такой тэг. На него и будем ориентироваться, когда будем фильтровать данные:\n```xml\n<tag k=\"railway\" v=\"station\"/>\n```\n\nОкей, мы поняли структуру, поняли что нам надо. Но где данные, Лебовски?\n\n![Ваши данные будут храниться здесь](../public/assets/blog/exporting_data_form_osm/meme%20data.jpg)\n\n## Добываем данные\nЕсли у вас достаточно свободного пространства на жестком диске — можете попробовать выкачать весь мир [по официальным инструкциям](https://wiki.openstreetmap.org/wiki/Downloading_data).\n\nЛибо можно зайти на сайт [openStreetMap](https://www.openstreetmap.org/), открыть на карте нужный квадрат и нажать на \"Экспорт\".\n\n### У России другой путь\n**Проблема России в том**, что она достаточно большая, чтобы экспорт в интерфейсе *openStreetMap* **падал** из-за слишком большого количества данных, но всё ещё достаточно маленькая, чтобы ради неё выкачивать весь мир!\n\nСпециально для таких извращенцев, как мы, некоторые люди подготавливают \"нарезку\" мира на удобоваримые куски:\n\n* На [geofabrik.de](https://download.geofabrik.de/) имеются нарезки по континентам\n* На [needgeo.com](https://needgeo.com/) есть данные по странам пост-советского пространства.\n\nПоследняя ссылка как раз нам очень пригодится! :) Выкачиваем оттуда файл RU.pbf (который весит сущие копейки — всего **3GB**)\n\n## Обрабатываем данные\nДля обработки нам понадобятся две консольные утилиты: **osmconvert** и **osmfilter**.\n\nВ *debian/ubuntu* устанавливаются очень просто одной командой:\n```bash\nsudo apt install osmctools\n```\nДля остальных *ОС* имеются ссылки на бинарники на официальной wiki [Osmfilter](https://wiki.openstreetmap.org/wiki/Osmfilter) [Osmconvert](https://wiki.openstreetmap.org/wiki/Osmconvert).\n\nВо-первых, нам нужно распаковать скачанный файл **.pbf** в пригодный для фильтрации формат.\n```bash\nosmconvert RU.pbf -o=RU.o5m\n```\nНа выходе получим файл RU.o5m, который занимает уже 6.2GB. (но это всё ещё бинарный не человеко-читаемый файл.)\n\nТеперь отбрасываем всё лишнее, оставляя только точки с нужным там тегом (который мы нашли в предыдущих параграфах):\n```bash\nosmfilter RU.o5m --keep=\"railway=station\" > stations.osm\n```\nКомпьютер задумается на какое-то время, а затем заполнит файл *stations.osm*. Де-факто, уже почти всё. Мы на выходе получили *XML* файл со всеми нужными нам станциями (3Mb). \n\n**Попробуем проверить данные:**\nОткрываем в любом текстовом редакторе, который способен открывать большие текстовые файлы (vim), и бегло просматриваем станции:\n\nИ тут натыкаемся на станцию метро \"Озерки\". Что ж, формально — это жд, и формально — станция. Но не совсем то, что мне нужно. :)\n\n```xml\n<node id=\"96459081\" lat=\"60.0354511\" lon=\"30.3210663\" version=\"24\" timestamp=\"2020-01-08T22:53:32Z\" changeset=\"79358758\" uid=\"217225\" user=\"&#38;ergio\">\n    <tag k=\"colour\" v=\"blue\"/>\n    <tag k=\"layer\" v=\"-5\"/>\n    <tag k=\"name\" v=\"Озерки\"/>\n    <tag k=\"name:de\" v=\"Oserki\"/>\n    <tag k=\"name:en\" v=\"Ozerki\"/>\n    <tag k=\"name:fi\" v=\"Ozerki\"/>\n    <tag k=\"name:ru\" v=\"Озерки\"/>\n    <tag k=\"network\" v=\"Петербургский метрополитен\"/>\n    <tag k=\"operator\" v=\"Петербургский метрополитен\"/>\n    <tag k=\"public_transport\" v=\"station\"/>\n    <tag k=\"railway\" v=\"station\"/>\n    <tag k=\"station\" v=\"subway\"/>\n    <tag k=\"subway\" v=\"yes\"/>\n    <tag k=\"transport\" v=\"subway\"/>\n    <tag k=\"wikidata\" v=\"Q2241386\"/>\n    <tag k=\"wikipedia\" v=\"ru:Озерки (станция метро)\"/>\n</node>\n```\n\nВидим там целых три тега, которые свидетельствуют о том, что это метро. (зачем такая избыточность?)\n```xml\n<tag k=\"station\" v=\"subway\"/>\n<tag k=\"subway\" v=\"yes\"/>\n<tag k=\"transport\" v=\"subway\"/>\n```\nФильтруем по этим тегам:\n```bash\nosmfilter stations.osm --drop=\"station=subway or subway=yes or transport=subway\" > not_subway.osm\n```\n\nСмотрим на выходной файл — выглядит так, словно успешно отфильтровали. Теперь осталось превратить xml файл в CSV, чтобы удобно залить в базу.\n\nСмотрим на документацию по станциям и составляем список тегов, которые будем выводить в CSV:\n[railway:stations](https://wiki.openstreetmap.org/wiki/RU:Tag:railway%3Dstation)\n\n**Нужные нам столбцы:** \n\n1. id\n2. lat\n3. lon\n4. name\n5. uic_ref — уникальный код железнодорожной станции, присваиваемый UIC (International Union of Railways, Международный союз железных дорог).\n6. esr:user — уникальный код железнодорожной станции в Единой сетевой разметке (ЕСР, для станций Балтики и стран СНГ).\n\nЭкспортируем (обратите внимание, что атрибуты самого *node* записываются через \"@\"):\n```bash\nosmconvert not_subway.osm --all-to-nodes --csv=\"@id @lat @lon name uic_ref esr:user\" --csv=headline > stations.csv\n```\n\nТеперь мы можем со спокойной совестью делать с этими данными, что душе угодно. Можем обрабатывать руками в *EXCEL*, можем залить в базу и использовать в своих разнообразных проектах. \n\nЕсли найдете какие-то неточности в данных, очень рекомендуется исправить их не только у себя, а залить их также на саму *OpenStreetMap*. Так сказать, сделать свой маленький вклад в общее дело. :)\n\n\nP.S. Мистическим образом, под железнодорожные станции ещё мимикрирует Волгоградский метротрам. Но его уже можно отфильтровать в итоговом CSV.\n\n<iframe frameborder=\"0\" style=\"border:none;width:100%;height:180px;\" width=\"100%\" height=\"180\" src=\"https://music.yandex.ru/iframe/#track/31840941/3867842\">Слушайте <a href='https://music.yandex.ru/album/3867842/track/31840941'>У трамвая жизнь кривая. норвежская свекла</a>  —  <a href='https://music.yandex.ru/artist/3976133'>Ремонт Воды</a> на Яндекс.Музыке</iframe>\n\n[Итоговый CSV файл со станциями здесь.](../public/assets/blog/exporting_data_form_osm/stations.csv)\n\n#танцы_с_бубном #работа_с_данными","ogImage":{"url":"/assets/blog/exporting_data_form_osm/background.jpg"},"coverImage":"/assets/blog/exporting_data_form_osm/background.jpg","issueId":"12","excerpt":"Иногда возникает ситуация, в которой нам жизненно необходимо получить структурированные геоданные для своих проектов. Можно, конечно, долго собирать данные руками, а можно обратиться к прекрасным открытым базам данных."},{"title":"Организуем удалённое рабочее место на машине с linux","date":"2020-06-07T14:15:07.322Z","slug":"remote-workplace-linux","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"\nНа фоне эпидемии появилась необходимость в организации удобной удалённой работы на домашнем компьютере с ос *linux* на борту: настроить *rdp* клиент + *skype for business* (*lync*).\n\n### Зачем?\n\nНе все работодатели готовы предоставлять работникам именно *VPN* для доступа к корпоративным сервисам. Лишь открывают RDP-терминал. Видимо, так им кажется безопаснее ¯\\\\_(ツ)_/¯. А также, некоторые вещи физически невозможно развернуть на локальных машинах, так что в некоторых ситуациях протокол удалённых рабочих столов просто необходим.\n\n### Как должно работать в идеале:\n\n1. Нужен настроенный *RDP* клиент с поддержкой *gateways* на linux, который по одному клику открывает рабочий стол удалённой машины.\n2. Нужна возможность созваниваться по skype for business с коллегами без огромных задержек от RDP. В идеале — запуск клиента на локальной машине.\n\n## Добываем себе возможность работать в трусах\n![Удалёнка](../public/assets/blog/remote-workplace-linux/meme.jpg)\n\n\n### RDP\nВ качестве rdp клиента будем использовать *freerdp* — это один из немногих linux rdp клиентов, который поддерживает шлюзы (gateways). Устанавливаем:\n\n```bash\nsudo apt instal freerdp\n``` \nТеперь запускать удалённые rdp-сеансы мы можем с помощью консольной команды **xfreerdp**. С определенными параметрами:\n\nСо всеми доступными параметрами можно [познакомиться (здесь)](https://github.com/FreeRDP/FreeRDP/wiki/CommandLineInterface \"CommandLineInterface\"). Но нас интересуют вполне конкретные:\n\n1. **/f** — fullscreen mode\n2. **/multimon** — поддержка нескольких мониторов\n3. **/rfx** — \"расширенный\" протокол поверх RDP. \n4. (опционально) **/sound:sys:alsa** — включение стриминга звука на локальную машину\n5. **+clipboard** — расшаривание буфера обмена между удалённым рабочим столом и клиентской машиной\n6. **+fonts** — включить сглаживание шрифтов. \n7. **/v** — хост url\n8. **/d** — домен пользователя,\n9. **/u** — пользователь\n10. **/p** — пароль пользователя\n11. **/g** — шлюз url\n12. **/gd** — домен для авторизации на шлюзе\n13. **/gu** — пользователь для авторизации на шлюзе\n14. **/gp** — пароль для авторизации на шлюзе\n\nИтоговый скрипт запуска у нас будет следующим:\n\n```bash\n#! /bin/bash\n\nxfreerdp /v:targetUrl /d:domain /u:username /p:password /g:gateway /gd:domain /gu:username /gp:password /f /multimon /rfx /sound:sys:alsa +clipboard +fonts\n```\nВсё это можно сохранить в текстовом файле, сделать его исполняемым и положить для удобства на рабочий стол.\n\n```bash\nsudo chmod +x filename # Сделать исполняемым\n```\n\n### Skype for business (lync)\n\nНесмотря на то, что порт обычной (не бизнесовой) версии скайпа  на линукс официально поставляется разработчиками — бизнесовой версии под linux **нет**. Браузерная версия Skype (*Skype web app*) тоже не заведется, т.к. для его функционирования нужно нативное windows-расширение для браузера. Как быть?\n\nВ этом нам поможет прекрасный плагин для мессенджеров — [SIPE](https://sipe.sourceforge.io/ \"A third-party Pidgin plugin for Microsoft LCS/OCS\"). Он позиционирует себя как open-source имплементация протокола OCS, по которому общаются клиенты *Skype for business*.\n\nУстановим pidgin + sipe\n\n```bash\nsudo apt install pidgin pidgin-sipe\n```\n\nПри создании учетных записей выбираем протокол \"Office Communicator\"\n![Pidgin protocols list](../public/assets/blog/remote-workplace-linux/pidgin-protocols.png)\n\nВводим active directory login/e-mail/пароль. И вуаля! Подключается и работает.\n\nПоскольку, это не официальный клиент, многие (не основные) функции могут отсутствовать. Но базовых более чем хватает:\n\n1. Чат\n2. Звонки, как приватные, так и конференции. \n3. Демонстрация рабочего стола\n4. Совместное использование рабочего стола\n\n#linux #танцы_с_бубном #офисная_боль ","ogImage":{"url":"/assets/blog/remote-workplace-linux/logo.jpg"},"coverImage":"/assets/blog/remote-workplace-linux/logo.jpg","issueId":"9","excerpt":"На фоне эпидемии появилась необходимость в организации удобной удалённой работы на домашнем компьютере с ос linux на борту: настроить нормальный rdp клиент + skype for business (lync)"},{"title":"Использование issues в GitHub как движок комментариев","date":"2020-05-04T14:15:07.322Z","slug":"issue-comments-github","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"\nХочу поделиться замечательной идеей: превращения **GitHub issues** в полноценный движок комментариев для статического блога. Достойная легковесная (и бесплатная!) замена *disqus* и аналогов.\nДля начала, маленькая вводная, с чего всё начиналось:\n\nБыл скучный выходной день во время карантина и я лениво читал интернеты в поисках удобного движка комментариев для своего блога. Я уже был готов поддаться маркетингу disqus'a, но внезапно наткнулся на интересную статью:\n\n(http://donw.io/post/github-comments/)\n\nВ ней автор анализирует трафик своего сайта и приходит к удручающему выводу: *disqus* настолько активно использует трекеры и прочие запросы на сервер, что в примере автора, увеличивал количество XHR-запросов с 16 до 105! Это совершенно неприемлемо. И в качестве альтернативы, рассказчик предлагает переход к ... GitHub Issues! \n\nВ статье прелагается следующая схема:\n\n1. На каждый пост в блоге открывается *issue в GitHub*\n2. Все комментарии создаются непосредственно на сайте *GitHub*\n3. При открытии страницы, клиентский JavaScript код получает все комментарии из issue через *issue API*\n\n## Заводим свой ~~трактор~~ велосипед\n![Возможно всё, но зачем?](../public/assets/blog/issue-comments-github/но_зачем.png)\n\nИ тут я подумал, что раз уж весь мой блог использует *GitHub Pages* в качестве хостинга, то почему бы не попробовать ещё больше интегрироваться в экосистему гитхаба?\n\n### Предварительный алгоритм работы с комментариями (пока я не автоматизировал деплой):\n\n1. Перед созданием поста, руками создаётся issue, оттуда копируется ID и вставляется в .md-темплейт поста.\n2. В исходники страницы добавлен маленький скрипт, который подхватывает этот id страницы и по нему (через Github API получает все комментарии (отрендеренный markdown в html)\n3. Рендер комментариев. \n4. Добавление кнопки \"создать комментарий\", который просто перебрасывает пользователя на страницу GitHub\n\n### Реализация\n\nПоскольку я храню все посты на этом сайте в markdown файлах, мне первым делом нужно запомнить, что при создании файла, в метаданных я теперь буду обязан указывать issue id.\n\n```javascript\n{\n    title: 'Первый пост с использованием markdown и next js'\n    excerpt: 'А заодно и проверка возможности писать на кириллице в этом шаблонизаторе. Если вы читаете этот текст, значит полет нормальный.'\n    coverImage: '/assets/blog/hello-world/завтра_будет_лучше.jpg'\n    date: '2020-05-03T21:00:07.322Z'\n    issueId: '1' // <--- id созданного issue на GitHub\n} \n```\nВ конец страницы с постом добавлен React-компонент Comments, который будет отображать комментарии из ГитХаба. \n\n```html\n    <article>\n        <Comments \n            githubUser=\"JustAddAcid\"\n            githubRepo=\"JustAddAcid.github.io\"\n            issueId={post.issueId} />\n    </article>\n```\n\nВнутри компонента **Comments** делаем GET-запрос в https://api.github.com/repos/ ${githubUser}/ ${githubRepo}/issues/ ${issueId}/comments. Например, для комментариев к этой странице, это будет:\n\n(https://api.github.com/repos/ JustAddAcid/JustAddAcid.github.io/ issues/2/comments)\n\n```javascript\ncomponentDidMount() {\n    if (!this.state.data) {\n        const githubUser = this.props.githubUser\n        const githubRepo = this.props.githubRepo\n        const issueId = this.props.issueId\n\n        const that = this;\n        window.fetch(`https://api.github.com/repos/${githubUser}/${githubRepo}/issues/${issueId}/comments`, {\n            headers: {\n                Accept: 'application/vnd.github.v3.html+json'\n            }\n        })\n            .then(response => response.json())\n            .then(comments => that.setState({\n                data: comments,\n                isLoading: false\n            }))\n```\n\nНу и красиво рендерим JSON-array, который нам пришел из гитхаба\n\n```javascript\n    render(){\n        // ....\n        {hasData && (\n            this.state.data.map(comment => (\n                <Comment\n                    key={comment.id}\n                    avatarUrl={comment.user.avatar_url}\n                    userProfileUrl={comment.user.html_url}\n                    userLogin={comment.user.login}\n                    commentDate={comment.created_at}\n                    commentBody={comment.body_html} />\n            ))\n        )}\n        <LinkButton text=\"Добавить комментарий\" link={`https://github.com/${githubUser}/${githubRepo}/issues/${issueId}`} />\n    }\n```\n\nПосле причесывания стилей — получаем достаточно минималистичную и приятную на глаз систему комментариев с поддержкой markdown, цитирования и т.д., которой можно воспользоваться внизу страницы.\n\nЕщё увидимся.\n\n#танцы_с_бубном #javascript ","ogImage":{"url":"/assets/blog/issue-comments-github/cover.png"},"coverImage":"/assets/blog/issue-comments-github/cover.png","issueId":"2","excerpt":"Хочу поделиться замечательной идеей: превращения GitHub issues в полноценный движок комментариев для статического блога. Достойная легковесная (и бесплатная!) замена disqus и аналогов."}],"tag":"танцы_с_бубном"},"__N_SSG":true}