{"pageProps":{"post":{"title":"Перевод книжки \"Дезинформация в военное время\" Артур Понсоби","date":"2022-06-22T20:34:14.097Z","slug":"falsehoodInWarTime","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"<h1>Arthur Ponsonby \"Falsehood in War-time\"</h1>\n<p>Поскольку в интернете вообще нет перевода этой книжки на русский язык, я решил этим заняться. За основу взял автоматический перевод, который (с оглядкой на оригинал) я буду постепенно доводить до ума.</p>\n<p>Но вы тоже можете помочь, сделав пулл-реквест с правками на файл <em>/_posts/falsehoodInWarTime.md</em> <a href=\"https://github.com/JustAddAcid/blog-generator\">в репозитории этого сайта</a>. Или просто написать в комменты, что мне поправить. Заранее спасибо. :)</p>\n<p>Референс, с которого был перевод, хранится на замечательном сайте, который <em>(не удивительно)</em> заблокирован на территории расиси: <a href=\"http://gutenberg.net.au/ebooks10/1000011.txt\">\"Falsehood in War-time\" on Project Gutenberg</a></p>\n<p><strong>Ахтунг! Перевод находится в совсем начальной стадии. Возможны не просто неточности, а целые неточнища. Надеюсь на понимание</strong></p>\n<!-- book start -->\n<h2>Дезинформация во время войны: пропагандистская ложь Первой мировой войны Автор: Артур Понсонби</h2>\n<p> Опубликовано в 1928</p>\n<p><strong>Cодержание</strong></p>\n<ol>\n<li><strong>Предисловие</strong></li>\n<li><strong>Введение</strong></li>\n<li><strong>Приверженность Франции</strong></li>\n<li><strong>Сербия и убийство эрцгерцога</strong></li>\n<li><strong>Вторжение в Бельгию как причина Великая война</strong></li>\n<li><strong>Исключительная ответственность Германии за войну</strong></li>\n<li><strong>Переход русских войск через Великобританию</strong></li>\n<li><strong>Изуродованная медсестра</strong></li>\n<li><strong>Преступный кайзер</strong></li>\n<li><strong>Бельгийский младенец без рук</strong></li>\n<li><strong>Лувенский алтарь</strong></li>\n<li><strong>Презренная маленькая армия</strong></li>\n<li><strong>Deutschland Über alles</strong></li>\n<li><strong>Ребенок из курбского туалета</strong></li>\n<li><strong>Распятый канадец</strong></li>\n<li><strong>Расстрел францёслинга</strong></li>\n<li><strong>Коллекция марок маленького Альфа</strong></li>\n<li><strong>Татуированный мужчина</strong></li>\n<li><strong>Фабрика трупов</strong></li>\n<li><strong>Письмо епископа Занзибара</strong></li>\n<li><strong>Негодование немецкой подводной лодки</strong></li>\n<li><strong>Константинополь</strong></li>\n<li><strong>\"Лузитания\"</strong></li>\n<li><strong>Отчет о разорванном собрании</strong></li>\n<li><strong>Рассказы о злодеяниях</strong></li>\n<li><strong>Фальшивые фотографии</strong></li>\n<li><strong>Подделка официальных документов</strong></li>\n<li><strong>Лицемерное негодование</strong></li>\n<li><strong>Другая ложь</strong></li>\n<li><strong>Фабрикация новостей</strong></li>\n<li><strong>Цели войны</strong></li>\n<li><strong>Иностранная ложь--</strong>\n<ol>\n<li><strong>Германия</strong></li>\n<li><strong>Франция</strong></li>\n<li><strong>США</strong></li>\n<li><strong>Италия</strong></li>\n</ol>\n</li>\n</ol>\n<p> Предисловие</p>\n<p> За составление и сбор материалов для этого тома я в долгу перед лордом Тавистоком. За отзывчивую помощь и полезные советы. Профессор Сальвемини, мистер Фрэнсис Нильсон, мистер Т. Диксон, миссис С. Р. Бакстон, миссис Ури, мисс Дарем и миссис Уоллис также помогали мне в проведении исследований. Я благодарен различным корреспондентам, которые снабдили меня материалом. Особую благодарность я выражаю мисс Маргарет Дигби за ее исследовательскую работу и пересмотр корректур.</p>\n<p> Цитаты</p>\n<blockquote>\n<p>«Ложь никогда не стареет». -- Софокл.</p>\n</blockquote>\n<blockquote>\n<p>«Когда объявляется война, Истина становится первой жертвой».</p>\n</blockquote>\n<blockquote>\n<p>\"Kommt der Krieg ins Land Gibt Lügen wie Sand\". (Когда начинается война, ложь подобна песку)</p>\n</blockquote>\n<blockquote>\n<p>«Вы обнаружите, что войны поддерживаются классом аргументов, которые после окончания войны люди находят аргументами, к которым им никогда не следовало прислушиваться».\n--Джон Брайт.</p>\n</blockquote>\n<blockquote>\n<p>«На арене международного соперничества и конфликтов люди поставили патриотизм выше правдивости как обязательной добродетели государственных деятелей».\n--Стэнли Болдуин.</p>\n</blockquote>\n<blockquote>\n<p>«Легче делать деньги на лжи, чем на правде. Правда имеет только одну силу, она может зажигать души. Но ведь душа — это большая сила, чем толпа».\n--ГРАММ. Лоус Дикинсон.</p>\n</blockquote>\n<blockquote>\n<p>«И когда пришла война, мы рассказали молодежи, которая должна была вытащить нас из нее, небылицы о том, что это такое на самом деле, и о том, к чему она приводит».\n--Дж. М. Барри.</p>\n</blockquote>\n<p> Введение</p>\n<p> Цель этой книги не в том, чтобы возложить новую вину на власти и отдельных лиц, а также не в том, чтобы подвергнуть одну нацию большему, чем другую, обвинениям в обмане. <strong>Ложь</strong> — общепризнанное и чрезвычайно полезное оружие в войне. И каждая страна вполне <strong>сознательно</strong> использует его, чтобы обмануть собственный народ, привлечь сомневающихся и ввести в заблуждение врага. </p>\n<p> Невежественный и невинный народ не понимает, что его вводят в заблуждение. А когда всё кончено -- всюду обнаруживается и разоблачается обман. Но поскольку события уже завершены, а эти рассказы и утверждения уже произвели желаемый эффект -- никто не утруждает себя расследованием фактов и установлением истины.</p>\n<p> Ложь, как известно, бывает не только в военное время. Говорят, что человек — не «правдивое животное», но его привычка лгать не так уж необычна, как его <strong>поразительная готовность верить</strong>. Именно из-за человеческой доверчивости расцветает ложь. Но в военное время авторитарная машина лжи особенно опасна, хотя многие этого не замечают. Обман целых народов — дело не легкомысленное.</p>\n<!-- Нужно это полностью перефразировать, просто ужасно читается -->\n<p> Полезную цель, таким образом, может послужить в период так называемого мира предостережение, которое люди могут рассматривать с беспристрастным спокойствием, о том, что власти каждой страны прибегают и даже должны прибегать к этой практике, чтобы, во-первых, оправдать себя. Изображая врага как неразбавленного преступника; и, во-вторых, достаточно разжечь народные страсти, чтобы обеспечить рекрутов для продолжения борьбы. Они не могут позволить себе говорить правду. В некоторых случаях надо признать, что на данный момент они не знают, что такое истина.</p>\n<p> <strong>Психологический</strong> фактор на войне так же важен, как и военный фактор. Моральный дух гражданских лиц, а также солдат должен поддерживаться на должном уровне. Военные министерства, адмиралтейства и министерства авиации заботятся о военной стороне. Отделы [по связям с общественностью] должны быть созданы, чтобы следить за психологической стороной. Нельзя допускать, чтобы люди впадали в уныние; поэтому победы надо преувеличивать, а поражения если не замалчивать, то, во всяком случае, преуменьшать, а раздражители негодования, ужаса и ненависти надо усердно и непрерывно нагнетать в общественное сознание посредством <em>пропаганды</em>.</p>\n<p> Как сказал г-н Бонар Лоу в интервью <em>United Press of America</em>, говоря о патриотизме, «хорошо, чтобы он был должным образом взволнован немецкой ужасностью»; своего рода общее подтверждение злодеяний дается расплывчатыми фразами, которые избегают ответственности за подлинность той или иной истории, как, например, когда г-н Асквит сказал (Палата общин, 27 апреля 1915 г.): <em>«Мы не забудем этого ужасного свидетельства расчетливой жестокости и преступлений»</em>.</p>\n<p> Использование оружия лжи более необходимо в стране, где нет призывной армии, чем в странах, где мужское население автоматически призывается в армию, флот или авиацию. Публику можно эмоционально взбудоражить <em>мнимыми идеалами</em>. И какая-нибудь коллективная истерия распространится, вырастет, пока, наконец, не возьмёт верх над трезвыми людьми и солидными газетами.</p>\n<p> Но имея это <strong>предупреждение</strong>, простые люди могут быть более бдительными, когда облако войны в следующий раз появится на горизонте, и менее склонными принимать за правду слухи, объяснения и заявления, выпущенные для их потребления. Они должны понимать, что правительство, решившееся на опасное и ужасное предприятие войны, должно с самого начала придумать оправдания своих действий. И совершенно не может согласиться в том, что <em>\"по ту сторону\"</em> люди в чем-то правы и разумны. Факты должны быть <strong>искажены</strong>, соответствующие обстоятельства <strong>сокрыты</strong> и представлена ​​картина, которая своим грубым колоритом убедит невежественных людей в том, что их правительство непорочно, их дело правое. И что неоспоримая злоба врага бесспорно доказана. Мгновенное размышление подскажет любому здравомыслящему человеку, что такая очевидная предвзятость никак не может отражать истину. <strong>Но рефлексия момента не допускается</strong>; ложь распространяется со стремительной скоростью. Бездумная масса принимает их. И своим возбуждением влияет на остальных. Количество вздора и вздора, выдаваемого за патриотизм в военное время во всех странах, достаточно, чтобы порядочные люди краснели, когда они впоследствии осознают происходящее.</p>\n<p> С самого начала торжественные заверения монархов и ведущих государственных деятелей каждой нации в том, что они не хотят войны, должны быть поставлены в один ряд с заявлениями людей, которые обливают дом керосином, зная, что они постоянно чиркают спичками, и тем не менее утверждают, что не хотят войны. Пожар. Эта форма самообмана, предполагающая обман других, в основе своей нечестна.</p>\n<p> Поскольку война считается общепризнанным институтом, к которому следует прибегать, когда правительства ссорятся, народ более или менее подготовлен. Они вполне охотно заблуждаются, чтобы оправдать собственные действия. Они стремятся найти предлог для демонстрации своего патриотизма или склонны <strong>воспользоваться возможностью</strong> для волнения и новой жизни, полной приключений, которую <strong>открывает перед ними война</strong>. Получается своего рода народное подмигивание, все идут вперед, а индивидуум, в свою очередь, берет на себя ложь как патриотический долг. При низком уровне морали, преобладающем в военное время, такая практика кажется почти невинной. Его усилия иногда немного грубы, но он делает все возможное, чтобы следовать по данному примеру. Агенты нанимаются властями и поощряются к так называемой пропагандистской работе. Тип, который выдвинулся на передний план в распространении лжи на вербовочных собраниях, теперь хорошо известен. Судьба, постигшая по крайней мере одного из самых популярных из них в нашей стране, свидетельствует о том, до какой глубины падает общественное мнение в атмосфере войны.</p>\n<p> С подслушивателями, вскрывателями писем, дешифровщиками, телефонными прослушивателями, шпионами, отделом прослушивания, отделом подделки документов, отделом уголовного розыска, отделом пропаганды, отделом разведки, отделом цензуры, министерством информации, бюро печати и т.д. , различные правительства были хорошо оснащены, чтобы <em>«инструктировать»</em> свои народы.</p>\n<p> Британский отдел официальной пропаганды в Крю-Хаусе под руководством лорда Нортклиффа добился больших успехов. Их методы, особенно обрушение миллионов листовок на немецкую армию, намного превосходили все, что предпринимал враг. В «Секретах дома Крю» сэра Кэмпбелла Стюарта, методы описаны для нашего удовлетворения и одобрения. Заявление о том, что использовались только «правдивые утверждения», повторяется слишком часто и не совсем соответствует описанию поддельных букв, поддельных заголовков и обложек книг, которые были использованы. Но, конечно, мы знаем, что такие ловкие пропагандисты столь же ловки в обращении с нами после события, как и в отношении врага во время. В явно откровенном описании их деятельности мы знаем, что слышим только часть истории. Циркуляторы неблагородного металла знают, как использовать нужное количество сплава как для нас, так и для врага.</p>\n<p> Во многих отзывах немецких генералов и немецкой прессы об успехе нашей пропаганды нет никаких доказательств того, что наши утверждения всегда были строго правдивыми. Процитирую одного из них: генерал фон Хуттер из 6-й немецкой армии прислал сообщение, в котором встречается следующий отрывок:</p>\n<p> «Метод Нортклиффа на фронте состоит в том, чтобы распространять через летчиков постоянно растущее количество листовок и брошюр; заключенных фальсифицируются самым возмутительным образом, сочиняются трактаты и памфлеты, в которых подделываются имена немецких поэтов, писателей и государственных деятелей или которые имеют вид напечатанных в Германии и носят, например, заглавие из серии Reclam, когда они на самом деле исходят из издательства Northcliffe, которое работает день и ночь для той же цели.Его мысль и цель заключаются в том, чтобы эти подделки, какими бы очевидными они ни казались человеку, который дважды подумает, могут вызвать сомнение , хотя бы на мгновение, в умах тех, кто не думает сам за себя, и чтобы их уверенность в своих вождях, в своих силах и в неисчерпаемых ресурсах Германии могла быть подорвана».</p>\n<p> Пропаганда, прежде всего, была основана на зыбучих песках мифа об исключительной ответственности Германии. Позже оно несколько запуталось из-за неспособности наших государственных деятелей заявить, каковы были наши цели, и к концу оно было подкреплено описаниями великолепного, справедливого и праведного мира, который должен был «установиться на прочных основаниях». К сожалению, это оказалось величайшей ложью из всех.</p>\n<p> В спокойной ретроспективе мы можем лучше оценить пагубные последствия яда лжи, произведенной официально, полуофициально или частным образом. Справедливо сказано, что впрыскивание яда ненависти в умы людей посредством лжи есть большее зло в военное время, чем фактическая гибель людей. Осквернение человеческой души хуже, чем разрушение человеческого тела. Необходимо более полное осознание этого.</p>\n<p> Другим следствием постоянного появления ложных и предвзятых утверждений и поглощения атмосферы лжи является то, что подвиги настоящей доблести, героизма и физической выносливости и подлинные случаи неизбежных пыток и страданий оскверняются и оскверняются; прекрасное товарищество на поле боя почти оскверняется. Лживые языки не могут говорить о жертвенных делах, чтобы показать их красоту или ценность. Вот почему восхваление героизма со стороны правительства и прессы всегда вызывает раздражение, особенно когда, как это обычно бывает с последними, оно сопровождается дешевой и вульгарной сентиментальностью. Вот почему инстинктивно хочется, чтобы настоящие герои остались неузнанными, чтобы их записи не были запятнаны циничными языками и перьями, столь сведущими во лжи.</p>\n<p> Когда война достигает таких масштабов, что в нее вовлекается вся нация, и когда люди в ее конце обнаруживают, что ничего не выиграли, а только наблюдают широкомасштабные бедствия вокруг себя, они склонны становиться более скептичными и желают исследовать основания аргументов, которые вдохновляли их патриотизм воспламенял их страсти и готовил их к высшей жертве. Им любопытно узнать, почему мнимые цели, за которые они боролись, не были достигнуты, особенно если они победители. Они склонны верить вместе с лордом Фишером, что «нацию обманом втянули в войну» («London Magazine», январь 1920 г.). Они начинают задаваться вопросом, не от них ли зависит подтвердить одно изречение, о котором они так много слышали, что это была «война, чтобы положить конец войне».</p>\n<p> Когда поколение, познавшее войну, еще живо, было бы хорошо, если бы ему были даны главы и стихи о некоторых из самых известных криков, лозунгов и наставлений, которые оказали на них такое сильное влияние. Поэтому в качестве предупреждения сделан этот сборник. Он представляет собой только экспозицию нескольких образцов. Охватить всю землю было бы невозможно. Должно быть, в период с 1914 по 1918 год в мире было больше преднамеренной лжи, чем в любой другой период мировой истории.</p>\n<p> Есть несколько различных видов маскировки, которую может принять ложь. Есть преднамеренная официальная ложь, распространяемая либо для того, чтобы ввести в заблуждение людей дома, либо для того, чтобы ввести в заблуждение врага за границей; из этого дано несколько примеров. Как сказал один француз: «Tant que les peuples seront armés, les uns contre les autres, ils auron des hommes d'etat menteurs, comme ils auron des canons et des mitrailleuses». («Пока народы вооружены друг против друга, будут лживые государственные деятели, так же как будут пушки и пулеметы».</p>\n<p> ) врага и заявив, что строгая точность не важна, пока существует присущая вероятность.</p>\n<p> Есть преднамеренная ложь, придуманная изобретательным умом, которая может достичь лишь узкого круга, но которая, если она достаточно наглядна и образна, может быть подхвачена и распространена; бывают истерические галлюцинации у слабоумных.</p>\n<p> Есть ложь, услышанная и не опровергнутая, хотя и не имеющая доказательств, а затем повторенная или допущенная к распространению.</p>\n<p> Есть неправильный перевод, иногда возникающий из-за действительной ошибки, но чаще преднамеренной. Можно привести два незначительных примера этого.</p>\n<p> «Таймс» (колонка агонии), 9 июля 1915 г.:</p>\n<p> зарежу вас насмерть. — Этель М. Берлинский корреспондент «Кельнской газеты» передал это:</p>\n<blockquote>\n<p>Если Не в хаки к 20-му, hacke ich dich zu Tode (Я зарублю тебя до смерти).</p>\n</blockquote>\n<p> Во время блокады Германии было высказано предположение, что болезни, от которых страдали дети, назывались Die englische Krankheit, как постоянное отражение английской бесчеловечности. На самом деле, die englische Krankheit всегда было распространенным немецким названием рахита.</p>\n<p> Есть общая одержимость, начатая слухами, усиленная повторением и развитая истерией, которая, наконец, получает всеобщее признание.</p>\n<p> Существует преднамеренная подделка, которая должна быть очень тщательно изготовлена, но в данный момент служит своей цели, даже если в конечном итоге она будет разоблачена.</p>\n<p> В официальных документах опущены отрывки, из которых приведены лишь некоторые из многих примеров; и «правильность» слов и запятых в парламентских ответах, за которыми скрываются уклонения от истины.</p>\n<p> Есть преднамеренное преувеличение, такое, например, как сообщения о разрушении Лувена:</p>\n<blockquote>\n<p>«Интеллектуальная столица Нидерландов с пятнадцатого века теперь не более чем куча пепла» (Пресс-бюро, 29 августа  1914 г.) ,</p>\n</blockquote>\n<blockquote>\n<p>«Лувен перестал существовать» («Таймс», 29 августа 1914 г.).</p>\n</blockquote>\n<p> На самом деле, было подсчитано, что пострадала примерно восьмая часть города.</p>\n<p> Есть сокрытие правды, к которому приходится прибегать, чтобы не допустить, чтобы что-либо, что делает честь врагу, дошло до публики. Военный корреспондент, упомянув о каком-то рыцарском поступке, совершенном немцем по отношению к англичанину во время акции, получил укоризненную телеграмму от своего работодателя: «Ни о каких хороших немцах и слышать не желаю»; а сэр Филипп Гиббс в «Реалиях войны» говорит: «В конце дня немцы действовали с рыцарством, о чем мне не было разрешено говорить в то время».</p>\n<p> Есть поддельная фотография («камера не может лгать»). Они были более популярны во Франции, чем здесь. В Вене предприимчивая фирма поставила фотографии зверств с заготовками для заголовков, чтобы обе стороны могли использовать их в пропагандистских целях.</p>\n<p> Кино также играло очень важную роль, особенно в нейтральных странах, и значительно помогло склонить общественное мнение в Америке в пользу перехода на сторону союзников. По сей день в этой стране предпринимаются попытки с помощью пленок заживить рану.</p>\n<p> Есть «русский скандал», лучшим примером которого во время войны, как ни странно, был слух о проходе русских войск через Британию. Некоторые тривиальные и плохо понятые констатации фактов разрастаются до огромных размеров из-за постоянного повторения от одного человека к другому.</p>\n<p> Ложь о зверствах была самой популярной из всех, особенно в этой стране и Америке; без них не может быть войны. Клевета на врага почитается патриотическим долгом. Один английский солдат писал («Таймс», 15 сентября 1914 г.): «Истории в наших газетах — лишь исключения. Такие люди есть в каждой армии». Но как можно раньше следует преднамеренно распространять истории о жестоком обращении с заключенными, чтобы не допустить сдачи. Делается это, разумеется, с обеих сторон. Тогда как, естественно, каждая сторона старается как можно лучше обращаться со своими заключенными, чтобы привлечь других.</p>\n<p> Повторение единичного случая жестокости и его преувеличение могут превратиться в господствующую привычку со стороны врага. Бессознательно каждый передает его с обрезками и тем не менее старается убедить себя, что говорит правду.</p>\n<p> Ложь исходит из присущей человеческим показаниям ненадежности и ошибочности. Никакие два человека не могут рассказать о происшествии на улице так, чтобы две истории совпали. Когда привносятся предвзятость и эмоции, показания людей становятся совершенно бесполезными. В военное время такие показания принимаются как окончательные. Достаточно самого ничтожного и ненадежного свидетельства — «друг брата убитого». Или, как выразился немецкий исследователь собственных лжецов, «кто-то, кто видел это», или «чрезвычайно респектабельная старуха».</p>\n<p> Там чистая романтика. Письма солдат, коротавших дни и недели невыносимого ожидания, писали домой, иногда содержали волнующие описания сражений и приключений, которых никогда не было.</p>\n<p> Есть увертки, умолчания и полуправды, которые более тонко вводят в заблуждение и постепенно входят в правительственную привычку.</p>\n<p> Существует официальная тайна, которая обязательно должна вводить общественное мнение в заблуждение. Например, популярный английский писатель, который был, возможно, лучше информирован, чем большинство публики, написал письмо американскому автору, которое было воспроизведено в прессе 21 мая 1918 года, в котором говорилось: </p>\n<blockquote>\n<p>в том, что касается этой страны. Наш министр иностранных дел неоднократно публично и ясно заявлял об этом, и, помимо чести, для любого британского официального лица было бы политическим самоубийством сделать ложное заявление такого рода».</p>\n</blockquote>\n<p> Тем не менее, существовал ряд секретных договоров. Справедливо будет сказать, что здесь лжет автор, а не министр иностранных дел. Тем не менее официальная брошюра «Правда о тайных договорах», составленная г-ном Маккарди, была опубликована с рядом непризнанных исключений, и как лорд Роберт Сесил в 1917 г., так и г-н Ллойд Джордж в 1918 г. Депутация съезда тред-юнионов), что наша политика не была направлена ​​на развал Австро-Венгрии, хотя они оба знали, что по тайному договору, заключенному с Италией в апреле 1918 г., части Австро-Венгрии должны были быть переданы Италии и она должен был быть отрезан от моря. Секретные договоры, естественно, предполагают постоянное отрицание истины.</p>\n<p> Существует мнимое официальное возмущение, зависящее от подлинного народного возмущения, которое является формой лжи, к которой иногда прибегают в неосторожный момент и впоследствии сожалеют. Первое применение газа немцами и подводная война — хорошие тому примеры.</p>\n<p> Презрение к врагу, если его продемонстрировать, может оказаться неразумной формой лжи. Было время, когда немецкие солдаты обычно изображались съежившимися, с поднятыми руками и кричащими «Камерад», пока представителям прессы и пропаганды не пришло в голову, что люди спрашивали, почему, если мы боролись против таких материалов, если бы мы не стерли их с поля за несколько недель.</p>\n<p> Имеются личные обвинения и ложные обвинения, выдвинутые в предвзятой атмосфере войны, чтобы дискредитировать лиц, которые отказываются принять ортодоксальное отношение к войне.</p>\n<p> Есть лживые взаимные обвинения между одной страной и другой. Например, немцев обвиняли в организации резни армян, и они, со своей стороны, заявляли, что армяне, подстрекаемые русскими, убили 150 000 мусульман (Германия, 9 октября 1915 г.).</p>\n<p> Могут быть найдены и другие разновидности лжи, более тонкие и неуловимые, но приведенные выше довольно хорошо покрывают суть.</p>\n<p> Многое зависит от качества лжи. У вас должна быть интеллектуальная ложь для интеллектуальных людей и грубая ложь для всеобщего потребления, но если ваша народная ложь слишком наглая и ваша более интеллектуальная часть потрясена и видит ее насквозь, они могут (и действительно так и сделали) начать подозревать, их тоже не обманывали. Тем не менее обитатели колледжей столь же доверчивы, как и обитатели трущоб.</p>\n<p> Возможно, ничто не произвело большего впечатления на общественное сознание — и это верно для всех стран, — чем помощь в пропаганде со стороны интеллектуалов и известных литераторов. Они умели облачать грубую ткань лжи в литературные достоинства и красноречие лучше, чем государственные деятели. То выражениями мнимой беспристрастности, то риторическим негодованием они могли своим литературным искусством придать той или иной лжи печать несомненной достоверности, даже без тени доказательства, или же, между прочим, сослаться на нее как на общепризнанный факт. Самый узкий патриотизм мог быть выставлен на вид благородным, самые гнусные обвинения могли быть представлены как возмущенный порыв гуманизма, а самые подлые и самые мстительные цели ложно маскировались под идеализм. Законным было все, что могло заставить солдат продолжать борьбу.</p>\n<p> Неистовая деятельность церковников по вербовке с помощью военной пропаганды произвела столь глубокое впечатление на общественное сознание, что здесь не требуется особых комментариев. Те немногие, кто мужественно выделялся, становились отмеченными людьми. Вытекающая из этого и значительная утрата духовного влияния Церквами сама по себе является достаточным свидетельством реакции против предательства в период стресса самых элементарных заповедей христианства со стороны тех, кому особенно доверено нравственное благополучие людей.</p>\n<p> Война ведется в этом тумане лжи, большая часть которой остается нераскрытой и принимается за правду. Туман возникает от страха и подпитывается паникой. Любая попытка подвергнуть сомнению или опровергнуть даже самую фантастическую историю должна быть немедленно осуждена как непатриотическая, если не предательская. Это дает свободное поле для быстрого распространения лжи. Если бы они использовались только для того, чтобы обмануть врага в войне, то не стоило бы беспокоиться об этом. Но, поскольку цель большинства из них состоит в том, чтобы разжечь возмущение и побудить цвет молодежи страны быть готовым принести высшую жертву, это становится серьезным делом. Поэтому разоблачение может быть полезным даже после окончания борьбы, чтобы выявить обман, лицемерие и вздор, на которых держится всякая война, а также вопиющие и вульгарные приемы, которые так долго использовались для предотвращения невежественные люди от осознания истинного смысла войны.</p>\n<p> Следует признать, что многие люди были сознательными и добровольными обманщиками. Но многие другие были бессознательны и искренни в своем патриотическом рвении. Обнаружив теперь, что с ними практиковались искусно и тщательно инсценированные обманы, они испытывают негодование, которое не только помогло им открыть глаза, но и может побудить их заставить своих детей держать глаза открытыми, когда в следующий раз прозвучит рожок.</p>\n<p> Попробуем провести очень слабую и неадекватную аналогию между поведением наций и поведением отдельных людей.</p>\n<p> Представьте себе два больших загородных дома, в которых живут большие семьи с друзьями и родственниками. Когда члены семьи одного дома остаются в другом, дворецкому дается указание открывать все письма, которые они получают и отправляют, и сообщать хозяину их содержание, подслушивать в замочную скважину и стучать по телефону. Когда между ними разыгрывается большой матч, скажем, матч по крикету, который волнует весь район, присутствующим дают ложные отчеты об игре, чтобы они думали, что сторона, которую они предпочитают, побеждает, другую сторону обвиняют в мошенничестве и грязная игра, и распространяются скандальные слухи о главе семьи, отвратительные события, происходящие в другом доме.</p>\n<p> Все это, конечно, очень мягко, и никаких особенно тяжких последствий не было бы, если бы люди оказались в таком немыслимо хамском, низком и подпольном отношении, кроме того, что они тотчас были бы изгнаны из приличного общества.</p>\n<p> Но между нациями, где последствия имеют решающее значение, где судьба стран и провинций висит на волоске, затрагиваются жизни и состояния миллионов и сама цивилизация находится под угрозой, самые честные люди искренне верят, что нет никакой глубины двуличия в том, чтобы которые они не могут законно согнуть. Они должны это сделать. Дело не может продолжаться без помощи лжи.</p>\n<p> Это не довод о том, что ложь не должна использоваться во время, а демонстрация того, какими должны быть ложь во время войны. Если бы правду сказали с самого начала, не было бы ни причины, ни желания для войны.</p>\n<p> Всякий, заявивший правду: «Прав ты или не прав, выиграешь ты или проиграешь, война ни при каких обстоятельствах не поможет ни тебе, ни твоей стране», очень скоро окажется в тюрьме. В военное время несостоятельность лжи есть небрежность, сомнение во лжи — проступок, провозглашение правды — преступление.</p>\n<p> В будущих войнах мы теперь должны рассчитывать на новый и гораздо более эффективный инструмент пропаганды — государственный контроль над радиовещанием. В то время как в прошлом мы использовали слово «трансляция» символически, подразумевая усилия прессы и отдельных репортеров, в будущем мы должны использовать это слово буквально, поскольку теперь ложь может распространяться повсеместно, научно и авторитетно.</p>\n<p> Многие образцы, приведенные в ассортименте, являются международными, но некоторые исключительно британские, так как их легче найти и исследовать, и, в конце концов, мы больше заботимся о наших собственных методах правительства и прессы и нашей собственной национальной чести, чем о национальной чести. Двуличие других правительств.</p>\n<p> Ложь, рассказанная в других странах, также рассматривается в тех случаях, когда удалось собрать достаточно данных. Без специального расследования на месте невозможно полностью установить путь конкретной лжи.</p>\n<p> Когда жители одной страны поймут, как обманывают людей в другой стране, как и их самих, в военное время, они будут более расположены сочувствовать им как жертвам, чем осуждать их как преступников, потому что они поймут, что их преступление состояло только в послушании. К диктату власти и принятию того, что их правительство и пресса представляли им как истину.</p>\n<p> Охватываемый период составляет примерно четыре года войны. Интенсивность лжи снизилась после 1918 года, хотя свежие посевы появились в связи с другими нашими международными отношениями. Зло, нанесенное ложным лозунгом «Заставь Германию заплатить», продолжалось и после 1918 года и привело, особенно во Франции, к завышенным ожиданиям и последующему возмущению, когда обнаружилось, что люди, выдвигавшие этот лозунг, все время знали, что это фантастическая невозможность. Многие из старых военных лжи сохранялись в течение нескольких лет, а некоторые сохранились и по сей день.</p>\n<p> В разоблачениях, содержащихся на этих страницах, нет ничего сенсационного. Все упомянутые случаи хорошо известны тем, кто был у власти, менее известен тем, кто в первую очередь пострадал, и, к сожалению, неизвестен миллионам павших. Хотя освещена лишь малая часть огромного поля лжи, этого может быть достаточно, чтобы показать, как безжалостно и систематически эксплуатировалась ничего не подозревающая невинность масс во всех странах.</p>\n<p> Есть те, кто возражает против войны из-за ее аморальности, есть те, кто избегает арбитража оружия из-за его возросшей жестокости и варварства; растет число тех, кто протестует против этого метода, с самого начала известного как безуспешный, попытки урегулировать международные споры из-за его глупости и бесполезности. Но нет ни одной живой души ни в одной стране, которая не была бы глубоко возмущена тем, что его страсти разжигаются, его негодование воспламеняется, его патриотизм эксплуатируется, а его высшие идеалы оскверняются сокрытием, увертками, мошенничеством, ложью, хитростью и преднамеренной ложью со стороны тех, кому его учат доверять и кому велено проявлять уважение.</p>\n<p> Никто из героев, готовых к страданиям и жертвам, никто из простого стада, готового к служению и повиновению, не будет склонен слушать зов своей страны, как только они обнаружат оскверненные источники, откуда исходит этот зов, и узнают чудовищный перст лжи. Который манит их на поле боя.</p>\n<p> Глава I. Приверженность Франции</p>\n<p> Наше быстрое вступление в европейскую войну в 1914 году было обусловлено нашей приверженностью Франции. Это обязательство не было известно людям; это не было известно парламенту; это было известно даже не всем членам кабинета. Более того, его существование отрицалось. Вскоре стало ясно, насколько обязательным было моральное обязательство. Тот факт, что это не был подписанный договор, не имеет ничего общего с обязательным характером договоренности, достигнутой в результате многолетних военных и военно-морских переговоров. Мало того, что это упоминалось как «обязательство чести» (лорд Лэнсдаун), «соглашение» (мистер Ллойд Джордж), «почетное ожидание» (сэр Эйр Кроу), «самые тесные переговоры и договоренности между двумя правительствами». (Мистер Остин Чемберлен), но сам лорд Грей признал, что, если бы мы не встали на сторону Франции (не говоря уже о нарушении бельгийского нейтралитета), он бы подал в отставку. То, что он сделал вид, что мы не были «связаны», вызвало удивление у его самых горячих поклонников, что договоренность должна была храниться в секрете, было предметом резкой критики со стороны государственных деятелей всех партий. Во всей довоенной дипломатии не выделяется более существенный момент, и простое перечисление отрицаний, уклонений и уловок представляет собой трагическую иллюстрацию низкого стандарта национальной чести, когда речь идет о войне, что признается государственными деятелями, чьи личная честь безупречна.</p>\n<p> Следует помнить, что разговоры, которые включали в себя тесные консультации между военными и военно-морскими штабами, начались до 1906 года. Первое явное опровержение было сделано в 1911 году. Последующие выдержки могут быть даны без дополнительных комментариев.</p>\n<blockquote>\n<p>«Г-н Джоуэтт спросил государственного секретаря по иностранным делам, были ли во время его пребывания в должности какие-либо обязательства, обещания или договоренности с Францией о том, что в определенных случаях британские войска будут отправлены для помощи операциям французских войск. Армия».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Маккиннон Вуд (заместитель министра иностранных дел): «Ответ отрицательный». (Палата общин, 9 марта 1911 г.)</p>\n</blockquote>\n<blockquote>\n<p>Сэр Э. Грей «Прежде всего позвольте мне попытаться положить конец некоторым подозрениям в отношении секретности — подозрениям, которыми, как мне кажется, некоторые люди мучают себя, и, конечно, беспокоит других. Мы представили Палате секретные статьи соглашения с Францией 1904 года. Других секретных обязательств нет. Покойное правительство заключило это соглашение в 1904 году. Будет очевидно, почему они это сделали. Было бы возмутительно предать гласности эти статьи. По моему мнению, они имели полное право держать эти статьи в секрете, потому что они не были статьями, которые обязывают эту палату серьезными обязательствами. Я видел комментарий, сделанный на днях, когда были опубликованы эти статьи, что если бы правительство держало в секрете малое, a fortiori, то оно держало бы в секрете и большое. Это абсолютно неверно. Нты такого рода, если они не являются вещами первостепенной важности, если они второстепенны по отношению к вещам большой важности. Но именно по этой причине британскому правительству не следует брать на себя тайные обязательства, обязывающие парламент выполнять военные обязательства. Было бы глупо это делать. Ни одно британское правительство не может начать войну без поддержки общественного мнения, и те обязательства, которые действительно обязывают парламент к чему-либо подобному, содержатся в договорах или соглашениях, представленных на рассмотрение палаты. Для себя мы не составили ни одной секретной статьи с тех пор, как вступили в должность». (Палата общин, 27 ноября 1911 г.).</p>\n</blockquote>\n<p> от сути.</p>\n<p> уклонение всем в Великобритании в августе 1914 г., чем то, что наше соглашение с Францией было «тайным обязательством, которое обязывало парламент выполнять военные обязательства»</p>\n<p> . , писал: «Всякий, кто знает факты, должен чувствовать, что мы имеем обязательства союза без его преимуществ и, главное, без его точных определений» («Мировой кризис», т. I, стр. 115).</p>\n<p> В 1912 г. М. Сазонов, русский министр иностранных дел, докладывал царю:</p>\n<blockquote>\n<p>«Англия обещала поддержать Францию ​​на суше, послав к бельгийской границе экспедицию в 100 000 человек для отражения ожидаемого французским генеральным штабом вторжения германской армии во Францию ​​через Бельгию....</p>\n</blockquote>\n<blockquote>\n<p>Есть очень общее мнение, что эта страна связана обязательством, не договорным обязательством, а обязательством, вытекающим из гарантии, данной министерством. В ходе дипломатических переговоров направить очень большие силы из этой страны для действий в Европе.</p>\n</blockquote>\n<blockquote>\n<p>Мистер Асквит: «Я должен сказать, что это неправда». (Палата общин, 10 марта 1903 г.)</p>\n</blockquote>\n<blockquote>\n<p>Сэр Уильям Байлз спросил премьер-министра, «скажет ли он, находится ли эта страна под каким-либо, и если да, то под каким, обязательством перед Францией направить вооруженные силы в определенных обстоятельствах для действий в Европе». ; и если да, то каковы пределы наших соглашений, будь то гарантия или договор с французским народом».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Кинг спросил премьер-министра: «(i) не сдерживается ли в настоящее время внешняя политика этой страны какими-либо договорами, соглашениями или обязательствами, в соответствии с которыми британские вооруженные силы в определенных случаях должны быть высажены на на континенте и участвовать там в военных операциях; и (2) предлагала ли эта страна в 1905, 1908 или 1911 году спонтанно Франции помощь британской армии, которая должна была высадиться на континенте для поддержки Франции в случае европейских военных действий».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Асквит: Как уже неоднократно заявлялось, эта страна не несет никаких обязательств, кроме публичных и известных парламенту, которые вынуждают ее принимать участие в какой-либо войне. Другими словами, если между европейскими державами возникнет война, не будет неопубликованных соглашений, которые ограничили бы или затруднили бы свободу правительства или парламента решать, должна ли Великобритания участвовать в войне. Использование военно-морских и вооруженных сил, если правительство или парламент решат принять участие в войне, по очевидным причинам не является вопросом, о котором можно делать публичные заявления заранее. (Палата общин, 24 марта 1913 г.).</p>\n</blockquote>\n<blockquote>\n<p>Сэр Эдвард Грей: «Я заверял палату, а премьер-министр не раз уверял палату, что, если возникнет какой-либо кризис, подобный этому, мы должны предстать перед палатой общин и иметь возможность сказать палате, что это было свободен решать, какой должна быть позиция Палаты; что у нас нет тайного обязательства, которое мы должны навязать Палате и сказать Палате, что, поскольку мы вступили в это обязательство, перед страной лежит обязательство чести ... Я думаю, [письмо] совершенно ясно дает понять, что то, что премьер-министр и я сказали в палате общин, было совершенно оправдано в отношении нашей свободы решать в кризисной ситуации, какой должна быть наша линия, должны ли мы вмешиваться или должны ли мы воздерживаться ... Правительство оставалось совершенно свободным, и a fortiori Палата общин оставалась совершенно свободной». (Палата общин, 3 августа 1914 г.).</p>\n</blockquote>\n<p> Тем не менее все приготовления были сделаны до последней детали, о чем свидетельствует незамедлительная, секретная и хорошо организованная отправка экспедиционного корпуса.</p>\n<p> Еще 31 января 1906 года сэр Эдвард Грей написал нашему послу в Париже, описав разговор с М. Камбоном.</p>\n<blockquote>\n<p>«Во-первых, с тех пор, как посол говорил со мной, был достигнут значительный прогресс. Наши военные и военно-морские власти поддерживали связь с французами, и я полагал, что все приготовления были готовы, так что, если возник кризис, нельзя было терять время из-за отсутствия формальной помолвки».</p>\n</blockquote>\n<p> Лорд Грей пишет в своей книге «Двадцать пять лет» (опубликованной в 1925 г.) по поводу своего заявления в августе 1914 г.:</p>\n<blockquote>\n<p>«Если читатель вспомнит беседы с Камбоном в 1906 г., окажется, что не только англичане и французы военные, но также и военно-морские власти вели консультации. Но военно-морские консультации были поставлены на удовлетворительную для Франции основу в 1905 г., до прихода к власти либерального правительства. Новым шагом, предпринятым нами в январе 1906 г., было разрешение военных переговоров. На том же основании, что и военно-морские. Было сочтено важным дать понять Палате, что ее свобода решений не ограничивается никакими обязательствами, заключенными ранее без ее ведома. Чувствовать, кто приветствовал, одобрял и поддерживал англо-французскую дружбу, которая была открыта и всем известна. За несколько часов до этого, и письма, которыми обменялись с Камбоном в 1912 году, письмо, в котором прямо указывалось, что помолвки не было. Одной из вещей, которая существенно способствовала единодушию в стране (в связи с началом войны), было то, что кабинет смог предстать перед парламентом и сказать, что они не заключали тайного соглашения за их спинами. Виконт Грей, получающий свободу Глазго 4 января 1921 года. Об этом сообщается в «Таймс».</p>\n</blockquote>\n<p> Его постоянное повторение этой уверенности является лучшим доказательством его естественного и очевидного сомнения в том, что это правда.</p>\n<p> Но спустя годы он продолжает попытку самооправдания в своей книге «Двадцать пять лет». Изложение соображений, которые он имел в виду до начала войны:</p>\n<blockquote>\n<p>(3) что, если война начнется, интересы Британии требуют, чтобы мы не оставались в стороне, пока Франция сражалась одна на западе, а должны были поддержать ее. Я знал, что очень сомнительно, что кабинет, парламент и страна воспримут эту точку зрения в связи с началом войны, и в течение всей этой недели я имел в виду вероятное непредвиденное обстоятельство, что мы не примем решение в критический момент поддерживать Францию. В этом случае я должен был бы уйти в отставку ...</p>\n</blockquote>\n<blockquote>\n<p>(4) Четкое мнение, что нельзя давать никаких обещаний, даже не возлагать надежды на Францию ​​​​и Россию, которые сомнительно, что эта страна выполнит. Я видел одну опасность ... Она заключалась в том, что Франция и Россия могут столкнуться с испытанием войны с Германией, полагаясь на нашу поддержку; что этой поддержки может и не быть, и что тогда, когда будет уже слишком поздно, они могут возложить на нас ответственность за то, что впустили их в гибельную войну. Конечно, я мог бы уйти в отставку, если бы дал им надежду, которую, как оказалось, кабинет министров и парламент не одобрили. Но какая польза от моей покорности для них в их испытаниях?</p>\n</blockquote>\n<p> Процитировав вопросы Кинг-Байлса от 11 июня 1914 года, он говорит:</p>\n<blockquote>\n<p>«Ответ абсолютно верен. Критика, которой он подвергается, заключается в том, что он не отвечает на заданный мне вопрос. Право знать о соглашениях или договоренностях, которые обязывают страну действовать или ограничивают ее свободу. Но нельзя говорить о военных и военно-морских мерах на случай возможных непредвиденных обстоятельств. Пока правительства вынуждены рассматривать возможность войны, они находятся под необходимость принять меры предосторожности, цель которых была бы подорвана, если бы они были обнародованы ... Если бы вопрос был насущным, я, должно быть, отказался отвечать на него и привел эти причины для этого. Вопросы в предыдущем году о военные договоренности с Францией были отложены премьер-министром с аналогичным ответом:</p>\n</blockquote>\n<blockquote>\n<p>«Ни франко-британские военные, ни англо-русские морские переговоры не скомпрометировали свободу этой были менее интимными и важными, чем первые. Поэтому я имел полное право сказать, что заверения, данные премьер-министром, остаются в силе. Не было сделано ничего, что могло бы их ослабить, и это была гарантия, на которую парламент имел право. Политические обязательства не должны храниться в секрете; военно-морские или военные приготовления к непредвиденным обстоятельствам войны необходимы, но должны храниться в секрете. В этих случаях были приняты меры к тому, чтобы такие приготовления не подразумевали никакого политического участия».</p>\n</blockquote>\n<p> от 31 июля 1914</p>\n<blockquote>\n<p>Грею Никакие письменные обязательства, связывающие нас с Францией, не являются строго правильными. Договорных обязательств нет. Но Антанта была создана, укреплена, подвергнута испытанию и прославлена ​​таким образом, что оправдывает веру в то, что моральная связь выковывается. Вся Антанта не может иметь никакого значения, если она не означает, что в справедливой ссоре Англия поддержит своих друзей. Это благородное ожидание оправдалось. Мы не можем отказаться от него, не подвергая наше доброе имя серьезной критике.</p>\n</blockquote>\n<blockquote>\n<p>«Я осмеливаюсь думать, что утверждение о том, что Англия ни при каких обстоятельствах не может начать войну, неверно и что всякое его одобрение было бы политическим самоубийством».</p>\n</blockquote>\n<p> Это простое официальное мнение, основанное на здравом смысле, которого придерживался сэр Э. Грей до него. Настаивать на том, что парламент свободен, потому что «почетное ожидание» не было зафиксировано в письменной форме, было прискорбной уловкой.</p>\n<p> Лорд Лэнсдаун в Палате лордов 6 августа 1914 г., упомянув об «обязательствах по договору и тех других обязательствах, которые не менее священны, поскольку они не воплощены в подписанных и запечатанных документах», сказал:</p>\n<blockquote>\n<p>«Под одну категорию попадают наши Договорные обязательства перед Бельгией... К другой категории относятся наши обязательства перед Францией - обязательства чести, выросшие в результате тесной близости, объединившей две нации в течение последних нескольких лет».</p>\n</blockquote>\n<p> Идея о том, что парламент был свободен и с ним проводились консультации 3 августа, также несостоятельна как притворство, поскольку 2 августа правительство гарантировало морскую защиту французского побережья и судоходства. Парламент в любом случае не был свободен из-за обязательств, но это превращало «консультацию» и парламентскую санкцию в абсолютный фарс.</p>\n<p> Как сообщила «Таймс» от 5 августа, этой гарантией Великобритания</p>\n<blockquote>\n<p>«определенно перешла на сторону Франции»; и М. Камбон, французский посол, в беседе с М. Рекули сказал: «Великая страна не может вести войну на полпути. В тот момент, когда она решила воевать на море, она фатально обязала себя воевать и на суше». .\"</p>\n</blockquote>\n<p> Можно дать мнение прессы об этом обязательстве:</p>\n<blockquote>\n<p>«Возьмем еще один пример, который свеж в памяти каждого, а именно договоренности о сотрудничестве военных штабов Великобритании и Франции перед войной. Накануне военных действий Палата общин что-либо узнала о характере этих договоренностей. Затем сэр Эдвард Грей объяснил, что Великобритания не намерена оказывать военную помощь Франции. Договора не было. Таким образом, Великобритания была вольна оказать помощь или отказать в ней, и тем не менее, хотя формальных обязательств не было, мы были связаны всеми соображениями чести, и национальная совесть инстинктивно чувствовала это, хотя это и было Только вторжение в Бельгию принесло с собой колеблющихся и сомневающихся. Это положение возникло в результате тайной дипломатии, и нельзя допустить, чтобы оно возникло снова по той же причине. Это более опасно, чем для правительства взять на себя обязательство честью, хотя и не технически, а затем не провести адекватных военных приготовлений на том основании, что техническое обязательство не было принято». («Daily Telegraph», сентябрь 1917 г.)</p>\n</blockquote>\n<p> Лорд Холдейн откровенно признается в «Перед войной», чем он занимался в 1906 г. Место сбора должно быть напротив бельгийской границы, британский экспедиционный корпус численностью 160 000 человек».</p>\n<blockquote>\n<p>Г-н Ллойд Джордж (говоря о начале войны): У нас был договор с Францией, что, если она подвергнется необоснованному нападению, Соединенное Королевство пойдет ей на помощь.</p>\n</blockquote>\n<blockquote>\n<p>Мистер Хогг: Мы этого не знали!</p>\n</blockquote>\n<blockquote>\n<p>Мистер Ллойд Джордж. Если бы Франция подверглась необоснованному нападению.</p>\n</blockquote>\n<blockquote>\n<p>достопочтенный Участник: Это новость.</p>\n</blockquote>\n<blockquote>\n<p>Г-н Ллойд Джордж: Не было договоренности о том, какую силу мы должны вывести на арену... К каким бы договоренностям мы ни пришли, я думаю, история покажет, что мы более чем сохранили веру.</p>\n</blockquote>\n<blockquote>\n<p>(Палата общин, 7 августа 1913 г.)</p>\n</blockquote>\n<p> Таким образом, несмотря на заверения лорда Грея в свободе парламента, становится ясно, что если бы парламент пошел другим путем, Великобритания нарушила бы доверие Франции.</p>\n<p> Можно привести некоторые иностранные мнения:</p>\n<blockquote>\n<p>во Французской палате 3 сентября 1919 г. Г-н Франклин Буйон, критикуя Тройственный союз, предложенный в 1919 г. Между французским, британским и американским правительствами, заявил, что Франция лучше защищена англо-французским союзом. Соглашение 1912 г., «которое гарантировало нам поддержку шести дивизий», и — после прерывания г-ном Тардье — согласился, что «текст» соглашения не указывает шесть дивизий, но что сотрудничество штаба «заранее устроило все для мобилизации и немедленной посадки шести дивизий».</p>\n</blockquote>\n<p> В апреле 1913 г. М. Сазонов докладывал царю:</p>\n<blockquote>\n<p>«Грей, не колеблясь, заявил, что в случае возникновения обсуждаемых условий Англия сделает все, чтобы нанести самый серьезный удар германской мощи... Исходя из этого, Грей, по собственной инициативе подтвердил то, что я уже знал от Пуанкаре, существование соглашения между Францией и Великобританией, по которому Англия обязывалась в случае войны с Германией не только прийти на помощь Франции на моря, но и на континенте путем высадки десанта».</p>\n</blockquote>\n<blockquote>\n<p>«Вмешательство Англии в войну было ожидаемо. С Англией существовала военная конвенция, которую нельзя было разглашать, так как она носила секретный характер. Мы полагались на шесть английских дивизий и на помощь бельгийцев». (Маршал Жоффр перед парижской комиссией, 5 июля 1919 г.).</p>\n</blockquote>\n<p> Сравнение последовательных планов кампании французского генерального штаба позволяет нам определить точный момент, когда Английское сотрудничество, вследствие этих обещаний, стало частью нашей военной стратегии. План 16 этого не допускал; План 16а, составленный в сентябре 1911 г., учитывает присутствие английской армии на нашем левом фланге. Военный министр (Мессими) сказал:</p>\n<blockquote>\n<p>«Наши беседы с генералом Вильсоном, представлявшим британский генеральный штаб во время агадирского дела, позволили нам убедиться в английской интервенции в случае конфликта». Генеральный штаб обещал помощь 100 000 человек, но с условием, что они должны высадиться во Франции, потому что, как он утверждал, высадка в Антверпене займет гораздо больше времени». (Из \"La Victoire\" Фабра Люса).</p>\n</blockquote>\n<blockquote>\n<p>«Британский и французский генеральные штабы в течение многих лет вели тесные консультации друг с другом по этому вопросу. Район сосредоточения британских войск был определен на левом фланге французов, и все фактические пункты выгрузки различных частей были заложен на местности, лежащей между Мобежом и Ле-Като. Штаб армии был закреплен в последнем месте». (Книга лорда Френча о войне, 1919 г.)</p>\n</blockquote>\n<p> Что касается опасности секретности, которая была причиной опровержений и уклонений, можно привести три цитаты.</p>\n<blockquote>\n<p>Г-н Бонар Лоу: ...Говорили - и я думаю, что это, скорее всего, правда, - что если бы Германия знала наверняка, что Великобритания примет участие в войне, война никогда бы не произошла. (Палата общин, 18 июля 1918 г.).</p>\n</blockquote>\n<blockquote>\n<p>Лорд Лорберн в «Как пришла война» говорит: «Сокрытие от Кабинета министров было длительным и, должно быть, было преднамеренным».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Остин Чемберлен: ... «В какой-то понедельник мы слушали речь лорда Грея в этой ложе, которая поставила нас лицом к лицу с войной и после которой последовало наше заявление. Это было первое публичное уведомление страны. , или кому-либо из правительства того времени, о позиции британского правительства и взятых на себя обязательствах ... Была ли Палата общин свободна в принятии решений? Опираясь на договоренности, заключенные между двумя правительствами, французское побережье было незащищенным -- я говорю не о Бельгии, а о Франции. Между двумя нашими правительствами и двумя нашими штабами были самые тесные переговоры и договоренности. На бумаге не было ни слова, связывающего эту страну, но честью она была связана так как он никогда не был связан прежде --- я не говорю неправильно, я думаю правильно \".</p>\n</blockquote>\n<blockquote>\n<p>Г-н Т.П. О'Коннор: \"Это не должно было быть секретом\".</p>\n</blockquote>\n<blockquote>\n<p>Г-н Чемберлен: «Я согласен. В этом вся моя точка зрения, и я подхожу к ней. Можем ли мы когда-либо быть равнодушными к французской границе или к судьбе Франции? договор или отсутствие договора... Предположим, что помолвка была заключена публично при свете дня, если бы она была вынесена на рассмотрение этой палаты и одобрена этой палатой, разве события тех августовских дней не могли быть иными?.. «Если бы у нас это было, если бы наши обязательства были известны и определены, то, по крайней мере, возможно, и я думаю, вероятно, что войны в 1914 году удалось бы избежать». (Палата общин, 8 февраля 1922 г.).</p>\n</blockquote>\n<p> Поэтому не может быть никаких сомнений в том, что преднамеренные опровержения и уловки, сохранявшиеся до последнего момента и чреватые последствиями такого масштаба, составляют страницу в истории тайной дипломатии, не имеющую себе равных, и служат яркой иллюстрацией. Скользкой дорожке официальных утаек.</p>\n<p> Глава II Сербия и убийство эрцгерцога</p>\n<p> Убийство в Сараево эрцгерцога Франца Фердинанда, племянника императора Франца Иосифа, и последующий австрийский ультиматум иногда называют причиной войны, тогда как, конечно, они были только поводом - спичка, которая подожгла хорошо хранимый пороховой магазин. Инцидент ни в коем случае не годился для пропагандистских целей. К счастью для правительства, убийство в Сараево вместе с тайным обязательством перед Францией отошли на второй план после вторжения в Бельгию. Сделать сербское дело популярным было чрезвычайно сложно. «Джон Булл» сразу же взорвался песней «К черту Сербию», и большинство людей, естественно, не хотели, чтобы их втягивали в европейскую войну по такому поводу. Некоторые задавались вопросом, каково было бы отношение нашего собственного правительства, если бы принц Уэльский был убит при подобных обстоятельствах, и существовало сомнительное настроение. Следовательно, дело сербов пришлось зафиксировать, а «бедную маленькую Сербию» пришлось представить как невинную маленькую национальность, подвергшуюся оскорбительной жестокости австрийцев.</p>\n<p> Следующая выдержка из «Таймс» от 15 сентября 1914 года является хорошим образцом того, как возбуждалось общественное мнение:</p>\n<blockquote>\n<p>«Письмо, которое мы публикуем сегодня утром, от сэра Валентайна Чирола, является долгожданным напоминанием о нашем долге перед доблестной армией. И люди ... Мы слишком склонны не замечать великолепный героизм сербского народа и жертвы, которые они понесли ... И Сербия полностью заслужила поддержку ... Мы также не должны забывать, что эта европейская освободительная война была вызванные австро-германской агрессией против Сербии. Обвинения в соучастии в сараевском преступлении, выдвинутые против Сербии в качестве предлога для агрессии, не доказаны. Более чем сомнительно, что они поддаются доказыванию ... Хотя, таким образом, есть все основания за неприятие австрийских обвинений есть самые веские причины оказать эффективную помощь доблестному союзнику, который целый век боролся за принцип независимости малых государств, с которым мы сами сейчас боремся чтобы отомстить всеми ресурсами нашей Империи.</p>\n</blockquote>\n<p> Г-н Ллойд Джордж, выступая в Королевском зале 21 сентября 1914 года, сказал: «Если какие-либо сербы были замешаны в убийстве эрцгерцога, они должны быть наказаны за это. Сервия признает это. Делать с этим, даже Австрия не заявляла об этом. Премьер-министр Сербии - один из самых способных и уважаемых людей в Европе. Сербия была готова наказать любого из своих подданных, чье участие в этом убийстве было доказано. Что еще могло быть? Вы ожидаете?</p>\n<p> \"<em>Punch</em>\" дал нам \"Героическую Сербию\", храброго серба, защищающегося на горном перевале.</p>\n<p> В период с 28 июня по 23 июля 1914 года сербское правительство не производило никаких арестов или объяснений. Австрийский представитель фон Шторк , было сказано:</p>\n<blockquote>\n<p>«Полиция не занимается этим делом. Создавалось впечатление, что преступниками были совершенно безответственные лица, неизвестные никому из начальства. По мере того как война продолжалась, этот вопрос был упущен из виду, и наш сербский союзник и его правительство повсеместно воспринимались как одна из малочисленных возмущенных национальностей, за освобождение и права которых британские солдаты были готовы пожертвовать своей жизнью»</p>\n</blockquote>\n<p> Разоблачения причастности сербского правительства к преступлению не появлялись до 1924 г., когда была опубликована статья под названием «После Видовдана, 1914 г.» Любы Йованович, председателя сербского парламента, бывшего министром образования в Кабинет М. Пашича в 1914 г. Можно привести соответствующие выдержки из этой статьи.</p>\n<blockquote>\n<p>«Я не помню, был ли это конец мая или начало июня, когда г-н Пашич сказал нам однажды, что некоторые лица готовятся отправиться в Сараево, чтобы убить Франца Фердинанда, которого там ожидали. Видовдан.(Воскресенье, 28 июня).Об этом он рассказал нам другим,но действовал дальше в деле только со Стояном Протычем,тогдашним министром внутренних дел.Как мне сказали потом,это было подготовлено обществом тайно организованных мужчинами и обществами патриотически настроенных студентов Боснии и Герцеговины в Белграде М. Пашич и мы, другие, сказали (и Стоян Протич согласился), что он, Стоян, должен приказать властям на Дринской границе не допустить перехода молодежи которые покинули Белград для этой цели.Но эти пограничные власти сами были членами организации, и не выполнили приказ Стояана, и сказали ему, а он потом сказал нам, что приказ пришел слишком поздно, так как юноши уже пересекли Таким образом, правительство попытка предотвратить безобразие (atentat), которое было подготовлено.</p>\n</blockquote>\n<blockquote>\n<p>«Из этого становится ясно, что весь кабинет знал о заговоре за некоторое время до того, как произошло убийство; что премьер-министр и министр внутренних дел знали, в каких обществах оно готовилось; что пограничная служба была глубоко замешана и работала под Не удалась и предпринятая по собственной инициативе министром Билинским попытка нашего венского министра свернуть эрцгерцога с намеченного рокового пути. Таким образом, смерть эрцгерцога совершилось при обстоятельствах более ужасных, чем можно было предвидеть, и с последствиями, о которых никто не мог даже мечтать».</p>\n</blockquote>\n<p> В Вену не было отправлено никаких официальных инструкций, чтобы предупредить эрцгерцога. Министр действовал по собственной инициативе. Это дополнительно подтверждается заявлением М. Пашича, процитированным в «Штандарте» от 21 июля 1914 г.</p>\n<blockquote>\n<p>«Если бы мы знали о заговоре против покойного эрцгерцога Франца Фердинанда, мы, конечно, должны были бы сообщить об этом австро-венгерскому правительству».</p>\n</blockquote>\n<p> Он знал о заговоре, но не предупредил австро-венгерское правительство.</p>\n<p> В статье в «Neues Wiener Tageblatt» от 28 июня 1924 года Йован Йованович, сербский посланник в Вене, объяснил, что предупреждение, которое он дал, было в форме личного и неподсказанного мнения о том, что маневры были провокационными и эрцгерцог может быть расстрелян. Одним из своих солдат.</p>\n<p> Люба Яванович описывает, как он воспринял это известие:</p>\n<blockquote>\n<p>«В Видойдане (воскресенье, 2.8 июня 1914 г.) днем ​​я был на даче в Сеняке. .. И хотя я знал, что там готовится, но, пока я держал трубку, как будто кто-то неожиданно нанес мне тяжелый удар. Видел, что положение нашего правительства по отношению к другим правительствам будет очень тяжелым, гораздо хуже, чем после 29 мая 1903 года» (убийства короля Александра).</p>\n</blockquote>\n<p> В «Балканской федерации» Никола Ненадович утверждает, что к заговору были причастны король Александр, русский министр Хартвиг ​​и русский военный атташе Артманов, а также Пашич.</p>\n<p> Австрийское правительство в своем ультиматуме потребовало ареста некоего Цигановича. Он был найден, но таинственным образом исчез. Этот человек сыграл важную роль. Полковник Симич в «Кларти» за май 1925 года описывает его как связующее звено между Пашичем и заговорщиками и говорит: «М. Пашич послал своего агента в Албанию». Отчет о суде в Салониках показывает, что он был шпионом и агентом-провокатором сербского правительства. Он был «номером 412» в списке «Черной руки», революционного общества, известного и поощряемого правительством (племянник М. Пашича был членом). Ее главой был Димитриевич, начальник штаба разведки, выдающаяся фигура, руководившая убийством короля Александра и его королевы в 1903 году. Заранее. Первую попытку с бомбой предпринял Чабринович, находившийся в Сербской государственной типографии. Принцип, дикий молодой человек, который был просто инструментом, на самом деле совершил убийство. Когда его и других убийц арестовали, они сознались, что именно через Цыгановича их познакомили с майором Танкосичем, снабдили оружием и дали уроки стрельбы. После Салоникского процесса правительство Пашича отправило Цыгановича в награду за его услуги в Америку с фальшивым паспортом на имя Даниловича. После окончания войны Цыганович вернулся, и правительство дало ему землю близ Ускуба, где он тогда и проживал.</p>\n<p> То, что австрийское правительство должно было признать, что отказ либо найти Цигановича, либо разрешить другим искать его означает вину со стороны сербского правительства, и поэтому прибегло к войне, неудивительно.</p>\n<p> В Белграде была найдена открытка «до востребования», написанная из Сераево одним из преступников одному из его товарищей в Белграде. Но за этим не последовало. Как говорит Люба:</p>\n<blockquote>\n<p>«В целом можно было ожидать, что Вене не удастся доказать какую-либо связь между официальной Сербией и событием на Милячке».</p>\n</blockquote>\n<p> Замечание сербского студента резюмирует дело: «Видишь ли, план удался. Мы сделали Великую Сербию». А сам М. Пашич 13 августа 1915 г. Заявил:</p>\n<blockquote>\n<p>«Никогда в истории не было лучшего прогноза для сербского народа, чем тот, который возник после начала войны».</p>\n</blockquote>\n<p> Для сербского правительства стало неожиданностью, что разоблачение Любы должно было вызвать волнение. Они думали, что Великобритания поняла, что произошло, и в своем рвении к войне Германия ухватилась за предлог. Когда, однако, правда вышла наружу, было возбуждено дело об исключении Любы из Радикальной партии. Однако ничто из происшедшего по этому поводу не вызвало у господина Пашича категорического отрицания обвинения, выдвинутого Любой. Насколько это было возможно, он уклонялся от этого вопроса.</p>\n<p> По-видимому, нет никаких сомнений в том, что перед окончанием войны британское военное министерство было официально проинформировано о том, что Димитриевич из штаба сербской разведки был главным виновником убийства. Он был казнен в Салониках в 1917 году, поскольку его существование было признано неудобным. Но когда дело дошло до заключения мирных договоров в Версале, по этому поводу возник заговор молчания.</p>\n<p> Этот ужасный пример обмана следует классифицировать как сербскую ложь, но его принятие было настолько широко распространено, что пол-Европы стало виновным в соучастии в нем, и даже если правда дошла до других канцелярий и министерств иностранных дел союзных держав во время войны, она было бы совершенно невозможно для них раскрыть это. Однако, если бы правда была известна в июле 1914 года, мнение английского народа по поводу австрийского ультиматума было бы совсем другим, чем оно было.</p>\n<p> Глава III. Вторжение в Бельгию как причина Великой войны</p>\n<p> Какими бы ни были причины Великой войны, немецкое вторжение в Бельгию определенно не было одной из них. Это было одним из первых последствий войны. Это даже не было причиной нашего вступления в войну. Но правительство, понимая, насколько сомнительно, чтобы оно могло вызвать общественный энтузиазм по поводу тайного обязательства перед Францией, было способно, благодаря роковой ошибке Германии, представить вторжение в Бельгию и нарушение договора о нейтралитете как причину наше участие в нем.</p>\n<p> Теперь мы знаем, что мы были связаны с Францией обязательством чести, мы знаем теперь, что сэр Эдвард Грей ушел бы в отставку, если бы мы не встали на сторону Франции, и мы также знаем, что г-н Бонар Ло обязал Консервативную партию поддержка войны до того, как встал вопрос о вторжении в Бельгию.</p>\n<blockquote>\n<p>«Правительство уже знает, но теперь я заверяю их от имени партии, лидером которой я являюсь в этой палате, что любые шаги, которые они сочтут необходимыми для чести и безопасности этой страны, они могут положиться на безоговорочная поддержка оппозиции». (Цитируется по \"<em>Twenty-Five Years</em>\" виконта Грея).</p>\n</blockquote>\n<p> Вторжение в Бельгию явилось для правительства и прессы подарком небесным, и они поспешили воспользоваться этим предлогом, полностью оценив его ценность с точки зрения сплочения общественного мнения.</p>\n<blockquote>\n<p>«Мы идем на войну, которая навязана нам как защитникам слабых и поборникам свобод Европы». («Таймс», 5 августа 1914 г.).</p>\n</blockquote>\n<blockquote>\n<p>«Следует ясно понять, когда это было и почему мы вмешались. И только тогда, когда мы оказались перед выбором между выполнением и нарушением торжественных обязательств, между исполнением обязательного долга и бесстыдным подчинением неприкрытой силе, мы выбросил ножны... Мы были связаны нашими обязательствами, простыми и первостепенными, отстаивать и поддерживать независимость маленького и нейтрального государства, находящегося под угрозой» [Бельгия]. (Мистер Асквит, Палата общин, 27 августа 1914 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Договорные обязательства Великобритании перед этой маленькой землей (Бельгией) привели нас к войне». (Мистер Ллойд Джордж, 5 января 1918 г.)</p>\n</blockquote>\n<p> Ни одно из этих заявлений сменявших друг друга премьер-министров не соответствует действительности. Нас втянули в войну из-за нашей приверженности Франции. Нападение на Бельгию было использовано для возбуждения национального энтузиазма. Фраза с таким же эффектом была вставлена ​​​​в речь короля от 18 сентября 1914 г.</p>\n<blockquote>\n<p>«Я был вынужден, отстаивая договорные обязательства, намеренно сведенные на нет ... Начать войну».</p>\n</blockquote>\n<p> Два следующих отрывка излагают вопрос правильно:</p>\n<blockquote>\n<p>«Они не отражают того, что наша честь и наши интересы должны были вынудить нас присоединиться к Франции и России, даже если бы Германия скрупулезно уважала права своих маленьких соседей и стремилась прорубить себе путь в Франция через восточные крепости». (\"Таймс\" 15 марта 1915 г.).</p>\n</blockquote>\n<blockquote>\n<p>Сэр Д. Маклин: «Мы вступили в войну из-за Бельгии».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Чемберлен: «У нас был такой договор с Бельгией. Если бы это была только Франция, мы не могли бы остаться в стороне после состоявшихся разговоров. Оставаться в стороне было бы не в наших интересах, и мы не могли бы остался без потери безопасности и чести». (Палата общин, 8 февраля 1922 г.)</p>\n</blockquote>\n<p> Но помимо того, что нападение на Бельгию было объявлено причиной войны, оно также было представлено как беспрецедентное и неоправданное нарушение договора. До сих пор «Клочок бумаги» (факсимиле договора) висит на стенах некоторых начальных школ.</p>\n<p> Нет нации, которая не была бы виновна в нарушении договора. После объявления войны договоры нарушаются направо и налево. Были и другие нарушения нейтралитета во время войны. Нарушение договора, к сожалению, является вопросом целесообразности, а не вопросом международной морали. В 1887 г., когда существовала угроза начала войны между Францией и Германией, пресса, в том числе «Штандарт», считавшийся в то время более или менее правительственным органом, беспристрастно и со спокойной невозмутимостью обсуждали возможность разрешения Германии пройти через Бельгию, чтобы напасть на Францию. «Штандарт» утверждал, что со стороны Великобритании было бы безумием препятствовать проходу немецких войск через Бельгию, а «Зритель» писал: «Мы не будем препятствовать, да и не можем воспрепятствовать проходу через ее территорию». В 1914 году мы были не более чувствительны к своим договорным обязательствам, чем в 1887 году. Но случилось так, что в 1887 году мы были в хороших отношениях с Германией и в напряженных отношениях с Францией. Следовательно, противоположная политика больше подходила для нашей книги.</p>\n<p> Тем более что нападение на Бельгию не стало неожиданностью. Все наши планы были сделаны в рамках подготовки к нему. Опубликованные бельгийские документы выявили тот факт, что «беседы» 1906 г. Касались очень полных планов военного сотрудничества на случай германского вторжения в Бельгию, но между Бельгией и Германией подобные планы не вырабатывались. Французы и англичане именуются союзными армиями, Германия — «врагом». Были составлены подробные и подробные планы высадки британских войск.</p>\n<p> Политически вторжение в Бельгию было грубой ошибкой. Стратегически это был естественный и очевидный путь. Кроме того, теперь мы знаем, что, если бы Германия не нарушила бельгийский нейтралитет, это сделала бы Франция. Источником этой информации, совершенно понятной с точки зрения военной стратегии, является генерал Персен, чьи статьи в «Ere Nouvelle» за 1925 год цитируются и комментируются в «Manchester Guardian» от 27 января 1925 года</p>\n<blockquote>\n<p>. О бельгийском нейтралитете, задуманном Францией. Утверждения французского генерала».</p>\n</blockquote>\n<blockquote>\n<p>«От нашего собственного корреспондента.</p>\n</blockquote>\n<blockquote>\n<p>Париж, понедельник».</p>\n</blockquote>\n<blockquote>\n<p>«Непосредственно перед вступлением Великобритании в войну в 1914 году британское правительство запросило и в Берлине, и в Париже, будет ли соблюдаться бельгийский нейтралитет. Было ли обращение этого запроса к Франции чистой формальностью?</p>\n</blockquote>\n<blockquote>\n<p>«Если верить генералу Персену, известному французскому генералу-радикалу-не католику, то, по-видимому, нет, ибо он авторитетно заявляет в серии статей, которые он начал в «Ere Nouvelle», что нарушение бельгийского нейтралитета имело для многих годы являлись составной частью военных планов французского генерального штаба и даже французского правительства.</p>\n</blockquote>\n<blockquote>\n<p>«Начавшаяся полемика, едва ли нужно говорить, имеет мировое значение, ибо она в большой моральной степени распоряжается Ломом. Бумажное клеймо против Германии.</p>\n</blockquote>\n<blockquote>\n<p>«Генерал Персен, надо признать, озлобленный человек, хотя еще не было найдено никого, кто усомнился бы в его чести или способностях. Он протестант — редкость среди высших чинов французской армии — и всегда был в ссоре с военной иерархией Генерального штаба, что неудивительно, поскольку он был главой кабинета генерала Андре, военного министра в кабинете Комба, когда в деле Дрейфуса были предприняты более или менее тщетные попытки генерала Персена интересовала артиллерия, и немецкие газеты во время войны приписывали ему главную ответственность за принятие на вооружение знаменитого калибра .75. Несколько недель войны так и не были четко объяснены. Кажется, это было частью вендетты. Во всяком случае, то, что не подразумевалось никакого позора, было продемонстрировано более поздним вручением ему Большой кордон ордена Почетного легиона \".</p>\n</blockquote>\n<p> Открытие 1910</p>\n<p> года. Показания генерала Персена в «Ere Nouvelle» относятся к тому времени, когда он был одним из руководителей Высшего военного совета.</p>\n<blockquote>\n<p>«Я принимал личное участие, — пишет он, — зимой 1910/11 года в большой кампании, организованной Высшим военным советом, членом которого я тогда был. Кампания длилась неделю. Наступление на эльзасско-лотарингском фронте не имело шансов на успех, что оно неизбежно будет разбито о заграждения, накопившиеся в этом районе, и что (Германия будет) вынуждена нарушить бельгийский нейтралитет</p>\n</blockquote>\n<blockquote>\n<p>»немцы возглавят такое нарушение и, если необходимо, предвидят его сами, или нам следует ждать врага по эту сторону бельгийской границы. Это был вопрос правительственного, а не военного характера. Но любой командующий войсками, который во время войны узнает, что противник имеет намерение занять пункт, положение которого дает ему тактическое преимущество, обязан попытаться сначала занять этот пункт сам и как можно скорее. Если бы кто-нибудь из нас сказал, что из уважения к договору 1839 г. Он по собственной инициативе остался бы по эту сторону бельгийской границы, тем самым перенеся войну на французскую территорию, его товарищи и самого военного министра.</p>\n</blockquote>\n<blockquote>\n<p>«Мы все были во французской армии сторонниками тактического наступления. Это подразумевало нарушение бельгийского нейтралитета, поскольку мы знали намерения немцев. Мне скажут, что с нашей стороны это не было бы французским преступлением, но ответ, ответ на преступление Германии. Без сомнения. Но каждое вступление в войну претендует на то, чтобы быть таким ответом. Вы нападаете на врага, потому что вы приписываете ему намерение напасть на вас \".</p>\n</blockquote>\n<blockquote>\n<p>«31 августа 1911 года начальники французского и русского генеральных штабов подписали соглашение о том, что слова «оборонительная война» не следует понимать буквально, а затем подтвердили «абсолютную необходимость для французской и русской армий перейти в решительное наступление». По возможности одновременно».</p>\n</blockquote>\n<blockquote>\n<p>«По словам генерала Персена, это энергичное наступление означало нарушение Францией бельгийского нейтралитета. Можем ли мы предпринять энергичное наступление, не нарушая бельгийского нейтралитета? Лоррейн?\"</p>\n</blockquote>\n<p> Нарушение Бельгии неизбежно.</p>\n<p> Он категорически утверждает, что, по мнению французского генерального штаба, война должна была произойти в Бельгии, и действительно, через шесть месяцев после подписания упомянутого выше соглашения между французским и русским генеральными штабами полковник артиллерии Пикар в начальник группы офицеров Генерального штаба совершил поездку в Бельгию для изучения использования, когда придет время, этого поля операций.</p>\n<p> Генерал Персин заключает: «Договор 1839 года не мог не быть нарушен ни немцами, ни нами. Он был изобретен, чтобы сделать войну невозможной. Вопрос, о котором мы должны судить, таков: какой из двух , Франция или Германия больше всего хотели войны? Не тот, кто больше всего пренебрегал этим договором. Тот, кто желал войны больше, чем другой, не мог не нарушить бельгийскую территорию ».</p>\n<p> Можно привести ряд выдержек, чтобы показать, что вторжение в Бельгию ожидалось. Однако в предвоенные годы не было предпринято никаких шагов, чтобы подтвердить обязательства по старому договору 1839 г. И сделать их гораздо более обязывающими, чем они были на самом деле.</p>\n<p> Вторжение в Бельгию не было причиной войны; вторжение в Бельгию не было неожиданным; Вторжение в Бельгию не потрясло моральную восприимчивость ни британского, ни французского правительств. Но можно признать, что, оказавшись в положении, в создании которого они сами в значительной степени содействовали, британское и французское правительства на первых этапах Великой войны были вполне оправданы и даже настоятельно вынуждены подстраивать факты и искажать факты. Последствия, как они это сделали, всегда учитывая стандарт морали, который включает в себя война. Окрасить картину краской лжи, чтобы возбудить народное возмущение, было необходимо, и это было сделано с полным успехом.</p>\n<p> Глава IV. Единственная ответственность Германии за войну</p>\n<p> Обвинение врага в единоличной ответственности за войну является обычной формой в каждой нации и в каждой войне. Что касается нас, то русские (в Крымской войне), афганцы, арабы, зулусы и буры, каждый в свою очередь, были неспровоцированными агрессорами, если взять только некоторые недавние примеры. Это необходимая ложь, основанная на сиюминутном предвзятом мнении одной стороны в споре, и она становится необходимой основой всей последующей пропаганды. Передовые статьи в газетах в начале каждой войны сообщают об изменениях на эту тему и формулируются так одинаково, что создается впечатление, что стандартные статьи готовятся наготове, и имя врага, кем бы он ни был, вставлю, когда придет время. Постепенно обвинение снимается официально, когда возвращается разум и укрепление мира становится настоятельной необходимостью для всех народов.</p>\n<p> Едва ли нужно приводить много примеров всеобщего признания единоличной ответственности, преступности и злого умысла Германии. Подобные заявления можно было бы собрать в каждой стране по обе стороны войны.</p>\n<blockquote>\n<p>Это [объявление войны] едва ли можно назвать неожиданной новостью, поскольку длинная цепь фактов показывает, что Германия намеренно вызвала кризис, который сейчас навис над Европой. \"<em>Времена</em>.\" 5 августа. 1914.</p>\n</blockquote>\n<blockquote>\n<p>Только Германия и Австрия хотели этой войны. (Сэр Валентайн Чирол, \"Таймс\", 6 августа 1914 г.)</p>\n</blockquote>\n<blockquote>\n<p>И на ком лежит эта ответственность? ... Одна Сила, и только одна Сила, и эта Сила - Германия. (Мистер Асквит в Ратуше, 4 сентября 1914 г.)</p>\n</blockquote>\n<blockquote>\n<p>(Мы боремся) за то, чтобы сокрушить самый опасный заговор, который когда-либо составлялся против свободы наций, тщательно, умело, коварно, тайно спланированный в каждой детали с безжалостной, циничной решимостью. (Мистер Ллойд Джордж, 4 августа 1917 г.)</p>\n</blockquote>\n<p> Лорд Нортклифф, отвечавший за военную пропаганду, видел, насколько важно сделать обвинение основой всей своей деятельности. «Все положение союзников в отношении Германии определяется тем фактом, что Германия несет ответственность за войну», и еще: «Союзники никогда не должны уставать настаивать на том, что они стали жертвами преднамеренной агрессии» («Тайны Крю Хаус).</p>\n<p> Среди немногих умеренных голосов в августе 1914 года был лорд Роузбери, который писал:</p>\n<blockquote>\n<p>«Это действительно была искра посреди большого порохового склада, который народы Европы создавали в течение последних двадцати или тридцати лет… не знаю, был ли там какой-нибудь великий организатор... Без доказательств я не хотел бы возлагать такое бремя на голову любого человека».</p>\n</blockquote>\n<p> Однако столь яростно и неоднократно это обвинение выдвигалось во всех союзных странах, что правительство было вынуждено внести его в мирный договор. «Статья 231. Союзные и Объединившиеся правительства подтверждают, а Германия принимает на себя ответственность Германии и ее союзников за все убытки и ущерб, которым подверглись Союзные и Объединившиеся правительства и их граждане вследствие войны, навязанной им Германией. Агрессии Германии и ее союзников».</p>\n<p> Когда военные страсти стали утихать, обвинение постепенно было снято. Сами государственные деятели даже отозвали его.</p>\n<blockquote>\n<p>«Чем больше читаешь мемуары и книги, написанные в разных странах, о том, что происходило до 1 августа 1914 года, тем больше понимаешь, что никто во главе дел не имел в виду войну на том этапе. Скорее пошатнулся и споткнулся, может быть, по глупости, и обсуждение, я не сомневаюсь, предотвратило бы это». (Мистер Ллойд Джордж, 23 декабря 1920 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Я не могу сказать, что Германия и ее союзники несут единоличную ответственность за войну, опустошившую Европу… То заявление, которое мы все сделали во время войны, было оружием, которое нужно было использовать. В то время; теперь, когда война закончилась, это не может быть использовано в качестве серьезного аргумента... Когда можно будет внимательно изучить дипломатические документы войны, и время позволит нам судить о них спокойно, это будет видно что позиция России была реальной и основной причиной мирового конфликта». (Синьор Франческо Нитти, бывший премьер-министр Италии.)</p>\n</blockquote>\n<blockquote>\n<p>«Есть ли мужчина или женщина, позвольте мне сказать, есть ли ребёнок, который не знает, что семя войны в современном мире — это промышленное и коммерческое соперничество? ... Это было промышленная и коммерческая война». (Президент Вудро Вильсон, 5 сентября 1919 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Я не утверждаю, что Австрия или Германия изначально имели сознательно обдуманное намерение спровоцировать всеобщую войну. Никакие существующие документы не дают нам права предполагать, что в то время они планировали что-то столь систематическое». М. Раймон Пуанкаре, 1925.</p>\n</blockquote>\n<blockquote>\n<p>«Смею сказать, что вера в единственную вину Германии невозможна даже для месье Пуанкаре. Но если можно построить политику, основанную на теории единственной вины Германии, ясно, что следует твердо придерживаться этой теории или, по крайней мере, сделать вид, что она убеждена». (Генерал Субхомлинов (военный министр России). Цит. По М. Вальяну Контурье в Палате депутатов («Journal Officiel», 5 июля 1922 г.).</p>\n</blockquote>\n<p> Пресса и публицисты также изменили свой тон.</p>\n<blockquote>\n<p>«Взвалить на Германию единоличную ответственность за война исходит из того, что мы уже знаем - и будет больше - абсурд. Составлять договор на основе абсурда - несправедливость. Версальский договор по-человечески, морально и исторически осужден, совершенно независимо от его экономических чудовищ ». (Остин Харрисон, редактор «English Review»)</p>\n</blockquote>\n<blockquote>\n<p>«Делали ли когда-нибудь мстительные нации что-нибудь более подлое, более лживое или более жестокое, чем когда союзники посредством Версальского договора заставили Германию стать козлом отпущения, чтобы нести вину, которая принадлежала всем?какой нации чистые руки и чистое сердце?» (Чарльз Ф. Доул.)</p>\n</blockquote>\n<p> В 1923 г. Представители наций собрались во Временной смешанной комиссии для разработки Договора о взаимной помощи под эгидой Лиги Наций. Полностью осведомлены ч. Ч. Было объявлено их правительствами вопиющим и бесспорным примером неспровоцированной агрессии со стороны Германии, они оказались совершенно не в состоянии дать определение «неспровоцированной агрессии». Меморандума:</p>\n<blockquote>\n<p>«Недостаточно просто повторить формулу «неспровоцированная агрессия», ибо в условиях современной войны, казалось бы, невозможно даже теоретически решить, что представляет собой случай агрессии»</p>\n</blockquote>\n<p> . Комитет юристов после консультации предложил исключить термин «агрессия». Будущее дело в соответствии с Пактом Лиги Наций о нации, которая отказалась от рекомендации Совета или вердикта Суда и прибегла к оружию, было заменено как представляющее собой агрессивную войну.</p>\n<p> В 1925 г. В преамбуле Локарнского пакта, заключенного между Германией, Францией и Великобританией, нет ни малейшего отголоска обвинения; напротив, фактически вставлена ​​следующая фраза:</p>\n<blockquote>\n<p>«Стремясь удовлетворить стремление к безопасности и защите, которое воодушевляет народы, на которые обрушились бедствия войны 1914–1918 годов (les Nations qui ont eu à subir le fléau de la guerre )\".</p>\n</blockquote>\n<p> Здесь не место вдаваться в вопрос об ответственности, перекладывать вину с одной нации на другую или показывать степень ответственности Германии. Единоличная ответственность сильно отличается от некоторой ответственности. Немцы и австрийцы были заняты, не без веских доказательств, обвинением России. Но споры, затруднения и прискорбная неумелость дипломатии всех сторон в последние несколько недель не были, как и убийство эрцгерцога, причиной войны, хотя всегда предъявляются специальные документы, чтобы создать ложное впечатление.</p>\n<p> Причины были прецедентными и далеко идущими, и сомнительно, что даже историки будущего смогут с какой-либо степенью точности распределить вину между заинтересованными державами.</p>\n<p> Лорд Сесил Челвудский недавно указал на самую несомненную из всех сопутствующих и непосредственных причин. Выступая в Сити в 1927 году, он упомянул «гигантское соревнование в области вооружений перед войной» и сказал:</p>\n<blockquote>\n<p>«Никто не может отрицать, что состояние духа, вызванное соревнованиями по вооружению, подготовило почву, на которой выросло ужасное растение, которое в конечном итоге плоды Великой войны».</p>\n</blockquote>\n<p> Приведенного выше ряда цитат будет достаточно, чтобы показать, что единственная вина врага, как всегда, является мифом военного времени. Однако большой успех пропаганды надолго оставляет впечатление в умах тех, кто хочет оправдать перед собой свои действия в поддержку войны, и тех, кто не потрудился проследить последующие отступления и отрицания. . Более того, миф остается, насколько это возможно, в общественном сознании в виде страха перед «неспровоцированной агрессией» и становится главным и даже единственным оправданием подготовки к новой войне.</p>\n<p> Глава V. ПРОХОД РОССИЙСКИХ ВОЙСК ЧЕРЕЗ Великобританию</p>\n<p> В течение всей войны не было более распространенной навязчивой идеи, чем вера в то, что в последние месяцы 1914 года русские войска проходят через Великобританию на Западный фронт. Ничто лучше не иллюстрирует доверчивость общественного мнения в военное время и то, какой благоприятной почвой оно становится для взращивания лжи.</p>\n<p> Как на самом деле возник слух, трудно сказать. Впоследствии было сделано несколько более или менее шутливых предположений: о телеграмме, извещающей о прибытии большого количества русских яиц, именуемых «русскими»; о высоком бородатом человеке, который заявил из окна поезда, что приехал из «Россшира»; и о взволнованном французском офицере с несовершенным английским произношением, который ходил по фронту, восклицая: «Где же пайки?» Но генерал Сухомлинов в своих мемуарах утверждает, что сэр Джордж Бьюкенен, английский посол в России, действительно просил отправить в Англию «полный русский армейский корпус», и английские корабли должны были быть доставлены в Архангельск для перевозки этих войск. . Российский Генштаб, добавляет он, пришел к выводу, что «Бьюкенен потерял рассудок».</p>\n<p> Каково бы ни было происхождение, слух распространился со скоростью лесного пожара, и со всех уголков страны пришли свидетельства от людей, видевших русских. Они были в поездах с опущенными шторами, на платформах, отбивая снег с ботинок; они хрипло потребовали «водки» в Карлайле и Берик-он-Твиде, а в Дареме запихнули рубль в игровой автомат. Количество войск варьировалось в зависимости от силы воображения свидетеля.</p>\n<p> Поскольку слух имел несомненную военную ценность, власти не предприняли никаких шагов, чтобы его опровергнуть. Появилась телеграмма из Рима с «официальными известиями о концентрации 250-тысячного русского войска во Франции». По поводу этой телеграммы официальное бюро печати заявило: «Что не было подтверждения содержащимся в ней заявлениям, но что не было возражений против их опубликования». Поскольку существовала строгая цензура новостей, публикация этой телеграммы послужила подтверждением слуха и отвлекла внимание лжесвидетелей.</p>\n<p>9 сентября 1914 года в «Daily News» появилось следующее:</p>\n<blockquote>\n<p>«Официальная санкция на публикацию вышеизложенного (телеграммы из Рима) снимает с газетной оговорки в отношении слухов, которые в течение последних двух недель ходили с таким поразительным упорством. Через всю Англию вдоль и поперек.Какой бы ни была неприкрашенная правда о русских войсках на Западе, столь необыкновенным было повсеместное распространение рассматриваемых слухов, что они едва ли не более удивительны, если они ложны, чем если бы они были правдой. Беспочвенный слух получил распространение и доверие, может быть, беспрецедентное в истории, или, как бы невероятно это ни выглядело, это факт, что русские войска, каково бы ни было их число, были высажены и прошли через эту страну, в то время как ни один человек из десяти тысяч мог с уверенностью сказать, не было ли само их существование мифом».</p>\n</blockquote>\n<p> Пресса в целом держалась сдержанно, опасаясь ловушки, а Daily Mail предположила, что заявление российского генерального консула о том, что «около 5000 русских резервистов имеют разрешение служить союзникам», могло лежать в основе слухов. Подобно популярной книге, слух распространился больше благодаря устному личному общению, чем благодаря сообщениям в прессе.</p>\n<p> 14 сентября 1914 г. \"Daily News\" снова вернулась к этой теме:</p>\n<blockquote>\n<p>\"Как видно из длинного сообщения нашего специального корреспондента г-на П. Дж. Филиппа, русские войска в настоящее время сотрудничают с бельгийцами. Эти сведения доказывают правильность общее впечатление, что русские войска двинулись через Англию». («Daily News», 14 сентября 1914 г.).</p>\n</blockquote>\n<p> (Сообщение)</p>\n<blockquote>\n<p>«Сегодня вечером в вечерней газете я нахожу сообщение «de bonne source» о том, что немецкая армия в Бельгии была перерезана... Бельгийской армией, усиленной русскими войсками. Последняя фраза распечатывает мое перо. Два дня я был в долгом пути, ища русских, и теперь я нашел их - где и как не будет благоразумием сказать, но достаточно опубликованного заявления, что они здесь, и моего собственного знания. Я могу ответить за их присутствие».</p>\n</blockquote>\n<p> Официальное опровержение этого слуха военным министерством было отмечено газетой «Daily News» от 16 сентября 1914 года</p>\n<p> . «Daily Mail» от 9 сентября 1914 года содержала шутливую статью о русских слухах,</p>\n<blockquote>\n<p>в которой говорилось: Русские во Франции. Как мы все будем извиняться перед Бернетами, Броклерами и Пендлями, если они все-таки были правы?»</p>\n</blockquote>\n<blockquote>\n<p>Г-н Кинг спросил заместителя государственного секретаря по вопросам войны, может ли он заявить, не нанося ущерба военным интересам союзников, были ли какие-либо русские войска переброшены через Великобританию в западную зону европейской войны?</p>\n</blockquote>\n<blockquote>\n<p>Заместитель государственного секретаря по делам войны (Маунт Теннант): Я не уверен, обрадует это или разочарует моего достопочтенного. Друг, чтобы узнать, что никакие русские войска не перебрасывались через Великобританию в западную зону европейской войны. (Палата общин, 18 ноября 1914 г.)</p>\n</blockquote>\n<p> Глава VI. Изуродованная медсестра</p>\n<p> множество историй о зверствах, которые невозможно было ни доказать, ни опровергнуть, но в первые месяцы войны общественность потрясла ужасная история о варварской жестокости, из которых можно дать полную запись. Это любопытный пример изобретательности преднамеренного индивидуального лжеца.</p>\n<blockquote>\n<p>Из «Звезды», 16 сентября 1914 года</p>\n</blockquote>\n<blockquote>\n<p>. «Трагедия медсестры». «Девушка из Дамфриса — жертва шокирующего варварства».</p>\n</blockquote>\n<blockquote>\n<p>До Дамфриса дошли новости о шокирующей смерти молодой женщины из Дамфриса, медсестры Грейс Хьюм, которая уехала в Бельгию в начале войны. Медсестра Хьюм работала в лагерном госпитале в Вилворде и стала жертвой ужасной жестокости в руки немецких солдат. Ей отрезали груди, и она умерла в страшных муках. Семья медсестры Хьюм получила записку, написанную незадолго до ее смерти. Она была датирована 6 сентября и гласила: «Дорогая Кейт, это прощание». .Жить осталось недолго. Больница подожжена. Немцы жестоки. Здесь мужчине отрубили голову. У меня отняли правую грудь. Передайте мою любовь ---- До свидания.</p>\n</blockquote>\n<blockquote>\n<p>«Левая грудь медсестры Хьюм была отрезана после того, как она написала записку. Это была молодая женщина двадцати трех лет, ранее работавшая медсестрой в больнице Хаддерсфилд».</p>\n</blockquote>\n<blockquote>\n<p>Медсестра Маллард из Инвернесса лично доставила записку сестре медсестры Хьюм в Дамфрис. . Она также была в Вилворде и утверждает, что медсестра Хьюм играла роль героини. Немец напал на раненого солдата, которого медсестра Хьюм везла в госпиталь. Медсестра взяла ружье и застрелила немца». («Звезда», 16 сентября 1914 г.).</p>\n</blockquote>\n<p> Письмо, доставленное медсестрой Маллард мисс Хьюм.</p>\n<blockquote>\n<p>«Ваша сестра, медсестра Грейс Хьюм, попросила меня передать прилагаемое письмо к вам. Меня зовут Медсестра Маллард, и я был с вашей сестрой, когда она умерла. Наш лагерный госпиталь в Вилворде был сожжен дотла, из 1517 человек и 23 медсестер удалось спасти только 19 медсестер, а 149 мужчин сумели уйти. Грейс просила меня передать вам, что ее последние мысли были о... И о вас, и что вы не должны беспокоиться о ней, так как она собирается встретиться со своим Джеком. Это были ее последние слова. В последние часы жизни она пережила большие мучения. Один из солдат (наших) поймал двух немецких солдат, когда они отрезали ей левую грудь, правая уже была отрезана. Они были мгновенно убиты нашими солдатами. Грейс успела нацарапать вложенную записку до того, как я ее нашел, но мы все говорим, что ваша сестра была героиней. Она была в поле в поисках раненых солдат, и однажды, когда она приводила раненого солдата, на нее напал немец. Она бросила в него солдатское ружье и выстрелила в него из своей винтовки. Конечно, все медсестры здесь вооружены. Я только что получил приказ сию же минуту собраться в Шотландию. Постараюсь передать это вам, так как отсюда нет почты, и мы используем сломанный фургон для убежища. Я дам вам более полную информацию, когда увижу вас. Теперь мы все в полной безопасности, так как к нам подошло подкрепление».</p>\n</blockquote>\n<p> В «Ивнинг стандарт» появился сжатый отчет с пометкой: «Это сообщение передано в Бюро печати, которое не возражает против публикации и не берет на себя ответственности за правильность заявления.»</p>\n<blockquote>\n<p>«История, которая привлекла особое внимание как из-за своего особого зверства, так и из-за косвенных подробностей, которые сопровождали его, была рассказана в нескольких вечерних газетах в среду. Впервые оно было опубликовано, как мы полагаем, в «Dumfries Standard» в среду утром и касалось английской медсестры, которая, как говорят, была убита немцами в Бельгии с самой отвратительной жестокостью. Эта медсестра приехала из Дамфриса, и, согласно «Dumfries Standard», история была рассказана сестре медсестры в Дамфрисе другой медсестрой из Бельгии, которая также рассказала об этом в письме. Кроме того, «Dumfries Standard» опубликовал факсимиле письма, которое, как утверждается, было написано убитой медсестрой, когда она умирала, своей сестре в Дамфрисе. Таким образом, история оказалась особенно достоверной, и, как мы уже сказали, она была опубликована рядом известных лондонских вечерних газет, включая «Пэлл-Мэлл» и «Вестминстер Газетт», «Глоуб», «Стар» и «Ивнинг Стандарт». Но поздно вечером в среду выяснилось, что это совершенно не соответствует действительности, поскольку медсестра, о которой идет речь, на самом деле находилась в Хаддерсфилде и никогда не была в Бельгии, хотя и ушла добровольцем на фронт. Остается факт, что ее сестра в Дамфрисе утверждает, согласно Yorkshire Post, что ее посетила «медсестра Маллард», выдававшая себя за медсестру из Бельгии, которая рассказала ей эту историю и передала ей письмо от ее сестры из Бельгии. Почерк, похожий на почерк ее сестры. («Таймс» Лидер, 18 сентября 1914 г.) «</p>\n</blockquote>\n<p> Таймс» продолжает призывать к расследованию и предполагает, что эта история могла быть выдумана немецкими агентами, чтобы дискредитировать все истории о зверствах.</p>\n<blockquote>\n<p>«Семнадцатилетняя Кейт Хьюм была обвинена вчера в Дамфрисе перед заместителем шерифа Примроуз в том, что она произнесла поддельное письмо, якобы написанное ее сестрой, медсестрой Грейс Хьюм из Хаддерсфилда. Она отказалась делать какие-либо заявления по совету своего агента, и был заключен в тюрьму в ожидании суда (\"Таймс\", 30 сентября 1914 г.)</p>\n</blockquote>\n<blockquote>\n<p>Дело было передано в Высокий суд в Дамфрисе, и было доказано, что Кейт Хьюм (сестра) сфабриковала все» и передала их в прессу («Таймс», 29 и 30 декабря 1914 г.)</p>\n</blockquote>\n<p> Маллард</p>\n<p> сестры и виновник войны, следующий шаг - олицетворение врага. Так как нация состоит из миллионов людей и нелепая аналогия отдельного преступника и нации может стать очевидной даже для умеренно интеллигентных людей, то необходимо отделить индивидуальное на ком могут быть сосредоточены все сосуды гнева невинных людей, которые только защищаются от «неспровоцированной агрессии». Хотя кайзер во многих случаях своим хвастовством и хвастовством становился предметом насмешек и оскорблений, тем не менее, не так много лет назад его портрет появился в «Daily Mail» с подписью «Друг в беде — это действительно друг». . А уже 17 октября 1913 года «Ивнинг Ньюс» писала:</p>\n<blockquote>\n<p>«Мы все признаем кайзера очень галантным джентльменом, чье слово лучше, чем многие другие обязательства, гостем, которого мы всегда рады приветствовать и жаль терять, правителем. Чьи амбиции в отношении своего народа основаны на таком же праве, как и наше».</p>\n</blockquote>\n<p> Но когда был дан сигнал, обо всем этом можно было забыть и занять прямо противоположную позицию. Кайзер оказался самой многообещающей мишенью для концентрированных злоупотреблений. Это было сделано так успешно, что преувеличение вскоре стало невозможным; каждое преступление в календаре было брошено на его дверь авторитетно, публично и конфиденциально; и так продолжалось всю войну. Его прошлое было пересмотрено, что сильно его дискредитировало. Однако его желание воевать с Великобританией, пока мы вели англо-бурскую войну, имело досадное фактическое противоречие, как показывают следующие два отрывка:</p>\n<blockquote>\n<p>«Делькассе с помощью царя отклонил германские предложения по континентальная комбинация против нас во время англо-бурской войны ». -- «Таймс», 14 октября 1915 г. (редакционная статья об отставке Делькассе).</p>\n</blockquote>\n<blockquote>\n<p>«Во время войны в Южной Африке другие страны были готовы помочь бурам, но они поставили условие, что Германия должна сделать то же самое. Кайзер отказался». (Генерал Бота, сообщение в «Daily News» от 3 сентября 1915 г.)</p>\n</blockquote>\n<p> Но по поводу его преступности в Великой войне не было разногласий. В начале июля 1914 года он созвал в Потсдаме секретный Совет центральных держав, на котором было решено навязать войну Европе. Этот секретный заговор был впервые обнародован голландской газетой в сентябре 1914 года. История была возобновлена ​​The Times 28 июля 1917 года и снова в ноябре 1919 года. В нее верили даже в Германии, пока не были получены сообщения от различных офицеров, связанных с кайзер, показывающий, как он провел эти дни, и в конце концов от него избавились, и он оказался мифом по свидетельствам всех тех, кто, как предполагалось, принимал в нем участие. Это было в 1919 году, после того как история выполнила свою задачу.</p>\n<p> Нужно привести лишь несколько из тысячи упоминаний о личном преступлении кайзера.</p>\n<blockquote>\n<p>«Он (враг) начинает осознавать отчаянный характер авантюры, в которую вступил кайзер, когда вел эту бессмысленную войну». («Daily Mail», 1 октября 1914 г.)</p>\n</blockquote>\n<p> Следующее письмо покойного сэра У. Б. Ричмонда в «Daily Mail» от 22 сентября 1914 г. Является ярко выраженным примером принятого мнения:</p>\n<blockquote>\n<p>«Ни Англия, ни цивилизованные Европа и Азия не будет приведен в трепет сумасшедшим Вильгельмом, хотя по его приказу Реймский собор был разрушен.</p>\n</blockquote>\n<blockquote>\n<p>«Этот последний поступок вождя варваров только сблизит нас всех, чтобы избавиться от бедствия, подобного которому цивилизованный мир никогда не видел». Видел раньше.</p>\n</blockquote>\n<blockquote>\n<p>«Безумец собирает бревна из собственного костра. Мы не можем бояться чудовища; мы стиснем зубы в решимости, что, если мы умрем до последнего человека, современный Иуда и его адское отродье будут уничтожены..</p>\n</blockquote>\n<blockquote>\n<p>«Для достижения этой праведной цели мы должны быть терпеливыми и трудолюбивыми, а также энергичными</p>\n</blockquote>\n<blockquote>\n<p>«Наша великая Англия охотно прольет свою кровь, чтобы помочь избавить цивилизацию от преступного монарха и уголовного суда, которым удалось создать из послушного народа стадо дикарей. Сэр Джеймс Крайтон Браун сказал в Дамфрисе: «Недоуздок для кайзера; расстрелять его означало бы почетную смерть солдата. Недоуздок — расправа над этим преступником».</p>\n</blockquote>\n<blockquote>\n<p>«Лорд Роберт Сесил сказал, что за ужасные безобразия, массовые нарушения всех законов и обычаев цивилизованной войны, совершенные немцами, ответственны германские правители, император и те, кто близко советовал ему, и это на них, если возможно, должно было обрушиться наше наказание и гнев». («Таймс», 15 мая 1915 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Города были сожжены, старики и дети были убиты, женщины и молодые девушки были оскорблены, безобидные рыбаки были утоплены по приказу этого коронованного преступника. Ему придется ответьте «в тот великий день, когда весь мир будет судим» за жертв <em>Falaba</em> и <em>Lusitania</em>». (Лидер о лишении кайзера Ордена Подвязки, «Daily Express», 14 мая 1915 г.)</p>\n</blockquote>\n<p> На карикатуре «Punch» 1818 г. Кайзер изображен в образе Каина. Под ним было написано: «Более 14 000 мирных жителей убиты по приказу кайзера».</p>\n<p> Там был плакатный портрет кайзера, его лицо было составлено из трупов, рот истекал кровью, что можно было увидеть на щитах. Эквивалентом этого во Франции был «Гийом ле Буше», кайзер в фартуке с огромным ножом, с которого капала кровь. Во всем он был хорошим объектом для карикатуристов, так как его было так легко рисовать.</p>\n<p> Эта выдумка стала популярной и получила всеобщее признание в союзных странах, поэтому союзным государственным деятелям стало необходимо включить в начало мирного договора специальный пункт:</p>\n<blockquote>\n<p>«Союзные и Объединившиеся державы публично предъявляют обвинение Вильгельму II Гогенцоллерну, бывшему германскому императору, за величайшее преступление против международной морали и неприкосновенности договоров ...»</p>\n</blockquote>\n<p> и продолжает описывать конституцию «специального трибунала», в котором он должен был предстать перед судом.</p>\n<p> Взявшись за суд над кайзером пунктом мирного договора, союзники были вынуждены соблюсти формальности, направив 16 января 1920 г. Ноту правительству Нидерландов, в которой указывалось на «огромную ответственность» кайзера и просил для его передачи «для того, чтобы его можно было отправить на суд». Отказ правительства Нидерландов от 23 января был немедленно принят и спас союзные правительства от того, чтобы выставлять себя безнадежными дураками. Но до того, как это решение стало достоянием общественности и после того, как в частном порядке было установлено, что правительство Голландии, куда бежал кайзер, не выдаст его, была начата кампания «повесить кайзера», и на всеобщих выборах 1918 г. Те кандидаты, которые не придерживались этой политики, потеряли голоса.</p>\n<p> Но кампания была начата до того, как решение правительства Нидерландов было обнародовано.</p>\n<blockquote>\n<p>«Правитель (кайзер), который говорил о ее гордости, ее величии и ее могуществе в течение тридцати лет, теперь находится в бегах, и вскоре предстанет перед судом (громкие аплодисменты) перед трибуналами земель, которые от имени его страну, он стремился запугать». (Мистер Ллойд Джордж, Палата общин, 3 июля 1919 г.)</p>\n</blockquote>\n<p> На самом деле, не было ни малейшего намерения сделать что-то настолько абсурдное, как судить кайзера. Никто из знакомых с фактами не считал его лично ответственным за развязывание войны. Он был и всегда был ничтожным мишурным подставным лицом, у которого не было ни мужества развязать войну, ни силы остановить ее.</p>\n<p> Его биограф Эмиль Людвиг («Кайзер Вильгельм II» Эмиля Людвига) написал самое резкое обвинение Вильгельма II, которое когда-либо появлялось на любом языке, обнажая его тщеславие, манию величия и его некомпетентность. Но автор вовсе не обвиняет его в желании или организации войны, а настаивает время от времени на миролюбивом отношении Императора. «Во всех европейских событиях между 1908 и 1914 годами император был более миролюбив, был даже более дальновидным, чем его советники». Во время кризиса в Марокко «император был настроен миролюбиво», а в последние дни июля 1914 года, говоря о Германии, Австрии и России, Людвиг говорит:</p>\n<blockquote>\n<p>«Три императора, открыто выступавшие против войны, руководствовались честолюбием, мстительностью и , и некомпетентность их министров в конфликт, опасность которого для их тронов они все трое признали с самого начала и, хотя бы по этой причине, старались избежать \".</p>\n</blockquote>\n<p> Даже лорд Грей говорит теперь, когда все кончено:</p>\n<blockquote>\n<p>«Если бы дело зависело от него (кайзера), не было бы войны в Европе из-за австро-сербского спора». (\"Twenty-Five Years_\", vol II, P.25.)</p>\n</blockquote>\n<p> Тем не менее, вплоть до 1919 года кайзер, как злодей пьесы, был представлен в союзных странах как воплощение всего беззакония.</p>\n<p> Эта очень простая форма пропаганды оказала большое влияние на чувства людей. Не может быть никаких сомнений в том, что тысячи присоединившихся были под впечатлением, что главная цель войны состоит в том, чтобы поймать этого монстра, плохо зная, что война подобна шахматам: вы не можете взять короля, пока идет игра; это против правил. Это испортило бы игру. Точно так же штабы с обеих сторон никогда не подвергались бомбардировкам, потому что, как прямо сказал один солдат, «разве вы не понимаете, это положило бы конец всему кровавому делу». Обнаружив, что он, к сожалению, не был пойман или убит во время войны, люди поверили в то, что его судят и повесят, когда война закончится. Если он был всем, что им описывали, то меньше всего можно было ожидать.</p>\n<p> Когда по прошествии месяцев и лет обнаружилось, что ни один ответственный человек на самом деле не верил и никогда не верил в свою личную вину, что возглас «Повесить кайзера» был преднамеренным блефом и что, когда все было кончено, и были убиты миллионы невинных людей, ему, преступнику, извергу, заговорщику и инициатору всей катастрофы, было позволено комфортно и мирно жить в Голландии, разочарование простых, неосведомленных людей было гораздо большим, чем когда-либо осуществленный. Именно разоблачение этой грубой лжи впервые заставило многих скромных людей задаться вопросом, не были ли они также обмануты в других отношениях.</p>\n<p> Глава VIII Бельгийский младенец без рук</p>\n<p> Бельгийский младенец, которому немцы отрубили руки, путешествовал не только по городам и деревням Великобритании, но и через Западную Европу и Америку, даже на Дальний Запад. Никто не останавливался, чтобы спросить, сколько проживет младенец, если ему отрубить руки, если только не будет под рукой опытного хирурга, чтобы перевязать артерии (ответ был всего несколько минут). Все хотели верить в эту историю, и многие дошли до того, что сказали, что видели ребенка. Ложь была так же общепризнана, как и проход русских войск через Британию.</p>\n<blockquote>\n<p>«Один человек, которого я не видел, сказал представителю Католического общества, что своими глазами видел, как немецкие солдаты отрубили руки младенцу, который цеплялся за юбки своей матери». («Таймс», корреспондент в Париже, 27 августа 1914 г.)</p>\n</blockquote>\n<p> 2 сентября 1914 г. Корреспондент «Таймс» цитирует заявление французских беженцев: «Они отрубили руки маленьким мальчикам, чтобы во Франции больше не было солдат».</p>\n<p> Изображения младенца без рук были очень популярны на континенте, как во Франции, так и в Италии. В \"Le Rive Rouge\" была картина от 18 сентября 1915 года, а от 26 июля 1916 года она стала еще более зловещей, изображая немецких солдат, поедающих руки. «Le Journal» 30 апреля 1915 года дал фотографию статуи ребенка без рук, но самая дикая из всех, не содержащая элементов карикатуры, была выпущена союзниками в пропагандистских целях и опубликована в «Critica». В Буэнос-Айресе (воспроизведено в «Сфере», 30 января 1925 г.). Заголовок картины был «Библия прежде всего», а под ней было написано: «Пустите детей приходить ко Мне». Кайзер изображен стоящим за огромной глыбой с топором, его руки в темных пятнах крови. Вокруг блока груды рук. Он манит женщину, чтобы та привела несколько детей, которые цепляются за нее, у некоторых уже отрезаны руки.</p>\n<p> Младенцам не только отрубали руки, но и насаживали на штыки, а в одном случае прибивали к двери. Но безрукий бельгийский младенец запомнится всем. Об этом громко говорили в автобусах и других общественных местах, видели в больнице, теперь в соседнем приходе и т.д., и выставляли напоказ не как единичный случай злодеяния, а как типичный пример жестокости. Общая практика.</p>\n<p> В парламенте была обычная уклончивость, которая предполагала, что история была правдой, хотя единственное представленное свидетельство было «увидено свидетелями».</p>\n<blockquote>\n<p>Г-н А. К. Ллойд спросил Первого лорда казначейства, имеются ли материалы для идентификации и розыска оставшихся в живых тех детей, чьи руки были отрезаны немцами и чьи дела обозначены буквами и номерами в отчете Комитета Брайса. ; и если да, то рассмотрит ли он возможность сделать информацию доступной, конфиденциально или иным образом, лицам, заинтересованным в будущем этих оставшихся в живых?</p>\n</blockquote>\n<blockquote>\n<p>Сэр Г. Кейв: Достопочтенный. Друг попросил меня ответить на этот вопрос. Во всех отдельных случаях, кроме двух, когда свидетели видели детей изуродованными таким образом, ребенок был либо мертв, либо умирал от того обращения, которому он подвергался. Ввиду того, что эти дети находились в Бельгии, которая до сих пор находится под немецкой оккупацией, маловероятно, что их сейчас можно было бы отследить, и любая попытка сделать это в это время может привести к дальнейшему преследованию жертв или их родственников. .</p>\n</blockquote>\n<blockquote>\n<p>Мистер Ллойд: Разве сюда в больницу не доставляли других больных?</p>\n</blockquote>\n<blockquote>\n<p>Сэр Дж. Кейв: Не те дела, которые достопочтенный. Вопрос члена относится.</p>\n</blockquote>\n<blockquote>\n<p>(Палата общин, 16 декабря 1916 г.).</p>\n</blockquote>\n<p> Иногда безрукий человек был взрослым. Мистер Тайлер на собрании Братства в Глазго 17 апреля 1915 года сказал, что у него есть друг в Харрогейте, который видел медсестру с отрезанными немцами обеими руками. Он дал адрес своего информатора. Письмо было немедленно адресовано другу в Харрогейте с вопросом, верно ли утверждение, но ответа так и не было получено.</p>\n<p> безруком ребёнке появилась в «Санди кроникл» от 2 мая 1915 года.</p>\n<blockquote>\n<p>Во время своего визита она заметила ребенка, девочку лет десяти, которая, хотя в комнате было скорее жарко, чем иначе, держала руки в жалкой поношенной муфте.Вдруг ребенок сказал матери: «Мама, пожалуйста, высморкайся для меня».</p>\n</blockquote>\n<blockquote>\n<p>«Шокирует, — сказала милосердная дама полусмеясь, полусурово, — такая большая девочка, как вы, которая не может пользоваться собственным носовым платком»</p>\n</blockquote>\n<blockquote>\n<p>. , деловитый тон. — У нее теперь нет рук, мэм, — сказала она. Великая дама посмотрела, вздрогнула, поняла. -- Неужели, -- сказала она, -- немцы... Мать расплакалась. Это был ее ответ».</p>\n</blockquote>\n<p> Синьор Нитти, который был премьер-министром Италии во время войны, пишет в своих мемуарах:</p>\n<blockquote>\n<p>«Чтобы донести до мира правду о нынешнем европейском кризисе, необходимо снова и снова разрушать порочные легенды, созданные пропаганда войны. Во время войны Франция вместе с другими союзниками, включая наше собственное правительство в Италии, распространяла самые нелепые изобретения, чтобы пробудить боевой дух нашего народа. Жестокости, приписываемые немцам, были такими, что у нас стыла кровь. Мы слышали историю о бедных бельгийских детях, которым гунны отрубили руки. После войны богатый американец, глубоко тронутый французской пропагандой, отправил эмиссара в Бельгию с намерением обеспечить пропитание детям, которым отрубили бедные ручки. Он не смог обнаружить ни одного. Г-н Ллойд Джордж и я, когда стояли во главе итальянского правительства, провели обширные расследования относительно правдивости этих ужасных обвинений, некоторые из которых, по крайней мере, касались имен и мест. Каждый исследуемый случай оказался мифом».</p>\n</blockquote>\n<p> Полковник Репингтон в своем «Дневнике мировой войны», том II, стр. 447, говорит:</p>\n<blockquote>\n<p>«Кардинал Гаске сказал мне, что Папа обещал выразить большой протест против мир, если бы удалось доказать хотя бы один случай надругательства над бельгийскими монахинями или отсечения рук у детей. Было начато расследование, и многие дела были рассмотрены с помощью бельгийского кардинала Мерсье. Ни один случай не мог быть доказан\"</p>\n</blockquote>\n<p> . 1924 г.):</p>\n<blockquote>\n<p>«Однажды вечером мне показали корректуру «Фигаро», в которой два известных ученых утверждали и подтверждали своими подписями, что своими глазами видели около сотни детей, которым немцы отрубили руки».</p>\n</blockquote>\n<p> Несмотря на показания этих ученых, я усомнился в точности отчета и запретил его публикацию. Когда редактор «Фигаро» выразил свое негодование, я заявил, что готов исследовать в присутствии американского посла, дело, которое взволновало бы мир. Однако я потребовал, чтобы название места, где должны были проводиться эти исследования, было дано двумя учеными. Я настоял на том, чтобы эти подробности были сообщены немедленно. Я до сих пор не получил их ответа. Или посетить.</p>\n<p> Но этим он так овладел воображением людей, что оно еще далеко не умерло. Совсем недавно один ливерпульский поэт в сборнике под названием «Попурри песен» написал следующие строки в «патриотической» поэме:</p>\n<blockquote>\n<p>«Они остановили первый безумный натиск культурного немецкого гунна, Который возмутил каждую бельгийку И калечила сыновей каждой матери».</p>\n</blockquote>\n<p> Глава IX. Лувенский алтарь</p>\n<p> На мирной конференции бельгийские представители потребовали крылья алтаря Дитрика Бута в качестве компенсации за знаменитый левенский алтарь, ценное произведение искусства, которое, по их словам, было беспричинно брошено в огонь. Горящей библиотеки немецким офицером. История была принята, и две фотографии переданы. Но это было неправдой.</p>\n<p> «Нью Стейтсмен» от 12 апреля 1924 г. Приводит факты:</p>\n<blockquote>\n<p>«Алтарь Дитрика Бута не был брошен в огонь ни немцами, ни кем-либо еще. Не его разрушители, а его хранители. Немецкий офицер спас его от огня и передал бургомистру, который отнес его на хранение в подвалы ратуши и замуровал там.</p>\n</blockquote>\n<p> Глава X Презренная маленькая армия</p>\n<p> Не может быть сомнения в том, что наиболее удачным лозунгом для целей вербовки, издаваемым в течение всей войны, была фраза «презренная маленькая армия», которую, как говорят, использовал кайзер по отношению к Британский экспедиционный корпус. Это очень естественно вызвало страстное чувство негодования по всей стране. История этой лжи и ее разоблачения чрезвычайно интересна.</p>\n<p> В приложении к Обычным приказам БЭФ от 24 сентября 1914 г. Было издано следующее:</p>\n<p> «Ниже приводится копия Приказов, изданных германским императором 19 августа»:</p>\n<blockquote>\n<p>«Мое королевское и императорское повеление сосредоточить ваши усилия на в настоящее время с единственной целью, а именно с тем, чтобы вы направили все свое мастерство и всю доблесть моих солдат на то, чтобы сначала истребить вероломных англичан, пройти через презренную маленькую армию генерала Френча...» (Штаб-квартира, Экс-Ла (Шапель, 19 августа).</p>\n</blockquote>\n<blockquote>\n<p>«Результатами приказа были операции, начавшиеся с Монса, и наступление подавляющих масс против нас. Ответ британской армии по вопросу об истреблении уже дан». (Printing Co., RE 69.)</p>\n</blockquote>\n<p> Подлинность этого официального военного заявления, естественно, никогда не подвергалась сомнению, хотя была предпринята одна попытка сделать вид, что это неправильный перевод. Возмущение, поднятое по всей стране, было искренним и всеобщим.</p>\n<p> Военный корреспондент \"Таймс\" упомянул о кайзере как о находящемся в \"высоком состоянии возбуждения и возбудимости\", а автор-лидер в \"Таймс\" (1 октября 1914 г.), ссылаясь на заявление, сказал: \"Несмотря на свирепый приказ Кайзера ... Сегодня. Презренная маленькая армия Френча «еще не истреблена».</p>\n<p> В тот же день «Таймс» напечатала стихотворение под названием «Презренная маленькая армия Френча».</p>\n<blockquote>\n<p>«Кайзер насмехался над британской армией и называл ее «презренной», потому что она была малочисленной. , в заявлении, которое, безусловно, станет историческим, он приказал своим легионам Голиафа сконцентрировать свою энергию». (Daily Express, 2 октября 1914 г.)</p>\n</blockquote>\n<p> Г-н Черчилль отлично обыграл его в рекрутской речи в Лондонском оперном театре 11 сентября 1914</p>\n<p> г. В марте 1915 г. Панч представил карикатуру на немецкого орла в разговоре с кайзером: \" Значит, вот так: вы сказали мне, что Британский лев презренен, а он таковым не был.</p>\n<p> И снова в 1917 году (после вступления Америки в войну) на карикатуре изображен кронпринц, говорящий кайзеру (который готовит свою очередную речь): «Ради Готта, отец, будь осторожен и не звони Американская армия «презренная»!»</p>\n<p> Не было ни деревни в стране, где это выражение не было бы известно, ни провинциальной газеты, в которой бы оно не цитировалось, пока, наконец, это слово не стало использоваться для обозначения офицеров и солдат, входивших в первоначальный экспедиционный корпус. Они стали известны как «Старые презренные».</p>\n<p> Тщательное расследование подлинности этого приказа, «изданного кайзером», было предпринято в 1925 г. При содействии немецкого генерала, который провел тщательный обыск в берлинских архивах, и британского генерала сэра Ф. Мориса, который удалось пролить свет на эту тему.</p>\n<p>Хотя общеизвестно глупая неосмотрительность кайзера могла объяснить любое нелепое высказывание, было известно, что он не отдавал приказов по собственной воле; они были подготовлены для него его штабом, который, конечно, не был настолько невежественен в своем деле, чтобы сказать немецким генералам сосредоточить свои усилия на уничтожении армии, когда они не могли сказать им, где эта армия находится. Их незнание местонахождения британской армии было доказано телеграммой, отправленной немецким начальником штаба фон Клюку 20 августа (на следующий день после издания предполагаемого приказа): «Высадку англичан в Булони следует считаться с Однако здесь существует мнение, что крупных высадок еще не было».</p>\n<p> Далее было обнаружено, что немецкий штаб никогда не был в Экс-ла-Шапель. Штаб переехал из Берлина около 15 августа. И отправились в Кобленц, позже в Люксембург, откуда 27 сентября перебрались в Шарлевиль.</p>\n<p> Тщательные поиски в архивах оказались безрезультатными. Никакого такого приказа или чего-то подобного обнаружить не удалось. Однако, не удовлетворившись этим, немецкий генерал навел справки у самого бывшего кайзера в Дорне. В заметке на полях экс-кайзер заявил, что он никогда не использовал такое выражение, добавив: «Наоборот, я постоянно подчеркивал высокую ценность британской армии и часто в мирное время предостерег от недооценки ее. .\"</p>\n<p> Генерал сэр Ф. Моррис провел поиск в немецких газетных файлах предполагаемой речи или приказа кайзера, но безуспешно. В статье, разоблачающей эту фабрикацию («Daily News», 6 ноября 1925 г.), он отмечает, что Ставка пришла к идее использовать обычные приказы для публикации заявлений, которые, как считалось, должны были воодушевить и вдохновить наших людей». Высмеивая немецкую армию ... Люди в окопах сочли эти усилия абсурдными, и вскоре они были прекращены ».</p>\n<p> Мы можем теперь смеяться над этой ложью, и некоторые, возможно, будут склонны отдать должное офицеру, состряпавшему ее, хотя он и допустил небрежную ошибку относительно местонахождения немецкого штаба. Не может быть сомнения в ее огромном успехе, тем не менее есть многие разделят мнение джентльмена, писавшего в прессу («Нация» и «Атенеум», 8 августа 1925 г.), который, услышав, что подлинность известной и почти избитой фразы подвергается сомнению, заметил, что «ее крайняя серьезность к нашей национальной чести или к чести британского офицера, первоначально ответственного за это», если бы это оказалось выдумкой.</p>\n<p> Глава Xi. Deutschland ÜBer Alles</p>\n<p> Welt» — (Германия превыше всего на свете) играли большую роль.</p>\n<p> ganzen должно быть, было много людей, достаточно знавших немецкий язык, чтобы понять значение этой фразы, но никто не протестовал против неправильного перевода, который обычно использовался для иллюстрации агрессивных империалистических амбиций Германии. Это было общепринято как означающее «(Пусть) Германия (правит) повсюду во всем мире», то есть немецкое господство над миром.</p>\n<p> Г-н Ллойд Джордж использовал его 20 сентября 1914 года в Королевском зале:</p>\n<blockquote>\n<p>«Договоры ушли, честь народов ушла, свобода ушла. Что осталось? Германия, осталась Германия.</p>\n</blockquote>\n<blockquote>\n<p>«Deutschland über Alles».</p>\n</blockquote>\n<blockquote>\n<p>«Punch_» сохраненего на фронт в различных карикатурах:</p>\n</blockquote>\n<blockquote>\n<p>«Кайзер, играя на флейте, бросил сломанный большой барабан с надписью «Deutschland über Alles».</p>\n</blockquote>\n<blockquote>\n<p>«Кайзер пытается надуть проколотый воздушный шар с надписью «Deutschland über Alles».</p>\n</blockquote>\n<p> Кайзер как верховный жрец Молоха. Молох с надписью «Deutschland über Alles».</p>\n<p> Его постоянно цитировали в бесчисленных статьях в прессе. Когда видный член парламента употребил это выражение в письме в «Таймс», ему было указано на неправильное значение, которое он ему придавал. Он признал ошибку, но, похоже, считал, что общепринятое значение этого слова оправдывает его использование.</p>\n<p> Ложный смысл распространился по стране и Империи, и Министерство образования Онтарио дошло до того, что приказало исключить эту песню из немецких школьных учебников по всей провинции («Таймс», 19 марта 1915 г.).</p>\n<p> Даже после войны, в ноябре 1921 года, ведущий автор в известной газете заявил, что до тех пор, пока немцы будут исполнять свой национальный гимн «Deutschland über Alles auf der ganzen Welt», мира в Европе не будет.</p>\n<p> Глава XII. Младенец из Курбек-Лоо Нечасто</p>\n<p> нам приходится признаваться во лжи, но история младенца из Курбек-Лоо — яркий пример изобретения, рассказанного его автором.</p>\n<p> Капитан Ф. У. Уилсон, бывший редактор «Санди Таймс», рассказал об этой истории в Америке в 1922</p>\n<blockquote>\n<p>году Уилсон, оказался в Брюсселе в момент начала войны. Они телеграфировали, что хотят рассказов о зверствах. Ну, в то время не было никаких зверств. Тогда они телеграфировали, что хотят рассказов о беженцах. Сказал себе: «Все в порядке, мне не придется двигаться». Под Брюсселем был маленький городок, куда ходили пообедать, и тоже очень хорошо пообедать. Я слышал, что там был гунн. Я подумал, что там должен был быть ребенок. Поэтому я написал душераздирающий рассказ о ребенке Курбек-Лоо. Спасение от гуннов при свете горящих дворов.</p>\n</blockquote>\n<blockquote>\n<p>На следующий день они телеграфировали мне, чтобы я прислал младенца, так как у них было около пяти тысяч писем с предложением усыновить его. На следующий день в офис начала поступать детская одежда. Даже королева Александра выразила сочувствие и прислала одежду. Ну, я не мог телеграфировать им, что ребенка не было. Так что я, наконец, договорился с доктором, который заботился о беженцах, что благословенный младенец умер от какой-то очень заразной болезни, поэтому его нельзя было даже публично похоронить</p>\n</blockquote>\n<blockquote>\n<p>..</p>\n</blockquote>\n<p> Распятый канадец</p>\n<p> Как и многие другие истории, эта претерпела значительные изменения и вариации. Распятой была то девушка, то американка, но чаще всего канадец</p>\n<blockquote>\n<p>. Канадские солдаты, раненные в боях за Ипр, прибыли в базовый госпиталь в Верскюле. Все они рассказали историю о том, как один из их офицеров был распят немцами. Он был пригвожден к стене штыками, проткнутыми ему по рукам и ногам, затем еще один штык был вонзен ему в горло, и, наконец, он был изрешечен пулями. Раненые канадцы сказали, что Дублинские Стрелки видели, как это делалось своими глазами, и слышали, как офицеры Дублинских Стрелков говорили об этом». («Таймс», 10 мая 1915</p>\n</blockquote>\n<blockquote>\n<p>г. К сожалению, есть веские основания полагать, что рассказ вашего парижского корреспондента о распятии канадского офицера во время боев при Ипре 22 апреля 1923 года по существу является правдой. Эта история была распространена здесь в то время, но из-за отсутствия прямых улик и абсолютных доказательств люди не желали верить, что цивилизованный враг виновен в столь жестоком и жестоком поступке.</p>\n</blockquote>\n<blockquote>\n<p>«Теперь у меня есть основания полагать, что письменные показания, свидетельствующие о факте обнаружения тела, находятся в распоряжении штаба британской штаб-квартиры. Несчастной жертвой был сержант. Как мне рассказали, он был найден прикованным к деревянная ограда хуторской постройки. Ему проткнули штыками ладони и ноги, прижав его к забору. Он был неоднократно заколот штыками, на теле было много колотых ран. Я не слышал, чтобы кто-либо один из наших людей действительно видел совершенное преступление.Есть основания для предположения, что этот человек был мертв до того, как его прижали к забору, и что враг в своей безумной ярости и ненависти к англичанам обрушил свою месть на бездыханное тело его враг.</p>\n</blockquote>\n<blockquote>\n<p>«Это самый милосердный цвет лица, который можно придать поступку, как бы он ни был ужасен.</p>\n</blockquote>\n<blockquote>\n<p>«В рядах канадцев, сражавшихся при Ипре, нет ни одного человека, который не был бы твердо убежден в том, что это подлое дело было совершено. Они также знают, что враг заколол штыком их раненых и беспомощных товарищей в окопах». («Таймс», 15 мая 1915 г., корреспондент, Северная Франция).</p>\n</blockquote>\n<blockquote>\n<p>Г-н Хьюстон спросил заместителя государственного секретаря по вопросам войны, есть ли у него какие-либо сведения о распятии трех канадских солдат, недавно захваченных в плен немцами, которые прибили их штыками к стене деревянной конструкции.</p>\n</blockquote>\n<blockquote>\n<p>Мистер Теннант: «Нет, сэр, в военное министерство еще не поступила информация о совершении такого злодеяния».</p>\n</blockquote>\n<blockquote>\n<p>Мистер Хьюстон: «Знает ли достопочтенный джентльмен, что канадские офицеры и канадские солдаты, которые были очевидцами этих зверских бесчинств, дали показания под присягой? Разве командир базы в Булони не обратил на них внимание военного министерства? \"</p>\n</blockquote>\n<blockquote>\n<p>Мистер Харкорт: Нет, сэр, у нас нет никаких записей об этом. (Палата общин, 12 мая 1915 г.)</p>\n</blockquote>\n<blockquote>\n<p>Г-н Хьюстон спросил заместителя государственного секретаря по вопросам войны, есть ли у него какая-либо официальная информация, свидетельствующая о том, что во время недавних боев, когда канадцы были временно отброшены, они были вынуждены оставить около сорок своих раненых товарищей в сарае, и что, отбив позицию, они обнаружили, что немцы закололи штыками всех раненых, кроме сержанта, и что немцы сняли фигуру Христа с большого деревенского распятия и привязали сержанта при жизни на крест; и в курсе ли он, что распятие наших солдат становится практикой немцев.</p>\n</blockquote>\n<blockquote>\n<p>Г-н Теннант: Военные власти Франции имеют постоянно действующие инструкции присылать сведения о любых подтвержденных случаях зверств, совершенных немцами против наших войск. Никакой официальной информации в смысле Hon. Вопрос члена был получен, но из-за информации, переданной достопочтенным. Предыдущий вопрос члена, запрос еще не завершен. (Палата общин, 19 мая 1925 г.).</p>\n</blockquote>\n<p> Эта история прошлась по прессе здесь и в Канаде и была использована членами парламента на платформе. Однако его подлинность в конечном итоге была опровергнута генералом Марчем в Вашингтоне.</p>\n<p> Это всплыло снова в 1919 году, когда в «Нации» было опубликовано письмо (12 апреля) от рядового Э. Лоадера, 2-го Королевского Вест-Кентского полка, который заявил, что видел распятого канадца. «Нация» была проинформирована в последующем письме от капитана Э. Н. Беннетта, что в списках Королевских Вест-Кентов не было такого рядового и что 2-й батальон находился в Индии в течение всей войны.</p>\n<p> Глава XIV. Расстрел FranzÖSling</p>\n<p> Это одна из лжи, возникшая из-за неправильного перевода. 30 сентября 1914 года пресс-бюро выпустило сообщение, которое на следующий день было опубликовано в «Таймс». Говорили, что это копия Kriegschronik, «захваченная таможней в портах высадки». Приведенная выдержка была следующей:</p>\n<blockquote>\n<p>«Только что был застрелен предатель (в Вогезах), маленький француз (ein Französling), принадлежащий к одному из тех гимнастических обществ, которые носят трехцветные ленты (т. Бедный молодой человек, который в своем увлечении хотел быть героем. Немецкая колонна проходила по лесному ущелью, и его поймали и спросили, не приближаются ли французы. Он отказался сообщить информацию. В пятидесяти метрах дальше был огонь из-под покрова леса. У пленного спросили по-французски, знал ли он, что неприятель находится в лесу, и не отрицал этого. Виноградник за его спиной, и с гордой улыбкой на лице принял залп стреляющих. Безумный негодяй! Жалко было видеть такое растраченное мужество ».</p>\n</blockquote>\n<p> Г-н Дж. А. Хобсон написал в «Таймс» от 5 октября 1914 года, чтобы указать на неточность в отчете о немецких зверствах, опубликованном Бюро печати и опубликованном «Таймс».</p>\n<p> В отрывке описывается, как «маленький французский мальчик (ein Französling)» был застрелен за отказ раскрыть близость некоторых французских солдат. Слово «Französling», писал г-н Хобсон, «не означает маленького французского мальчика», а «используется исключительно для описания немецких подданных с французскими наклонностями. В Эльзасе и Лотарингии существуют общества этих Französlings, которые носят французские цвета. ... Это не мальчики, а взрослые мужчины».</p>\n<p> «Постоянный читатель» писал в «Таймс» 6 октября 1914 года:</p>\n<blockquote>\n<p>«Вы публикуете на странице 6 своего номера за сегодняшнее утро заметку, переданную мистером Дж. А. Хобсоном, в которой намекается, что юная жертва немецкого обстрела в Вогезах , чья судьба была описана в письме немецкого солдата, напечатанном на прошлой неделе, возможно, был взрослым мужчиной, «а не юношей». По крайней мере, г-н Хобсон говорит, что «Общества этих Französlings; которые носят французские цвета, не мальчики, а взрослые мужчины». ... Притом ясно, что если бы это был взрослый человек призывного возраста, то он бы служил военную службу и не был бы на свободе на дорогах».</p>\n</blockquote>\n<p> Это письмо, должно быть, было из пресс-бюро, поскольку в оригинальной заметке «Таймс» не упоминалось о том, что оно взято из письма немецкого солдата, и не цитировалось. Немецкий текст. «Постоянный читатель» явно читал в другом месте.</p>\n<p> Г-н Дж. А. Хобсон написал в «Таймс» 8 октября 1914 года:</p>\n<blockquote>\n<p>«В ответ на «Постоянный читатель» позвольте мне указать, что цель моей заметки об инциденте с «Францезлингом» заключалась в том, чтобы заявить, что это слово означает «профранцузское Немец», а не, как перевело Пресс-бюро, «маленький француз?» То, что он был «молодым парнем», никто не оспаривает, но это не дает никаких оснований называть его бойскаутом».</p>\n</blockquote>\n<p> Кажется, не было указано, что в немецком Эльзасе не могло существовать отряда бойскаутов, называемых эклерерами и носящих трехцветные ленты.</p>\n<p> Пресс-бюро сообщает нам, что официальная газета, распространенная среди немецких войск, с удовлетворением посмеивалась над убийством французского мальчика, который отказался сообщить врагу местонахождение французских войск. («Daily Express», октябрь 1914 г.).</p>\n<p> В том же номере был напечатан рассказ Пресс-бюро под заголовком «Маленький французский герой». Вся цель Бюро печати состояла в том, чтобы возбудить общественное мнение против немцев за расстрел мальчика. Расстрел шпионов не осуждался, так как сама «Таймс» сообщила также из Вогезов, что немцы, пойманные с поличным в актах шпионажа, предстали перед судом. Среди прочих были расстреляны мэр и почтмейстер Танна.</p>\n<p> Люди могут быть еще больше озадачены поиском этого дела, найдя его в указателе The Times под заголовком «Расстрел Франца Ослинга».</p>\n<p> Глава XV. Коллекция марок маленького Альфа</p>\n<p> Священнослужитель во время обеда в ресторане в 1918 году узнал от незнакомца, что сын его друга интернирован в лагере в Германии. В недавнем письме, по его словам, был отрывок: «Штамп на этом письме редкий; отмочите его для коллекции маленького Альфа». Хотя в семье не было никого по имени Альф и не было коллекционера марок, они сделали то, что им сказали. Под маркой были слова: «Мне вырвали язык, я не мог вставить его в письмо» (известие, видимо, не язык). Священник сказал мужчине, что эта история абсурдна и что ему должно быть стыдно за то, что она повторяется, так как все знают, что на письмах арестантов нет печатей. Если его другу удалось поставить марку на его письмо, это был лучший способ привлечь внимание к тому, что он пытался скрыть. Но незнакомец, без сомнения, из патриотических побуждений, с негодованием отказался, чтобы его история была испорчена, и она получила широкое распространение в Манчестере. («Артифекс» в «Manchester Guardian»)</p>\n<p> . Интересным моментом в этой лжи является то, что она также использовалась в Германии с вариациями. Одна дама из Мюнхена получила письмо от своего сына, находившегося в плену в России. Он сказал ей снять марку с его письма, «поскольку оно было редким». Она так и сделала и обнаружила внизу надпись: «Они отрезали мне обе ноги, так что я не могу убежать». История в конце концов была убита насмешками, но не раньше, чем она попала в Аугсбург и другие города.</p>\n<p> Вероятно, это была одна из историй, которые используются на каждой войне.</p>\n<p> Глава XVI. ТАТУИРОВАННЫЙ ЧЕЛОВЕК</p>\n<p> К концу 1918 года было распространено заявление, подкрепленное фотографиями, о том, что английские военнопленные были татуированы с изображением немецкого орла, кобры или других изображений на лицах. Интересное. Особенность этой лжи в том, что она, по-видимому, исходила от целого ряда различных лиц, каждый из которых стремился приукрасить какие-нибудь совершенно необоснованные слухи, которые распространились.</p>\n<blockquote>\n<p>Плата за татуировку не подтверждена.</p>\n</blockquote>\n<blockquote>\n<p>«7 декабря в прессе появилось сообщение о том, что в Ньюкасл прибыл корабельный пожарный по имени Бертон Мэйберри, имеющий на щеках татуировку в виде головы кобры, которую, как он утверждает, нанесли два матроса по приказу командира немецкой подводной лодки в серединес торпедированием корабля Мэйберри в апреле 1917 года. Фотографии Мэйберри, изображающие головы кобры на каждой щеке, также появились в различных иллюстрированных газетах.</p>\n</blockquote>\n<blockquote>\n<p>связи что 13 ноября Мэйберри подал заявление о регистрации в качестве моряка, готовясь предложить себя для работы в британском торговом флоте, и что, подавая свое заявление, он заявил, что ранее не имел морской службы. В настоящее время он исчез, и кажется, что его исчезновение произошло после получения просьбы о явке для получения регистрационного удостоверения. Бывшие соратники Мэйберри заявляют, что он никогда не намекал на предполагаемое безобразие.</p>\n</blockquote>\n<blockquote>\n<p>«В последнее время в прессе появлялись частые заявления относительно предполагаемого клеймения немцами британских солдат, но ответственные органы не смогли получить никаких подтверждений этим утверждениям». («Таймс», 23 декабря 1918 г.)</p>\n</blockquote>\n<p> Следующая выдержка из «Манчестер Гардиан» и заявление «Артифекса» (псевдоним известного манчестерского священнослужителя) более полно дают другие версии этой истории.</p>\n<blockquote>\n<p>«Наш корреспондент «Артифекс» осмелился предположить на прошлой неделе, что история заключенного, которому немцы сделали татуировку на щеке, получившая через раздел прессы широкое распространение среди простого народа, не была установлена ​​никакими достоверными источниками. Он говорит нам сегодня, что с тех пор его завалили письмами, в которых содержались отчеты о том, как именно этот человек был татуирован, и подробно рассказывалось о его прежней истории, нынешнем роде занятий и семейных отношениях. Каждый из корреспондентов, отправивших эти письма, не сомнение подтверждается вырезкой, которую он прислал, в его вере в правдивость сказки и в преднамеренную слепоту «Артифекса». \"Артифекс\" говорит, что они рождены мифом, быстро распространялись и по мере своего развития приобретали разнообразие. Если этого недостаточно, есть еще одно неопровержимое доказательство. Говорят, что камера не может лгать. Пока что 9 декабря две разные газеты опубликовали фотографии жертвы. Каждое изображение представляет его правый профиль целиком. На одном изображена его щека, отмеченная змеей в полный рост черного цвета, на другом ее украшает контур головы змеи. Но татуировка — это постоянная отметина, которую годы не могут ни изменить, ни испортить. Любое жюри, столкнувшееся с этими противоречивыми изображениями, было бы вынуждено согласиться с тем, что страдалец ежедневно повторно наносил обезображивание и что он пренебрег предосторожностью повторения одного и того же устройства. Эта история, должно быть, значительно увеличила тревогу многих семей, у которых пленники оказались в руках врага. В начале войны власти, не колеблясь, рекомендовали замалчивать многочисленные сообщения о рыцарском обращении турок с нашими солдатами. Это, в свете послужного списка турецкого правительства в целом, могло быть разумным, мы предлагаем, чтобы они были, по крайней мере, не менее активны, чтобы предотвратить распространение таких сомнительных историй об обращении с заключенными, как эта. («Manchester Guardian», 19 декабря 1918 г.)</p>\n</blockquote>\n<p> Выдержка из комментариев «Artifex»:</p>\n<blockquote>\n<p>В данном случае я не должен жаловаться на отсутствие подтверждающих доказательств. Меня заверили, что этот человек, работая на верфи на Тайне,</p>\n</blockquote>\n<blockquote>\n<p>(1) подвергся пересадке кожи в Солфордской королевской больнице,</p>\n</blockquote>\n<blockquote>\n<p>(2) сошел с ума от ужаса в больнице Лиф-сквер,</p>\n</blockquote>\n<blockquote>\n<p>(3) из-за своего ужасного вида преждевременно заключение и смерть его молодой жены в Левенсхульме,</p>\n</blockquote>\n<blockquote>\n<p>(4) довел хрупкую двенадцатилетнюю дочь до припадков в Стокпорте</p>\n</blockquote>\n<blockquote>\n<p>(5) прожил девять месяцев в доме в Весте, не выходя из дома, кроме как после наступления темноты, поэтому никто из соседей когда-либо видел его и</p>\n</blockquote>\n<blockquote>\n<p>(6) все время проживал также в Гортоне, Суинтоне, Пендлбери и Тилдесли.</p>\n</blockquote>\n<p> Глава XVII. Фабрика трупов</p>\n<p> Ряд выдержек повествует об одной из самых отвратительных лжи, придуманной во время войны, распространение которой не только в нашей стране, но и во всем мире поощрялось и поощрялось как правительством, так и прессой. . Это началось в 1917 году и не было окончательно ликвидировано до 1925 года.</p>\n<p> (Большинство приведенных цитат взяты из «Таймс». Следует помнить, что ссылки в нижних слоях прессы были гораздо более зловещими.)</p>\n<blockquote>\n<p>«Один из Консулы Соединенных Штатов, уезжая из Германии в феврале 1917 года, заявили в Швейцарии, что немцы перегоняли глицерин из тел своих умерших». («Таймс», 16 апреля 1917 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Герр Карл Рознер, корреспондент берлинской газеты Lokalanzeiger на западном фронте… опубликовал в прошлый вторник первое достоверное немецкое признание относительно того, как немцы используют мертвые тела</p>\n</blockquote>\n<blockquote>\n<p>»пройти через Эверингкорт. В воздухе витает тусклый запах, как будто горит известь. Мы проезжаем большое предприятие по эксплуатации трупов (Kadaververwertungsanstalt) этой группы армий. Добываемый здесь жир превращается в смазочные масла, а все остальное перемалывается на костяной мельнице в порошок, который используется для смешивания с кормом для свиней и в качестве навоза --- ничто не должно пропадать зря\". \"Таймс\", 16 апреля 1917 г.</p>\n</blockquote>\n<p> В \"Таймс\" от 17 апреля 1917 г. Был опубликован отчет из \"Ла Бельжик\" (Лейден) через \"Л'Индепенданс Бельж\" за 10 апреля, в котором давался очень длинный и подробный отчет о Фабрика Deutsche Abfallverwertungs-gesellschaft недалеко от Кобленца, куда прибывают поезда с раздетыми телами немецких солдат, связанными проволокой в ​​жгуты, и кипятятся в котлах, в результате чего получаются стеарин и рафинированное масло</p>\n<p> . Было письмо от С. Э. Банбери с комментариями и предложением использовать эту историю в пропагандистских целях в нейтральных странах и на Востоке, где она особенно рассчитана на то, чтобы напугать буддистов, индуистов и мусульман. Он предложил транслировать министерство иностранных дел, министерство Индии и Колониальный офисе; были и другие письма того же содержания от 18 апреля.</p>\n<p> В «Таймс» от 20 апреля 1917 года сержант Б. Из рода Кентов рассказал историю о том, как один заключенный рассказал ему, что немцы варят своих мертвецов на боеприпасы и пищу для свиней и домашней птицы. Этот парень сказал мне, что Фриц называет свой маргарин «трупным жиром», потому что они подозревают, что он происходит из него.</p>\n<p> «Таймс» заявила, что получила ряд писем, «ставящих под сомнение перевод немецкого слова Kadaver и предполагающих, что оно не используется по отношению к человеческим телам. Животные». Другие письма, подтверждающие эту историю, были получены из бельгийских и голландских источников (позже из Румынии).</p>\n<p> В «Ланцете» была статья, в которой обсуждался «деловой аспект» (точнее, технический) отрасли. Выражение ужаса появилось у китайского посланника в Лондоне, а также у махараджи Биканира в «Таймс» от 21 апреля 1917</p>\n<p> года\"и что Кадавер никогда не используется в человеческом теле. The Times приводит словарные цитаты, чтобы показать, что это так. Кроме того, и Tierkörpermehl, и Kadavermehl фигурируют в официальных каталогах Германии, что подразумевает, что они должны быть чем-то другим.</p>\n<p> В «Таймс» от 24 апреля 1917 г. Было опубликовано письмо, подписанное Э. Г. Паркером, с приложением копии «Северокитайского вестника» от 3 марта 1917 г., в котором рассказывалось об интервью между немецким посланником и китайским премьером в Пекине:</p>\n<blockquote>\n<p>«Но дело было в том, что замкнулся, когда адмирал фон Хинке подробно рассказывал об изобретательных методах, с помощью которых немецкие ученые получали химические вещества, необходимые для производства боеприпасов. Адмирал торжествующе заявил, что они извлекают глицерин из своих мертвых солдат! пользы для Германии, и убедить его выступить против нее стало сравнительно легко».</p>\n</blockquote>\n<p> Следующие вопросы в парламенте показывают, что правительство уклоняется от ответа, хотя оно и знало, что в отчете нет ни крупицы достоверных доказательств — хороший пример официального метода распространения лжи.</p>\n<blockquote>\n<p>Г-н Рональд Макнейл спросил премьер-министра, «предпримет ли он шаги, чтобы как можно шире распространить информацию в Египте, Индии и на Востоке в целом о том, что немцы используют трупы своих солдат и своих врагов, когда они получают владение ими, как пищу для свиней».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Диллон спросил канцлера казначейства, «было ли обращено его внимание на широко распространенные в этой стране сообщения о том, что правительство Германии построило фабрики по извлечению жира из тел солдат, погибших в бою; были ли эти сообщения подтверждены многими видными деятелями этой страны, в том числе лордом Керзоном из Кедлстона; есть ли у правительства какие-либо веские основания полагать, что эти заявления являются вполне обоснованными; и если да, то сообщит ли он информацию, имеющуюся в распоряжении правительства, в Палату .\"</p>\n</blockquote>\n<blockquote>\n<p>Лорд Р. Сесил: «Что касается этого вопроса и статуса достопочтенного члена от Восточного Мейо, у правительства в настоящее время нет никакой информации, кроме той, которая содержится в выдержках из немецкой прессы, которые были опубликованы в прессе здесь. ... Ввиду других действий немецких военных властей, в нынешнем обвинении против них нет ничего невероятного. Правительство Его Величества разрешило распространение фактов в том виде, в каком они появились, по обычным каналам».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Макнейл: «Может ли достопочтенный джентльмен ответить, предпримет ли правительство какие-либо шаги, чтобы широко огласить на Востоке эту историю, исходящую из немецких источников?»</p>\n</blockquote>\n<blockquote>\n<p>Лорд Р. Сесил: «Я думаю, что в настоящее время нежелательно предпринимать какие-либо другие шаги, кроме тех, которые были предприняты».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Диллон: «Могу ли я спросить, должны ли мы заключить из этого ответа, что у правительства нет каких-либо веских доказательств, подтверждающих истинность этого обвинения, и что они не предприняли никаких шагов для его расследования; и было ли обращено их внимание на тот факт, что это не только вопиющий скандал, но и очень большое зло для нашей страны, позволяющее распространять такие заявления, санкционированные министрами Короны, если они, как я считаю, абсолютно ложны?</p>\n</blockquote>\n<blockquote>\n<p>Лорд Р. Сесил: «У достопочтенного члена, возможно, есть информация, которой нет у нас. Я могу говорить только на основании заявлений, опубликованных в прессе. Я уже сказал Палате, что у нас нет никакой другой информации. Это заявление, которое было опубликовано и которое находится передо мной (цитирую \"Таймс\" цитату из \"Локаланцайгера\"). Это заявление было опубликовано в прессе, и это вся информация, которой я располагаю. \"</p>\n</blockquote>\n<blockquote>\n<p>Г-н Диллон: «Обращено ли внимание благородного лорда к тому факту, что в «Франкфуртер цайтунг» и других ведущих немецких газетах были опубликованы описания всего этого процесса, в которых используется слово «Кадавер» и откуда оно взято? совершенно очевидно, что эти фабрики предназначены для вываривания трупов лошадей и других животных, лежащих на поле боя (достопочтенный член: «Человеческие животные!») - и я спрашиваю достопочтенного джентльмена. Намерено ли правительство предпринять какие-либо шаги для получения достоверной информации, является ли эта история, которая была распространена, правдой или абсолютно ложной. К чести человеческой натуры, он должен это сделать».</p>\n</blockquote>\n<blockquote>\n<p>Лорд Р. Сесил: «Правительство не входит в обязанности правительства, и правительство не может проводить расследования относительно того, что происходит в Германии. А что касается его цитат из «Франкфуртер цайтунг», то я их не видел, но я видел заявления, сделанные германским правительством после публикации этого, и признаюсь, что не могу придать большого значения заявлениям, сделанным германского правительства».</p>\n</blockquote>\n<blockquote>\n<p>Мистер Диллон: «Я прошу спросить достопочтенного джентльмена, не должен ли он, прежде чем министр короны, член военного кабинета, дать разрешение на эти слухи, получить точную информацию о том, правдивы ли они. Или нет.\"</p>\n</blockquote>\n<blockquote>\n<p>Лорд Р. Сесил: «Я думаю, что любой министр Короны имеет право комментировать и ссылаться на то, что было опубликовано в одной из ведущих газет страны. Он только намеревался сделать это и не брал на себя ответственность за заявление (достопочтенный член: «Он сделал!»). Мне сообщили, что он этого не сделал. Он сказал: «Как было заявлено в газетах»</p>\n</blockquote>\n<blockquote>\n<p>. Что распространение этих сообщений (прерывание) вызвало беспокойство и страдание у британцев, которые потеряли своих сыновей на поле боя и которые думают, что их тела могут быть использованы для этой цели, и не дает ли это причины, почему он должен попытаться узнать правду о том, что происходит в Германии?» (Палата общин, 30 апреля 1917 г.).</p>\n</blockquote>\n<p> В «Таймс» от 3 мая 1917 г. Были цитаты из «Франкфуртер цайтунг» о том, что французская пресса в настоящее время рассматривает дело Кадавера «Недоразумением». «</p>\n<p> от 17 мая 107 г. Сообщила, что n Рейхстаге, что использовались человеческие тела; и заявил, что история впервые появилась во французской прессе.</p>\n<p> Отвечая на вопрос в Палате общин от 23 мая, г-н А. Чемберлен заявил, что отчет будет «доступен для общественности в Индии по обычным каналам».</p>\n<p>Мультфильм о фабрике трупов появился в <em>Punch</em>.</p>\n<blockquote>\n<p>Кайзер (новобранцу 1917 г.): «И не забывайте, что ваш кайзер найдет вам применение живым или мертвым». (На вражеском предприятии по утилизации трупов трупы немецких солдат обрабатываются химическим способом, главными товарными продуктами являются смазочные масла и корм для свиней.)</p>\n</blockquote>\n<p> Вид из окна на трупофабрику.</p>\n<p> Рассказ имел мировое распространение и имел большое пропагандистское значение на Востоке. Только в 1925 году правда всплыла наружу.</p>\n<blockquote>\n<p>«Тяжелое впечатление произвела здесь злополучная речь бригадного генерала Чартериса на обеде в Национальном клубе искусств, в которой он якобы рассказал правдивую историю военного времени о том, что Германия вываривает тела своих убитых солдат, чтобы получить жиры для боеприпасов и удобрений</p>\n</blockquote>\n<blockquote>\n<p>». По словам генерала Чартериса, история началась как пропаганда Китая. Перенеся подпись с одной из двух фотографий, найденных на пленных немцах, на другую, он создал впечатление, что немцы ужасным образом распорядились своими мертвыми солдатами. Эту фотографию он отправил в китайскую газету в Шанхае. Он рассказал известную историю о ее более позднем переиздании в Англии и о возникших там дискуссиях. Он также рассказал, как, когда ему был задан вопрос, заданный в палате, он ответил на него, сказав, что, исходя из того, что он знает о немецком менталитете, он готов ко всему.</p>\n</blockquote>\n<blockquote>\n<p>«Позже, — сказал генерал Чартерис, — чтобы подтвердить эту историю, в его кабинете было подделано то, что якобы было дневником немецкого солдата. Дневники, но план так и не был осуществлен. Дневник теперь находился в военном музее в Лондоне». («Таймс», 22 октября 1925 г. От корреспондента в Нью-Йорке.)</p>\n</blockquote>\n<p> Можно привести некоторые мнения политиков.</p>\n<blockquote>\n<p>Ллойд Джордж: «Эта история привлекла мое внимание в то время по-разному. Я не поверил ей тогда и не верю сейчас. Факт, «отклоненный» этим отделом».</p>\n</blockquote>\n<blockquote>\n<p>Г-н Мастерман: «Мы, конечно, не считали эту историю правдой, и я не знаю никого из официальных лиц в то время, кто верил бы в нее. Ничего столь подозрительного, как это, не использовалось в нашей пропаганде. Только такая информация, которая была должным образом проверена. Был распространен».</p>\n</blockquote>\n<blockquote>\n<p>Г-н И. Макферсон: «В то время я был в военном министерстве. У нас не было причин сомневаться в подлинности этой истории, когда она появилась. У меня сложилось впечатление, что министерство иностранных дел также подкрепляло его на основании выдержек из немецкой прессы. Она никоим образом не использовалась бы нами».</p>\n</blockquote>\n<p> Нью-йоркский корреспондент описывает, как он позвонил генералу Чартерису, осведомился о достоверности доклада и предложил, если он не соответствует действительности, сообщить об этом в «Нью-Йорк Таймс». На это он решительно возразил, что не может и подумать о том, чтобы оспорить отчет, так как ошибки имеют лишь второстепенное значение. («Daily News», 5 ноября 1925 г.)</p>\n<p> В «Таймс» была статья по тому же вопросу, в которой цитировалось утверждение «Нью-Йорк Таймс» об истинности их версии речи.</p>\n<blockquote>\n<p>«В этой статье делается важное замечание, что в ходе своего опровержения он не прокомментировал заявленное им признание в том, что он избегал говорить правду, когда его допрашивали по этому поводу в Палате общин, или свое собственное описание схемы поддержки \"Фабрика трупов\", \"подложив\" поддельный дневник в одежду мертвого немецкого военнопленного - предложение, от которого он отказался только из опасения, что обман может быть раскрыт</p>\n</blockquote>\n<blockquote>\n<p>. Вчера в военном министерстве и имел интервью с военным министром (сэр Ламинг Уортингтон-Эванс) по поводу отчетов о его выступлении о военной пропаганде в Нью-Йорке. Понятно, что военное министерство в настоящее время считает инцидент исчерпанным и что дальнейшее расследование, вероятно, не будет проводиться.</p>\n</blockquote>\n<blockquote>\n<p>«Генерал Чартерис в тот же день вылетел в Шотландию и по прибытии в Глазго сделал следующее заявление:</p>\n</blockquote>\n<blockquote>\n<p>«По прибытии в Шотландию я был удивлен, обнаружив, что, несмотря на опровержение, сделанное мной в Нью-Йорке через агентство Рейтера, некоторые по-прежнему вызывал интерес совершенно неверный отчет о моих выступлениях на частном обеде в Нью-Йорке. Поэтому я считаю необходимым еще раз дать категорическое опровержение приписываемого мне утверждения. Некоторые предположения и предположения относительно происхождения истории «Кадавера», которые уже были опубликованы в «Эти богатые событиями годы» (British Encyclopaedia Press) и в других местах, которые я повторил, несомненно, непреднамеренно, но тем не менее, к сожалению, превратились в определенные утверждения о фактах и ​​приписываемые мне.</p>\n</blockquote>\n<blockquote>\n<p>«Чтобы не оставалось никаких сомнений, позвольте мне сказать, что я не выдумывал историю Кадавера, не менял подписи ни к каким фотографиям и не использовал фальшивые материалы в пропагандистских целях. Утверждения о том, что я это сделал, не только неверны. Но это абсурд, поскольку пропаганда никоим образом не велась в штаб-квартире во Франции, где я руководил разведывательными службами. Мне должно быть так же интересно, как и широкой публике, узнать, каково было истинное происхождение истории о Кадавере. Ставка во Франции появилась только тогда, когда был представлен фиктивный дневник, подтверждающий историю Кадавера. Когда выяснилось, что этот дневник фиктивен, он был немедленно отвергнут.</p>\n</blockquote>\n<blockquote>\n<p>«Сегодня утром я виделся с государственным секретарем и объяснил ему все обстоятельства, и он имеет право сказать, что он полностью удовлетворен». («Таймс», 4 ноября 1925 г.).</p>\n</blockquote>\n<blockquote>\n<p>Лейтенант-коммандер Кенуорти спросил государственного секретаря по военным делам, если, принимая во внимание чувство, вызванное в Германии повторением слухов о так называемом трупе conversio Находясь на фабрике в тылу немцев в конце войны, он может дать любую информацию об источнике первоначальных слухов и о том, в какой степени они были восприняты военным министерством в то время.</p>\n</blockquote>\n<blockquote>\n<p>Сэр Л. Уортингтон-Эванс: «Я не думаю, что на таком отрезке времени можно с уверенностью проследить источник слухов. Заявление о том, что немцы построили фабрику по переработке трупов, впервые появилось в апреле 10 1917 года в \"Lokalanzeiger\", издаваемой в Берлине, и в \"L'Independance Belge\" и \"La Belgique\", двух бельгийских газетах, издававшихся во Франции и Голландии. Заявления были воспроизведены здесь в прессе с примечанием, что это было первое немецкое признание.кроме</p>\n</blockquote>\n<blockquote>\n<p>30 апреля 1917 года в Палате общин были заданы вопросы, и заместитель государственного секретаря по иностранным делам ответил от имени правительства, что у него тогда не было никакой информации,содержится в выдержке из немецкой прессы. Но вскоре после этого приказ немецкой армии, содержавший инструкции по доставке трупов в учреждения, описанные в Lokalanzeiger, был захвачен во Франции и отправлен в военное министерство, которое после тщательного рассмотрения разрешило его опубликовать.</p>\n</blockquote>\n<blockquote>\n<p>«Условия этого приказа были таковы, что в сочетании со статьями в Lokalanzeiger и в двух бельгийских газетах, а также с ранее существовавшими слухами военное министерство представило подтверждающие доказательства этой истории. Доказательства того, что слово Kadaver использовалась для обозначения человеческих тел, а не только туш животных, встречалась в немецких словарях, анатомических и других трудах, а немецкое утверждение о том, что повесть распоряжается ссылкой на значение слова Kadaver, не принималось. Информации, имевшейся у них в то время, военное министерство, похоже, не видело причин не верить правдивости этой истории».</p>\n</blockquote>\n<blockquote>\n<p>Лейтенант-коммандер Кенуорти: «Я весьма признателен достопочтенному джентльмену за его очень полный ответ. Разве он не считает желательным, чтобы военное министерство наконец отреклось от этой истории и их нынешней веры в нее?»</p>\n</blockquote>\n<blockquote>\n<p>Сэр Л. Уортингтон-Эванс: Я не могу поверить, что дальнейшие вопросы по этой истории служат общественному интересу. Я предоставил Палате самую полную информацию, которой располагаю, в надежде, что достопочтенный. Члены будут удовлетворены тем, что я сказал. (Досточтимые члены: Послушайте, послушайте.)</p>\n</blockquote>\n<blockquote>\n<p>Капитан-лейтенант Кенуорти: «Разве достопочтенный джентльмен не считает желательным даже сейчас, наконец, признать неточность первоначальной истории ввиду Локарно и других вещей?»</p>\n</blockquote>\n<blockquote>\n<p>Сэр Л. Уортингтон-Эванс: «Вопрос не в том, были ли они точными или неточными. Меня интересовала информация, на основании которой в то время действовало военное министерство. Поскольку неизбежно меняет характер дела, но я имел дело с информацией, имевшейся в то время у властей».</p>\n</blockquote>\n<blockquote>\n<p>(Палата общин, 24 ноября 1925 г.)</p>\n</blockquote>\n<p> Это была постоянная попытка избежать полного опровержения, и сэру Остену Чемберлену было предоставлено право окончательно пригвоздить ложь к прилавку. В ответ г-ну Артуру Хендерсону 2 декабря 1925 г. На вопрос, может ли он сделать какое-либо заявление по поводу истории Кадавера, он сказал:</p>\n<blockquote>\n<p>«Да, сэр; мой достопочтенный друг, военный министр, в последний раз неделю, как эта история дошла до правительства Его Величества в 1917 г. Канцлер германского рейха уполномочил меня заявить от имени германского правительства, что для этого никогда не было никакого основания. Вряд ли мне нужно добавлять, что от имени Его Величества Правительство, я принимаю это опровержение и надеюсь, что это ложное сообщение больше не будет восстановлено».</p>\n</blockquote>\n<p> Тяжелое впечатление, произведенное этим эпизодом и подобными пропагандистскими усилиями в Америке, хорошо иллюстрирует редакционная статья в газете Times-Dispatch из Ричмонда, США, от 6 декабря 1925 года.</p>\n<blockquote>\n<p>«Не последним из ужасов современной войны является бюро пропаганды, который является важным пунктом в военном строе каждой нации. И это не последний из многих обнадеживающих признаков, которые с каждым годом увеличивают вероятность окончательного мира на земле. Знаменитая история Кадавера, которая довела до кипения точка в этой и других странах-союзниках во время войны, была осуждена как ложь в британской палате общин. Несколько месяцев назад мир узнал подробности того, как эта ложь была спланирована и передана в эфир эффективным офицером британской разведывательной службы. Теперь нам говорят, что, проникнувшись духом Локарнского пакта, сэр Остин Чемберлен поднялся в палате и сказал, что канцлер Германии отрицал правдивость этой истории и что это отрицание было принят британским правительством.</p>\n</blockquote>\n<blockquote>\n<p>«Несколько лет назад история о том, как кайзер превращал человеческие трупы в жир, вызвала у граждан этой и других просвещенных наций ярость ненависти. Обычно здравомыслящие люди сжимали кулаки и бросались к ближайшему сержанту-вербовщику. В сущности, им говорили, что они простофили и дураки, что их собственные офицеры преднамеренно доводили их до желаемой точки кипения, используя гнусную ложь, чтобы возбудить их, как взрослый хулиган шепчет одному маленькому мальчику, что другой маленький мальчик сказал он мог бы лизнуть его.</p>\n</blockquote>\n<blockquote>\n<p>«Обнадеживающим признаком, обнаруженным в этом отвратительном признании того, как ведется современная война, является естественный вывод о том, что современный человек не слишком рвется броситься в горло своему брату по простому слову команды. На его страстях нужно играть, поэтому бюро пропаганды заняло свое место в качестве одного из главных орудий.</p>\n</blockquote>\n<blockquote>\n<p>«В следующей войне пропаганда должна быть более изощренной и умной, чем лучшее, что произвела мировая война. Эти откровенные признания в массовой лжи со стороны доверенных правительств во время последней войны не скоро будут забыты».</p>\n</blockquote>\n<p> Глава XVIII. Письмо епископа Занзибара</p>\n<p> Есть две вещи, которые нельзя допустить во время войны. Во-первых, благоприятный отзыв о враге — примеры этого были приведены во Введении. Во-вторых, критика страны, к которой вы принадлежите, не может быть публично выражена. Подавление такого рода мнений — это очень хорошо, но преднамеренное искажение их есть особенно злонамеренная форма лжи.</p>\n<p> Покойный д-р Уэстон, епископ Занзибара, великий защитник африканских аборигенов, написал открытое письмо генералу Смэтсу, в котором он сказал:</p>\n<blockquote>\n<p>«Это политическое безумие в это время суток пытаться подвергнуть более слабых людей рабству».-третьих, это настолько определенно антихристианская политика, что никто, принявший ее, не может более оправдывать Евангелие Христа перед африканскими народами...»</p>\n</blockquote>\n<p> ВВ брошюре, процитированной в Church Times от 8 октября 1920 года, епископ Занзибара писал:</p>\n<blockquote>\n<p>«Когда я написал свое открытое письмо генералу Смэтсу, я назвал его «Клочок бумаги Великобритании: будет ли она соблюдать его?» Я имел в виду ее обещание справедливости для более слабых народов. Имперское правительство взяло мое письмо, вырезало несколько неудобных мест и опубликовало его под заголовком «Черные рабы Пруссии». Я предполагаю, что восточноафриканцы теперь стали «черными крепостными Великобритании</p>\n</blockquote>\n<p> »рабы.\"</p>\n<p> Это хороший пример совершенно преднамеренного искажения со стороны правительства, а также пример того, как трудно правде, даже когда она опубликована, опередить ложь и достичь наиболее заинтересованных людей.</p>\n<p> Глава девятнадцатая. Возмущение немецких подводных лодок</p>\n<p> В июле 1918 года в прессе была распространена чудовищная история о дьявольской жестокости со стороны командира немецкой подводной лодки. Готовы сознательно выдумать или разработать какой-нибудь смутный слух и придать ему печать достоверной информации.</p>\n<p> Оно появилось во всех газетах в более или менее одинаковой форме:</p>\n<blockquote>\n<p>«Казначей Коллингвуд Хьюз, RNVR, отдела военно-морской разведки Адмиралтейства, читавший вчера лекцию в Королевском клубе на Сент-Джеймс-сквер, сказал, что один из наших патрулей лодки в Атлантике нашли заброшенную подводную лодку. После спасения экипажа наш командир осведомился у гуннского капитана, все ли в безопасности на борту, так как предполагалось взорвать подводную лодку.</p>\n</blockquote>\n<blockquote>\n<p>«Да, — последовал ответ, — они здесь. Ответили все немцы. Британский командир уже собирался оттолкнуться, прежде чем сбросить глубинную бомбу, когда послышался стук.</p>\n</blockquote>\n<blockquote>\n<p>«Вы совершенно уверены, что на борту вашей лодки никого нет?» — повторил он</p>\n</blockquote>\n<blockquote>\n<p>. - заявил гуннский капитан.</p>\n</blockquote>\n<blockquote>\n<p>Но прослушивание продолжалось, и английский офицер приказал обыскать подводную лодку. В ней были обнаружены, связанные как пленные, четыре британских моряка. Спасенные немцы собирались позволить утопить своих пленных (\"Daily Mail\", 12 июля 1918 г.)</p>\n</blockquote>\n<p> Эта история была повторена коммандером сэром Эдвардом Николлом на публичном собрании в Колстон-Холле в Бристоле, на котором присутствовал парламентский секретарь Адмиралтейства.</p>\n<blockquote>\n<p>Полковник Веджвуд спросил Первого лорда Адмиралтейство «То ли один из наших патрульных катеров недавно спас экипаж заброшенной подводной лодки, капитан которой умышленно оставил на борту четырех британских моряков, которые утонули бы, если бы их стук не был услышан и их не спасли; и если это так, то какие шаги были предприняты, чтобы иметь дело с капитаном подводной лодки»</p>\n</blockquote>\n<blockquote>\n<p>. Парламентский секретарь Адмиралтейства (доктор Макнамара): «Адмиралтейство официально заявило в публичной прессе, что они ничего не знают об этом известном инциденте и что заявление было сделано без их разрешения».</p>\n</blockquote>\n<blockquote>\n<p>Полковник Веджвуд: «Должны ли мы понимать, что это заявление абсолютно не основано на фактах и ​​фактически является ложью?»</p>\n</blockquote>\n<blockquote>\n<p>Д-р Макнамара: «У нас есть заявил, что у нас нет информации, подтверждающей сделанное заявление». (Палата общин, 15 июля 1918 г.)</p>\n</blockquote>\n<p> В ответ на последующие вопросы доктор Макнамара заявил, что он связывается с офицером, ответственным за это заявление</p>\n<blockquote>\n<p>. Веджвуд спросил Первого Лорда Адмиралтейства, «была ли уже сообщена история о заброшенной подводной лодке, и если да, то к какому выводу мы пришли; и была ли эта история впервые рассказана военно-морским офицером на встрече в Колстон-холле около пяти недель назад, на которой присутствовал сам парламентский секретарь».</p>\n</blockquote>\n<blockquote>\n<p>Доктор Макнамара «Мы попытались проследить эту историю до ее происхождения. Судя по всему, казначей флота Коллингвуд Хьюз слышал об этом из нескольких источников. Он, безусловно, должен был воспользоваться случаем, предоставленным ему в его официальном положении, чтобы проверить это. На наш взгляд, история безосновательна. Что касается второй части вопроса, то командующий Королевским военно-морским резервом сэр Эдвард Николл, безусловно, рассказал эту историю в ходе выступления на встрече в Бристоле, на которой я присутствовал.историю, рассказанную им по этому поводу» (Палата общин, 23 июля 1918 г.).</p>\n</blockquote>\n<p> слышал, как и в других случаях, на одного человека, заметившего опровержение, приходилась тысяча тех, кто слышал только</p>\n<p> ложь.ГЛАВА XX - Константинополь</p>\n<p> Уклонения и утаивания, вызванные существованием Тайных договоров, охватывают слишком большую область, чтобы ее здесь рассматривать. Уклонение является более коварной формой лжи, чем преднамеренная ложь.Однако один момент, который представлял значительный интерес для народа Великобритании, может служить иллюстрацией. Он касался судьбы Константинополя.</p>\n<p> Вопрос, заданный в Палате общин в мае 30 декабря 1916 г., правильно ли заявление профессора Милюкова в Думе, что «нашей высшей целью в этой войне является овладение Константинополем, который должен принадлежать России всецело и без остатка», сэр Эдуард Грей ответил, что «это не «Необходимо или желательно делать официальные комментарии по поводу неофициальных заявлений», и, получив дальнейшие нажимы, добавил: «Уважаемый член просит сделать заявление, которое я не считаю желательным делать»</p>\n<p> . Секретарь был совершенно прав, уклоняясь от вопроса. Во-первых, мы не взяли Константинополя, а во-вторых, правительству должно было показаться сомнительным, будут ли британские солдаты и матросы с энтузиазмом жертвовать своими жизнями, чтобы отдать Константинополь России. Не совсем отгремела песня 1878 года:</p>\n<blockquote>\n<p>«С Медведем дрались прежде, с Медведем драться можно, Но Константинополя русским не достанется».</p>\n</blockquote>\n<p> Но 7 марта 1915 г., за год до того, как сэр Э. Грей дал этот ответ в парламенте, М. Сазонов телеграфировал русскому послу в Лондоне</p>\n<blockquote>\n<p>: окончательное согласие Великобритании на решение вопроса о проливах и Константинополе в соответствии с русскими желаниями».</p>\n</blockquote>\n<p> 2 декабря 1916 г. Г-н Трепов заявил в Думе:</p>\n<blockquote>\n<p>«Соглашение, заключенное нами в 1915 г. С Великобританией и Францией и к которому присоединилась Италия, установило самым определенным образом право России на Проливы и Константинополь. ...Я повторяю, что среди союзников твердо установлено абсолютное согласие по этому вопросу».</p>\n</blockquote>\n<p> 5 января 1918 г. (памфлет «Национальные цели войны» № 33) премьер-министр заявил, что мы не воюем, «чтобы лишить Турцию ее столицы». Он мог сказать это потому, что произошла русская революция.</p>\n<p> Уловками и увертками британское правительство стремилось скрыть правду от страны, потому что оно знало, насколько она будет непопулярна.</p>\n<p> Глава XXI. \"Лузитания\"</p>\n<p> Потопление \"Лузитании\" было ужасной трагедией и одним из самых ужасных примеров варварства современной войны, но, с точки зрения страданий и гибели людей, это не могло сравниться с многие другие эпизоды войны. Однако крайне важное политическое значение катастрофы придавало ей особую пропагандистскую ценность в разжигании народного негодования, особенно в Америке. Очевидно, здесь был необходимый рычаг, чтобы наконец втянуть Америку в войну. То, что Германия не должна была признать, что это было бы результатом таких действий с ее стороны, было одной из многих иллюстраций ее полной неспособности понять психологию других народов.</p>\n<p> С точки зрения пропаганды нужно было показать, что немцы взорвали беззащитное пассажирское судно под американским флагом, на борту которого находились только гражданские пассажиры и обычный груз. Это было представлено как нарушение международного права и акт пиратства. Неудачная попытка замалчивания одних всплывающих фактов естественным образом приводит к выводу, что другие попытки были успешными. Никакое расследование, подобное расследованию в Мерси, проводимое в военное время в отношении действий противника, не может при таких обстоятельствах считаться окончательным.</p>\n<p> Вся правда о гибели «Лузитании», вероятно, никогда не будет выяснена. Здесь можно рассмотреть четыре момента:</p>\n<blockquote>\n<p>(а) Была ли она вооружена.</p>\n</blockquote>\n<blockquote>\n<p>(b) Несет ли она канадские войска.</p>\n</blockquote>\n<blockquote>\n<p>(c) Были ли на борту боеприпасы.</p>\n</blockquote>\n<blockquote>\n<p>г) была ли выпущена в Германии медаль в память о гибели «Лузитании».</p>\n</blockquote>\n<p> (а) По этому пункту имел место конфликт доказательств.</p>\n<blockquote>\n<p>«Лузитания» была зарегистрирована как вспомогательный крейсер. Немцы заявили, что она несла спрятанные орудия. Это было категорически опровергнуто капитаном в ходе расследования. «У нее не было оружия нападения или защиты, а также оружия в масках». Поэтому лорд Мерси счел это обвинение ложным.</p>\n</blockquote>\n<p> б) То же самое можно сказать и об обвинении немцев в том, что она перевозила канадские войска.</p>\n<p> (c) Эти два опровержения были бы вполне приемлемы, если бы не тот факт, что сначала была предпринята попытка отрицания, а затем сокрытия того факта, что она несла боеприпасы.</p>\n<blockquote>\n<p>Столь же неверно и то, что «Лузитания» несла боеприпасы в свой последний рейс. (\"Daily Express\", 11 мая 1915 г.).</p>\n</blockquote>\n<blockquote>\n<p>В Америке возникла угроза исключения сенатора Лафоллета из Сената за то, что он заявил, что «Лузитания» перевозила боеприпасы. Но мистер Дадли Филд Мэлоун, сборщик в порту Нью-Йорка, подтвердил это обвинение.</p>\n</blockquote>\n<blockquote>\n<p>Д. Ф. Мэлоун сообщил, что «Лузитания» перевозила большое количество боеприпасов, предназначенных для британского правительства, в том числе 4200 ящиков патронов «Спрингфилд». Администрация Вильсона отказалась разрешить публикацию этого факта. Одним из основных обвинений, на которых основывалась попытка исключить Р. М. Лафоллета из Сената, было то, что он ложно заявил, что «Лузитания» перевозила боеприпасы, и обвинение сенатора было прекращено, когда г-н Мэлоун предложил свидетельствовать в его пользу. (<em>The Nation</em> (Нью-Йорк), 20 ноября 1920 г.)</p>\n</blockquote>\n<blockquote>\n<p>В конце концов было признано, что \"Лузитания\" перевозила 5400 ящиков боеприпасов. Капитан на дознании в Кинсейле сказал: «Был второй отчет, но, возможно, это был внутренний взрыв». Бригадир присяжных Квинстауна возразил, что не все жертвы утонули. «Я видел много тел, и люди были убиты, их разорвало на куски».</p>\n</blockquote>\n<blockquote>\n<p>Корабль затонул за восемнадцать минут, что унесло столько жизней. Немцы в своем ответе на американскую ноту сослались на этот пункт и заявили:</p>\n</blockquote>\n<blockquote>\n<p>«Невозможно решить, например, вопрос о том, была ли предоставлена ​​необходимая возможность пассажирам и экипажу для побега, пока не будет установлено, была ли или нет, «Лузитания» предоставила переборки и шлюпку по приказу Конференции «Титаник» для соответствующих чрезвычайных ситуаций в мирное время, и действительно ли боеприпасы или взрывчатые вещества, доставленные вопреки американским законам, ускорили затопление корабля, которого в противном случае можно было бы ожидать либо безопасно выйти из лодок или добраться до берега».</p>\n</blockquote>\n<blockquote>\n<p>В ее груз входила небольшая партия винтовочных боеприпасов и осколочных снарядов весом около 173 тонн. Предупреждения о том, что судно будет потоплено, впоследствии отследившиеся до правительства Германии, были распространены в Нью-Йорке перед отплытием. («<em> Мировой кризис </em>», достопочтенный Уинстон Черчилль, член парламента).</p>\n</blockquote>\n<p> (d) Событие было осуждено как варварский акт пиратства, и стало необходимо показать, что немцы упивались им.</p>\n<blockquote>\n<p>Первый слух состоял в том, что команде подводной лодки, потопившей «Лузитанию», в награду за храбрость была вручена особая медаль. От этого отказались, когда медаль оказалась памятной, а не наградой.</p>\n</blockquote>\n<blockquote>\n<p>Затем было заявлено, что правительство Германии отчеканило медаль в ознаменование этого события, но после перемирия она была изъята из обращения. В 1919 году он был найден в магазине в Берлине. В 1920 году путешественник в Берлине, Франкфурте и других частях Германии не мог найти никого, кто когда-либо слышал об этом или видел его, тогда как в Англии медали были хорошо известны и их было очень легко получить. Выяснилось, что медаль изначально была разработана в Мюнхене человеком по имени Гетц и изображает Лузитанию с оружием. Гетца можно назвать карикатуристом в металле; его работа не была официальной, и его медаль <em> Lusitania </em> имела очень ограниченный тираж. Кажется, немногие немцы слышали о его существовании., объяснялось лордом Ньютоном, который в 1916 году отвечал за пропаганду в министерстве иностранных дел.</p>\n</blockquote>\n<blockquote>\n<p>пенсы хранить, если они могли бы заняться воспроизведением его в пропагандистских целях. Они согласились сделать это, и медали были проданы по всему миру в нейтральных странах, особенно в Америке и Южной Америке.</p>\n</blockquote>\n<blockquote>\n<p>«После некоторых первоначальных трудностей был достигнут большой успех. Я считаю, что это был один из лучших образцов пропаганды» («Evening Standard», 1 ноября 1926 г.).</p>\n</blockquote>\n<blockquote>\n<p>Почетный секретарь Комитета по медалям заявил, что было продано 250 000 медалей, а вырученные средства были переданы Красный Крест и Св. Дунстана. Каждая медаль была вложена в коробку, на которой было указано, что медали являются копиями или медалью, распространенной в Германии «в память о затоплении Лузитании». Без коробки.</p>\n</blockquote>\n<blockquote>\n<p>В дополнение к медали были распространены листовки с изображениями медали. В одном случае в Швеции было напечатано предложение из <em>Kölnische Völkzeitung</em>: «Мы с радостной гордостью относимся к этому новейшему подвигу нашего флота». Была вырвана из контекста и изначально использовалась совсем в другом значении</p>\n</blockquote>\n<blockquote>\n<p>, поэтому стало ясно, что:</p>\n</blockquote>\n<blockquote>\n<p>(1) Экипаж немецкой подводной лодки</p>\n</blockquote>\n<blockquote>\n<p>не был награжден медалью (2) В память об этом событии не было отчеканено никакой медали. Правительством Германии.</p>\n</blockquote>\n<blockquote>\n<p>(3) Ge Римское правительство не могло отозвать медаль, которую оно никогда не выпускало.</p>\n</blockquote>\n<blockquote>\n<p>(4) Мастер по металлу из Мюнхена разработал медаль, которая всегда была редкостью в Германии.</p>\n</blockquote>\n<blockquote>\n<p>(5) Большое количество медалей в обращении было связано с воспроизведением медали Гетца в Великобритании.</p>\n</blockquote>\n<blockquote>\n<p>Как признал лорд Ньютон, пропагандистское значение медали было велико. Впечатление, которое оно создавало, было абсолютно и намеренно ложным.</p>\n</blockquote>\n<p> Глава XXII. Отчет о сорванной встрече.</p>\n<p> Было множество официальных подслушивающих, телефонных прослушивателей, вскрывателей писем и т.д. Нас здесь не интересует их деятельность. Но можно себе представить, какой большой урожай шпионских историй и «подлинных» историй они породили. Можно привести забавный пример чиновника, которого послали присутствовать и сообщить о собрании Союза демократического контроля, состоявшемся в Мемориальном зале в ноябре 1915 года. Майор Р. М. Маккей (горцы Аргайл и Сазерленд) был помощником проректора маршала, и отправил отчет, большая часть которого была зачитана в Палате общин мистером Теннантом, заместителем министра военного министерства, 7 декабря. Внимание было привлечено к митингу, поскольку его разогнали солдаты, добывшие поддельные билеты. Доклад помощника проректора был настолько фантастическим, что казалось, что он вообще не мог присутствовать на собрании. Но, разумеется, показания столь высокопоставленного чиновника были приняты как убедительные. Он обвинил г-на Рамзи Макдональда в том, что он спровоцировал солдат, отправив сообщение с требованием выгнать некоторых из них. В этом не было ни капли правды. Он сообщил, что кто-то, «чье имя я не смог установить», использовал провокационные выражения. Он описал стюардесс, «которые не только казались тевтонками, но и могли быть классифицированы как таковые по их акценту», чьи замечания он подслушал. Излишне говорить, что в здании не было ни тевтонца, ни кого-либо с тевтонским акцентом.</p>\n<p> В последующем случае, когда г-н Теннант попытался объяснить некоторые части отчета, который он зачитал, в «Вестминстерской газете» появился следующий комментарий:</p>\n<blockquote>\n<p>«Г-н Теннант объяснил, что его ответ со ссылками на стюардесс с «тевтонским акцентом» и его приписывание г-ну Рэмзи Макдональду слов, которые никогда не использовались, было наспех прочитано из доклада, сделанного ему. Министры вынуждены полагаться на такие отчеты, но формулировка должна быть серьезно отредактирована, прежде чем она будет представлена ​​в Палате общин. ... Если пренебречь этой предосторожностью, министры накопит для себя массу раздражения и негодования, которые совершенно не нужны».</p>\n</blockquote>\n<p> В 1917 г. Надежный провост-маршал был обвинен в неправомерном аресте. В мае 1918 г. Ему было предъявлено обвинение в «одалживании» солдат в качестве садовников и т.д. Его личным друзьям, нецелевом использовании государственных денег и т.д. Некоторые из многочисленных обвинений против него были сняты, но позже в том же году было объявлено, что он был «уволен со службы по приговору военного трибунала» (London Gazette Supplement, 12 августа 1918 г.).</p>\n<p> Выяснилось, что он был глухим в течение многих лет.</p>\n<p> Глава Xxiii. Истории</p>\n<p> о зверствах Война сама по себе является злодеянием. Ему присущи жестокость и страдание. Дела насилия и варварства случаются, как всем известно. Власть побуждает человечество потворствовать каждой элементарной животной страсти, но преувеличение и изобретение зверств вскоре становится основным продуктом пропаганды. Истории о немецкой «ужасности» в Бельгии распространялись в таких количествах, что давали достаточные доказательства отвратительной жестокости немецкой армии и, таким образом, приводили в ярость общественное мнение против них. Была назначена бельгийская комиссия, а затем комиссия под председательством лорда Брайса, избранного для того, чтобы произвести впечатление на мнение в Америке, где он был очень популярным послом. Показания отдельных свидетелей были приняты в качестве неопровержимого доказательства.</p>\n<p>В лучшем случае человеческое свидетельство ненадежно, даже в обычных случаях, не имеющих значения, но там, где предвзятость, сентиментальность, страсть и так называемый патриотизм мешают эмоциям, личное утверждение становится совершенно бесполезным.</p>\n<p> Охватить всю землю историями о зверствах было бы невозможно. Они распространялись в листовках, памфлетах, письмах и речах день за днем. Известные люди с хорошей репутацией, которые не побоялись бы осудить своего заклятого личного врага на основании имеющихся у них доказательств или, скорее, отсутствия доказательств, не колеблясь возглавили процесс обвинения целой нации во всех мыслимых жестокостях и противоестественных преступлениях. «Таймс» выпустила «Походные песни», написанные видным мастером из Итона, в которых встречались такие строчки:</p>\n<blockquote>\n<p>Он застрелил жен и детей, Жен и маленьких детей; Он расстреливал жен и детей И смеялся, глядя, как они умирают.</p>\n</blockquote>\n<p> Можно привести один-два случая доказанной ложности утверждений, сделанных людьми в состоянии возбуждения и возмущения.</p>\n<p> Сообщалось, что от тридцати до тридцати пяти немецких солдат вошли в дом возчика Дэвида Торденса в Земпсте; они связали его, а потом впятером или вшестером избили и изнасиловали в его присутствии его тринадцатилетнюю дочь, а потом накололи ее на штыки. После этого ужасного поступка его девятилетнего мальчика закололи штыком, а затем расстреляли его жену. Его жизнь была спасена благодаря своевременному прибытию бельгийских солдат. Далее утверждалось, что все девушки в Земпсте подверглись нападению и насилию со стороны немцев.</p>\n<p> Секретарь коммуны Пауль ван Бекпурт, мэр Петер ван Асбрук и его сын Луи ван Асбрук в заявлении под присягой, сделанном 4 апреля 1915 года в Семпсте, заявили, что имя, данное возчику, Дэвид Торденс, был совершенно неизвестен им; что такой человек не жил в Земпсте до войны и был совершенно неизвестен в коммуне; что во время войны в Земпсте не было убито ни женщины, ни ребенка до четырнадцати лет, и если бы такое происшествие имело место, они непременно бы узнали об этом.</p>\n<p> В другом опубликованном отчете говорилось, что в Тернате немцы встретили мальчика и спросили его, как добраться до Турта. Так как мальчик их не понял, ему отрубили обе руки. (Цитируется по книге «Правда: Путь к справедливости и примирению», автор «Веракс»).</p>\n<p> Заявление мэра Терната доктора Пудта от 11 февраля 1915 г.:</p>\n<blockquote>\n<p>«Я заявляю, что в нем нет ни слова правды. Я нахожусь в Тернате с начала войны, и невозможно, чтобы такое происшествие мне не должны были сообщать; это чистая выдумка».</p>\n</blockquote>\n<p> После публикации различных отчетов пять американских военных корреспондентов выступили со следующим заявлением:</p>\n<blockquote>\n<p>«Чтобы узнать правду, мы единодушно заявляем, что истории о немецких жестокостях, которые мы смогли наблюдать, не соответствуют действительности. Германской армии в течение двух недель и, сопровождая войска на протяжении более ста верст, мы не можем сообщить ни об одном случае незаслуженного наказания или меры возмездия, ни подтвердить слухи о жестоком обращении с пленными и несовершеннолетними. - Комбатанты.Проходя с немецкими войсками через Ланден, Брюссель, Нивель, Бюисьер, От-Виэри, Мерб-ле-Шато, Сорль-сюр-Самбр, Бомон, мы не имеем ни малейшего основания придумывать случай эксцессов. После расследования мы обнаружили, что многочисленные слухи были необоснованными. Немецкие солдаты везде платили за то, что они покупали, и уважали частную собственность и гражданские права. Мы обнаружили бельгийских женщин и детей после битвы при Б. Uissière, чтобы чувствовать себя в полной безопасности. В Мербес-ле-Шато был застрелен гражданин, но никто не смог доказать его невиновность. Беженцы, которые рассказывали о жестокостях и зверствах, не могли привести абсолютно никаких доказательств. Дисциплина немецких солдат превосходна; никакого пьянства. Бургомистр Сорль-сюр-Самбр добровольно опроверг все слухи о жестокостях в этом районе. За правдивость вышеизложенного мы даем честное слово как журналисты».</p>\n</blockquote>\n<blockquote>\n<p>(Подпись) Роджер Льюис, Associated Press; Ирвин Кобб, «Saturday Evening Post», Philadelphia Public Ledger,_ Филадельфия; Гарри Хансен, «Chicago Daily News», Чикаго; Джеймс, О'Доннел Беннетт, \"Чикаго трибьюн\", Джон Т. Маккатчен, \"Чикаго трибьюн\", Чикаго</p>\n</blockquote>\n<p> В номере \"Нью-Йорк уорлд\" от 28 января 1915 года появилась следующая заметка:</p>\n<blockquote>\n<p>\"Вашингтон, 27 января. О тысячах бельгийских беженцев находящихся сейчас в Англии, ни один не подвергся зверствам со стороны немецких солдат. Таково, по сути, содержание доклада, полученного в Государственном департаменте. В отчете говорится, что британское правительство расследовало тысячи сообщений о том, что немецкий солдат совершал бесчинства в отношении бегущих бельгийцев. В начальный период войны столбцы британских газет пестрели обвинениями. Агенты британского правительства, согласно отчету американского посольства в Лондоне, тщательно расследовали все эти обвинения; они опросили предполагаемых жертв и проверили все улики. В результате расследования министерство иностранных дел Великобритании уведомило американское посольство о том, что обвинения, по-видимому, основаны на истерии и естественных предубеждениях. В отчете добавлено, что многие бельгийцы пережили лишения, но их следует обвинять в жестокости войны, а не в жестокости отдельных немецких солдат»</p>\n</blockquote>\n<p> . 19, 1918, «Храбрые бельгийцы» барона К. Буттина, к которому барон де Броквиль, бельгийский военный министр, написал предисловие, восхваляя его правдивость и справедливость:</p>\n<blockquote>\n<p>«Работа дает свидетельства очевидцев о первых трех месяцах о вторжении в Бельгию, и состоит из отчетов, рассказанных различными людьми, которые внесли свою лепту в это необычайное сопротивление, — полковниками, майорами, армейскими капелланами, лейтенантами и т.д. Едва ли есть намек на этого «жупела»,, или безымянные или ненужные ужасы, описанные в отчете Комиссии Брайса».</p>\n</blockquote>\n<p> зверства подтверждается письмом, появившимся совсем недавно, 12 апреля 1927 года, в \"Ивнинг Стар\", Данидин, Новая Зеландия. Писатель, г-н Гордон Катто, отвечая другому корреспонденту на тему зверств, писал:</p>\n<blockquote>\n<p>«Моя жена, которая в 1914-1915 годах была медсестрой в Рамсгейтской больнице общего профиля, Англия, на самом деле ухаживала за бельгийскими женщинами и детьми-беженцами, которые были жертвами жадности и жестокости гуннов, у женщин отрезали груди, а у детей отрубали руки на запястьях».</p>\n</blockquote>\n<p> Здесь были почти непосредственные свидетельства с указанием времени и места. Соответственно, женщина-следователь направила запрос секретарю больницы общего профиля Рамсгейта, и был получен следующий ответ:</p>\n<blockquote>\n<p>«Больница общего профиля Рамсгейта, 4, Кэннон-роуд, Рамсгейт,</p>\n</blockquote>\n<blockquote>\n<p>11.6</p>\n</blockquote>\n<blockquote>\n<p>. Неизвестно, каким образом в отношении Рамсгейта могла возникнуть информация о зверствах, совершенных немецкими солдатами в отношении женщин и детей, поскольку таких случаев не поступало».</p>\n</blockquote>\n<blockquote>\n<p>«С уважением,</p>\n</blockquote>\n<blockquote>\n<p>(Подпись) Сидней В. Смит.»</p>\n</blockquote>\n<p> Пример человека, искренне введенного в заблуждение предоставленной ему информацией, не имеющего никакого желания распространять ложь, можно привести в случае с баптистским священником из Шеффилда, 28 февраля 1915 года, проповедуя в баптистской часовне Уош-Лейн, Летчфорд, Уоррингтон, он рассказал прихожанам, что в Шеффилде есть бельгийская девочка лет двенадцати, у которой отрезаны нос и живот. Растерзан немцами, но она все еще жила и поправлялась.</p>\n<p> На вопрос, делал ли он это заявление, он ответил:</p>\n<blockquote>\n<p>«Я написал нашему бельгийскому консулу здесь имя и адрес девушки, чье дело Я цитировал Летчфорд. Если все, что я слышу, правда, то все гораздо хуже, чем я говорил.</p>\n</blockquote>\n<blockquote>\n<p>«Я также прошу еще один подобный пример, который я буду рад передать вам, если и как только я смогу подтвердить факты».</p>\n</blockquote>\n<p> Бельгийский консул в письме от 11 марта писал:</p>\n<blockquote>\n<p>«Хотя я слышал о ряде случаев жестокого обращения с бельгийскими девушками тем или иным образом, я при расследовании не нашел ни крупицы правды ни в одном из них, и Я не знаю ни одной девушки в Шеффилде, у которой был бы отрезан нос и вспорот живот.</p>\n</blockquote>\n<blockquote>\n<p>\"Я также расследовал случаи в других городах, но пока не смог получить никаких осязаемых подтверждений\"</p>\n</blockquote>\n<p> . Министр соответственно сообщил своему корреспонденту:</p>\n<blockquote>\n<p>«Я пишу письмо в мою старую церковь в Летчфорде, которое будет прочитано в следующее воскресенье, противоречащее истории, которую я рассказал, опираясь на, казалось бы, безупречный авторитет. Я рад, что не привел всех предполагаемых фактов в том виде, в каком они были предоставлены мне.</p>\n</blockquote>\n<blockquote>\n<p>«Большое спасибо за ваше примечание и запрос».</p>\n</blockquote>\n<p> Однако следует опасаться, что его первая община, удовлетворившись подтверждением этой истории с кафедры, распространила ее вне досягаемости последующего опровержения.</p>\n<p> Истории о зверствах из иностранной прессы вряд ли можно было бы собрать в библиотеке. Беглый взгляд на любую иностранную газету покажет, что ни одна страница почти в номере не свободна от них. В Восточной Европе они были особенно ужасны. Они были почти общепринятой формой журналистского самовыражения со всех сторон. Огрубление европейского ума было проведено очень основательно. Но нравственное негодование и даже физическую тошноту сдерживали избыток ужасов и вопиющих преувеличений. В истории журналистики не может быть более позорного периода, чем четыре года Великой войны.</p>\n<p> Нейтральная газета (Nieuwe Courant)_, изданная в Гааге, резюмировала эффект пропаганды от 17 января 1916 г.:</p>\n<blockquote>\n<p>«…Бумажная военная пропаганда — это яд, который посторонние могут выдержать только в очень малых дозах. Воюющие стороны продолжают применять его эффект будет противоположен ожидаемому.Так что это идет с потоком литературы по делу Кавелла и разнообразными формами, в которых нам представлен яд Баралонг.Мы оставляем это с некоторым отвращением , попробовав его, и раздражаются только на горькое послевкусие - обещанные расправы...\"</p>\n</blockquote>\n<p> Глава Xxiv - Поддельные фотографии</p>\n<p> Для непосвященных в картине, явно сделанной с фотографии, есть что-то существенно достоверное. Казалось бы, нет ничего более достоверного, чем снимок. Никому не приходит в голову подвергать фотографии сомнению, и поэтому фальшивые фотографии имеют особую ценность, так как они дают гораздо лучший старт, чем простое утверждение, которое может быть подвергнуто критике или опровергнуто. Только много времени спустя, если вообще когда-нибудь, можно будет обнаружить их ложность. Во время войны фальсификация фотографий, должно быть, превратилась в целую индустрию. Все страны были обеспокоены, но французы были самыми опытными. Некоторые из оригиналов были собраны и воспроизведены: («Как устроено мировое безумие», Фердинанд Авенариус).</p>\n<p> Описание некоторых из них можно привести здесь:</p>\n<p> В «Das Echo» от 29 октября 1914 года была фотография немецких войск, марширующих по проселочной дороге в Бельгии. Это было воспроизведено Le Journal 21 ноября 1914 года под заголовком: \"Les Allemands En Retraite. Cette photography fournit une vision saississante de ce que fut la retraite de L'armée du général von Hindenburg après la bataille de la Vistule\".</p>\n<p> На фотографии, сделанной Карлом Делиусом из Берлина, запечатлена доставка мешков с почтой перед Полевой почтой в Кавеваре.</p>\n<p> Это было воспроизведено в «Дейли миррор» от 3 декабря 1915 года под заголовком: «Создано для стирки грязного белья гуннов». Не платите по счетам, ропщут и ропщут. Вот только что с стирки пришла куча».</p>\n<p> Несколько фотографий сделаны во время погрома в России в 1905 году; некоторые из них были распространены евреями в Америке. Одна из этих фотографий изображала ряд трупов с толпой вокруг них и была воспроизведена в «Мируаре» от 14 ноября 1915 года под заголовком</p>\n<p> «Les Crimes Des Hordes Allemandes En Pologne».</p>\n<p> Несколько других из них были аналогичным образом воспроизведены в газетах. «Критика», аргентинская газета, таким образом разоблачала немецкие зверства.</p>\n<p> Сделана фотография толпы перед королевским дворцом в Берлине 13 июля 1914 года (до начала войны). Это было воспроизведено в «Le Monde Illustré» от 21 августа 1915 года под заголовком: «Enthousiasme Et Joie De Barbares» с пояснением, что это была демонстрация в честь гибели «Лузитании».</p>\n<p> На фотографии, появившейся в берлинской газете «Tag» 13 августа 1914 года, была изображена длинная очередь мужчин с тазами. Под ним было написано: «Как мы относимся к интернированным русским и французам; выстраиваем интернированных перед раздачей еды». Это было воспроизведено в «Daily News» от 2 апреля 1915 года под заголовком: «Немецкие рабочие чувствуют себя в затруднительном положении. Вышеупомянутая толпа, выстраивающаяся в очередь за пайками, — обычное зрелище в Германии. Оно раскрывает один аспект нашей военно-морской мощи».</p>\n<p> Фотография немецких офицеров, осматривающих ящики с боеприпасами, была воспроизведена в «War Illustrated» от 30 января 1915 года как «немецкие офицеры, грабящие сундуки во французском замке».</p>\n<p> Фотография немецкого солдата, склонившегося над павшим немецким товарищем, была воспроизведена в \"War Illustrated\" от 17 апреля 1915 г. С заголовком: \"Неопровержимое доказательство злоупотребления гуннами правил ведения войны, немецкий упырь, действительно пойманный при ограблении русского .\"</p>\n<p> В _Berlin Lokalanzeiger от 9 июня 1914 года была опубликована фотография трех кавалерийских офицеров, завоевавших кубки и другие трофеи, которые они держат в руках на армейском беге с препятствиями в Грюнвальде. Это было впервые воспроизведено в русской газете «Весь мир» под заголовком «Немецкие мародеры в Варшаве», а также 8 августа 1915 года в «Daily Mirror» под заголовком: «Три немецких кавалериста, нагруженных золотом и серебром». .\"</p>\n<p> Поддельные фотографии, конечно же, в большом количестве рассылались в нейтральные страны.</p>\n<p> Немецкая фотография города Швирвиндт после русской оккупации была воспроизведена в Illustreret Familieblad_ (Дания) как \"Французский город после немецкой бомбардировки\".</p>\n<p> Фотография из «Das Leben in Bild» 1917 года, на которой изображены трое смеющихся молодых немецких солдат, была озаглавлена: «Снова дома. Трое крепких молодых немцев, которым удалось бежать из французского плена».</p>\n<p> Это было опубликовано в датской семейной газете 2 мая 1917 года:</p>\n<blockquote>\n<p>«Сбежали из ада барабанного огня. Трое немецких солдат, по-видимому, очень счастливы, что стали французскими военнопленными».</p>\n</blockquote>\n<p> Цитадель в Брест-Литовске была обстреляна отступающими русскими, а в «Цайтбилдере» от 5 сентября 1915 года появилась фотография, на которой немцы выносят кукурузу в мешках.</p>\n<p> Это было воспроизведено в «Графике» от 18 сентября 1915 года как «немецкие солдаты грабят завод в Брест-Литовске, который был обстрелян отступающими русскими».</p>\n<p> Illustrated War News, 29 декабря 1915 года, дал фотографию военных трофеев. Сержант держит что-то вроде девятихвостого хлыста. «Для чего он использовался? Немецкий кнут среди коллекции военных трофеев. Эти военные трофеи, захваченные у немцев во Фландрии, были подарены ирландским стрелкам сержантом. Наличие кнута имеет любопытное значение».</p>\n<p> «Нагайка», по сути, была обыкновенной немецкой ковровой выбивалкой.</p>\n<p> В российском фильме немецкие медсестры в одежде религиозных сестер закалывают раненых на поле боя.</p>\n<p> Картина, а не фотография, имевшая большой тираж, называлась «Chemin de la gloire» («Дорога славы») в серии «Choses Vues» («Увиденное»).</p>\n<p> На заднем плане — горящий собор, длинная дорога усыпана бутылками, а на переднем плане — тело маленького мальчика, приколотого к земле штыком.</p>\n<p> Но если бы пришлось описывать картинки и карикатуры, то этому не было бы конца. Несомненно, карикатурист имел большое влияние во всех странах, особенно на Raemakers и <em>Punch</em>. Несчастные нейтральные страны были засыпаны ими с обеих сторон.</p>\n<p> Замечательная серия фотографий была сделана г-ном Ф. Дж. Мортимером, членом Королевского фотографического общества, и опубликована в 1912 г. Они широко воспроизводились в иллюстрированных периодических изданиях. Среди них была фотография «Арден Крейга», затонувшего у островов Силли в январе 1911 года. 31 марта 1917 года популярный иллюстрированный еженедельник посвятил страницу «Камерным записям прусского пиратства», и именно эта фотография была воспроизведена в последовательность изображений, иллюстрирующих «винджаммер, торпедированный у берегов Англии преступно неразборчивыми пиратами-подводными лодками».</p>\n<p> Фотографии британских кораблей г-на Мортимера также были воспроизведены в Германии под заголовком «Сцены с немецкого флота».</p>\n<p> 28 сентября 1916 года в «Daily Sketch» ​​была опубликована фотография толпы немецких военнопленных под заголовком «Они еще идут!» «За последние сорок восемь часов было взято от 3000 до 4000 заключенных». (Официально.)</p>\n<p> 10 октября 1918 года «Daily Mirror» воспроизвела точно такую ​​же фотографию, под которой было напечатано: «Лишь очень небольшая часть уникальной коллекции союзников гуннских военнопленных сезона 1918 года».</p>\n<p> Глава XXV. Подделка официальных документов</p>\n<p> . Ложь в прессе и частная ложь при определенных обстоятельствах могут иметь большой вес. В то же время часто есть слои общества, которые менее доверчивы и, следовательно, более подозрительны. Но когда появляются печатные документы с официальным разрешением — в этой стране королевский герб и надпись «Представлено парламенту по распоряжению Его Величества» или «Напечатано по распоряжению Палаты общин» — все верят, что в этих бумагах во всяком случае, у них есть вся правда и ничего кроме правды. Изучает их, может быть, меньшинство, но это меньшинство пишет и снабжает печать бесспорно достоверными сведениями из «командных бумаг». Синие книги, желтые книги, белые книги, оранжевые книги и т.д. Становятся основой всей пропаганды.</p>\n<p> Поэтому для тех, кто патриотически воспринимает историю своего правительства, шокирует то, что в опубликованных официальных документах изобилуют случаи замалчивания в виде тщательно и преднамеренно замалчиваемых пассажей.</p>\n<p> Эта практика, конечно, возникла не во время Великой войны. Это старая дипломатическая традиция, оправданная, по-видимому, в тех случаях, когда сокрытие неблагоразумных выражений со стороны иностранного государственного деятеля может предотвратить раздражение общественного мнения, но доведенная до неоправданных пределов, когда целью является сокрытие или искажение фактов дела. В.</p>\n<p> Речь сэра Эдварда Грея от 3 августа была очень скудным и неполным изложением событий, происходивших перед Домом, который намеренно оставался в неведении в течение многих лет. Но это было хорошо оформлено, чтобы иметь желаемый эффект. Среди упущений было предложение немецкого посла от 1 августа, в котором он предположил, что Германия может быть готова гарантировать не только бельгийский нейтралитет, но также целостность Франции и ее колоний, а министр иностранных дел далее не упомянул, что в этом В ходе интервью он решительно отказался формулировать какие-либо условия, на которых можно было бы гарантировать нейтралитет страны, хотя посол просил его это сделать. Но, безусловно, самым серьезным упущением было то, что он не зачитал Палате представителей последнюю фразу в своем письме к М. Камбону, фразу жизненной важности. Предложение гласило:</p>\n<blockquote>\n<p>«Если бы эти меры подразумевали действие, планы Генерального штаба немедленно принимались бы во внимание, и тогда правительство решало бы, как следует их претворить в жизнь».</p>\n</blockquote>\n<p> Это упущение далеко не может быть удовлетворительно объяснено в «Двадцати пяти годах» небрежным утверждением: «Возможно, я счел последнее предложение неважным».</p>\n<p> Речи министров в других европейских правительствах, заинтересованных в то время, были, конечно, патриотически искажены, и любая информация относительно фактов, которые могли бы оправдать или смягчить беззаконие противоположной стороны, тщательно замалчивалась.</p>\n<p> Пропущенные депеши или изъятия отрывков из официальных книг всех заинтересованных правительств были слишком многочисленны, чтобы их даже можно было привести в виде списка.</p>\n<p> Некоторые из британских подавлений теперь очевидны после публикации Министерством иностранных дел дальнейших дипломатических документов. Достаточно привести пару примеров.</p>\n<p> В телеграмме нашего посла в Петербурге от 24 июля 1914 г. Был полностью изъят отрывок, в котором он указывал на соглашение, достигнутое между Францией и Россией во время визита президента, согласно которому они постановили не терпеть любое вмешательство Австрии во внутренние дела Сербии. В свете того, что происходило в Сербии, это имело большое значение.</p>\n<p> В «Белой книге» 1914 г. Появилась телеграмма французского правительства от 20 июля, в которой сообщалось, что «резервистов призвали в Германию десятками тысяч». Но телеграмма английского посла в Берлине от 1 августа о том, что призыв резервов еще не состоялся (404), была подавлена.</p>\n<p> В специальных официальных сообщениях нужно было придать необходимый военный уклон. Вот пример из одного из доминионов:</p>\n<blockquote>\n<p>«Единогласная резолюция была принята 29 июня 1926 г. Советом Юго-Западной Африки. Западной Африке просто как орудие войны и просил правительство уничтожить экземпляры книги, имеющиеся среди официальных документов или в книжных магазинах. В своем ответе премьер-министр Южной Африки генерал Герцог заявил, что он и его коллеги в Правительство могло оценить причины постановления Собора и что оно готово по возможности поддаться его пожеланиям, По его мнению, ненадежный и недостойный характер этого документа обрекает его на бесчестное погребение вместе со всеми родственными ему публикациями период войны». (Жалоба д-ра Шнее касалась африканских территорий. «Таймс», 16 мая 1927 г.).</p>\n</blockquote>\n<p> Французская «Желтая книга» представляла собой массу утаиваний, искажений и даже фальсификаций. Как французский писатель _(L'Évangile du Quai d'Orsay, Жорж Демарсьяль). Внимательно изучивший весь этот вопрос, пишет:</p>\n<blockquote>\n<p>«Правительство вырезает из Желтой книги все, что касалось русской мобилизации, как преступник стирает все следы своего преступления».</p>\n</blockquote>\n<p> Г-н Демарсьяль посвящает целый том различным способам подтасовки этих официальных документов с целью обмана французского народа и спрашивает: «Если французское правительство невиновно в отношении войны, то почему оно фальсифицировало собрание дипломатические документы, раскрывающие происхождение?»</p>\n<p> Были упущения и в немецкой официальной Белой книге, как, например, телеграмма царя, в которой он предлагал передать австро-сербский спор в арбитраж.</p>\n<p> Известным случаем фальсификации был доклад революционного правительства Курта Эйснера в Мюнхене в ноябре 1918 года, в котором предполагалось дать текст депеши баварского посланника из Берлина. В опубликованном виде этот отчет показал, что правительство Германии цинично рассматривает возможность взрыва мировой войны в результате предложенных Австрией принудительных мер против Сербии. Инцидент стал поводом для иска о клевете. Документ изучили 12 иностранных органов, и все они пришли к выводу о фальсификации. Французский профессор Сорбонны М. Эдуард Дюжарден заявил:</p>\n<blockquote>\n<p>«Я придерживаюсь мнения, что текст, опубликованный в «Bayerische Staatzeitung», является одной из самых явных и самых преступных фальсификаций, известных истории».</p>\n</blockquote>\n<p> Полный текст показал, что правительство Германии рассматривает не мировую войну, а локальную войну между Австрией и Сербией.</p>\n<p> Но что бы ни говорили о подавлении со стороны других правительств, ничто не сравнится с подделкой и подтасовкой русской оранжевой книги. Опущение не только пассажей, но и целого ряда важных телеграмм и депеш, проходивших между русским министром иностранных дел Сазоновым и русским послом в Париже Извольским, показывает решимость скрыть истинное отношение России и Франции во время критические дни и вставка этих засекреченных документов, которая впоследствии стала возможной, придает совсем иной оттенок истокам начала войны, чем тот, который был принят в то время. (Текст скрытых документов приведен в «Долге перед цивилизацией» Фрэнсиса Нильсона).</p>\n<p> Среди подавлений была телеграмма, в которой говорилось, что «Германия горячо желает локализации конфликта» (24 июля) — «Советы умеренности… Мы должны отвергнуть все это с самого начала»; телеграммы, свидетельствующие о стремлении германского посла к миру; телеграммы, свидетельствующие о воинственном духе Франции, и указание русским как можно быстрее продолжать приготовления (30-31 июля). «Французское правительство твердо приняло решение о войне и просило меня подтвердить надежду французского генерального штаба на то, что все наши усилия будут направлены против Германии и что с Австрией будут обращаться как с« количественным пренебрежением »». В некоторых случаях предложения были опущены. И во многих случаях вся телеграмма была скрыта.</p>\n<p> Государственные деятели всех стран, которых было бы глупо называть бесчестными людьми, с отвращением отшатнулись бы от фальсификации своей личной или деловой переписки. Если бы они поступили так, они были бы осуждены их собственными судами как преступники и осуждены общественным мнением. Тем не менее, действуя от имени своей страны, когда на карту поставлены вопросы такого огромного значения, они, не колеблясь, поддаются преднамеренной попытке ввести в заблуждение свой народ и мир и пытаются оправдать свою позицию, прибегая к самым подлым уловкам. .</p>\n<p> Глава XXVI. Лицемерное негодование</p>\n<p> Газовая война и подводная война представляли собой примеры яростных вспышек негодования со стороны прессы, которые, как показали события, были грубым лицемерием.</p>\n<p> Это отношение, а не выражение лжи.</p>\n<blockquote>\n<p>«Мы должны ожидать, что немцы будут сражаться, как дикари, освоившие химию». (\"Daily Express\", 27 апреля 1915 г.)</p>\n</blockquote>\n<blockquote>\n<p>\"Этот жестокий метод ведения войны... Это дьявольское изобретение... Преднамеренные и систематические попытки задушить и отравить наших солдат могут иметь лишь одно действие на британские народы и на все остальные -Немецкие народы земли. Это углубит наше негодование и нашу решимость, и это наполнит все расы ужасом перед немецким именем». («Таймс», 29 апреля 1915 г.).</p>\n</blockquote>\n<p> Но оказалось, что немцы не первыми применили отравляющий газ. Открытия г-на Тюрпена в области отравляющих взрывчатых веществ рекламировались во французской прессе еще до этой даты, а официальные инструкции французского военного министерства относительно использования ручных газовых гранат были изданы осенью 1914 г.</p>\n<p> В мае 1915 г. Полковник Мод писал в 'Земля и вода':</p>\n<blockquote>\n<p>«Все снаряды, все пожары, все минные заряды выделяют удушающие газы, а от некоторых снарядов пары ядовиты. Их использование обсуждалось годами, потому что взрывчатка, которая высвобождает смертоносный газ, Говорят, что они обладают довольно необычной силой, но причина, по которой многие из этих типов не были приняты на вооружение, заключалась в том, что они считались слишком опасными для наших артиллеристов, чтобы их можно было транспортировать и обращаться с ними, а не в том, что, когда они разрывались, они отравляли врага. Качество смертоносности отстаивалось на основании гуманности, так как смерть наносимая была бы абсолютно верной и безболезненной, а значит, и раненых не было бы, Во всяком случае, в начале этой войны было заявлено в во всех французских документах сообщалось, что трудности обращения с этими снарядами были преодолены и что они применялись на определенных участках французского фронта с замечательными результатами. Когда придет время защищать их использование, неужели у нас хватит наглости утверждать, что наши снаряды отравляют, но не удушают? Более того, разве отравление тоже не подпадает под действие Гаагской конвенции? В духе несомненно; но поскольку у меня нет под рукой текста, на который я мог бы сослаться, он может оставить лазейку в этом вопросе, через которую наши юристы</p>\n</blockquote>\n<p> -международники могли бы ускользнуть». Впоследствии, конечно, мы приняли газовую войну и усовершенствовали ее.</p>\n<blockquote>\n<p>Г-н Биллинг: это не факт... Что у нас лучший газ и лучшая защита, и что теперь гунны визжат?</p>\n</blockquote>\n<blockquote>\n<p>Мистер Бонар Лоу: Хотел бы я быть в этом так же уверен, как достопочтенный член (Палата общин, 25 февраля). , 1918 г.)</p>\n</blockquote>\n<blockquote>\n<p>Их (британские и французские) противогазы сегодня более эффективны, чем немецкие, их газ лучше и лучше используется («Daily Mail», 15 февраля 1918 г.)</p>\n</blockquote>\n<p> . В производстве отравляющего газа, и следующая статья г-на Эда Бервика, американца, показывает, до какого предела оно дошло до конца:</p>\n<blockquote>\n<p>«До окончания войны использовалось шестьдесят три различных вида отравляющего газа. , а в ноябре 1918 года наша служба химической войны (созданная в июне того же года) занималась шестьюдесятью пятью «крупными исследованиями». Проблемы», в том числе восемь газов, более смертоносных, чем любой из использовавшихся до того времени… Один вид сделал почву бесплодной на семь лет, а несколько капель на ствол дерева заставляют его «увядать за час». Наш арсенал в Эджвуде, штат Мэриленд, и его притоках производил 810 тонн в неделю против 385 тонн у Франции, 410 тонн у Британии и только 210 у Германии.</p>\n</blockquote>\n<blockquote>\n<p>«Он был почти готов увеличить свою производительность до 3000 тонн в неделю ... Конгресс выделил 100 000 000 долларов на эту службу химического оружия и выделил 48 000 человек для ее использования. Перемирие сделало ненужными как выделение, так и ассигнования. (Foreign Affairs, июль 1922 г.)</p>\n</blockquote>\n<p> Ядовитый газ невероятной пагубности, против которого могла бы устоять только секретная маска (которую немцы не могли получить вовремя), задушил бы всякое сопротивление и парализовал бы всю жизнь на вражеском фронте, подвергавшемся нападению. («Что означала бы война в 1919 году», мистер Уинстон Черчилль, «Журнал Nash's Pall Mall Magazine», сентябрь 1924 года).</p>\n<p> После войны исследования и эксперименты продолжались, и теперь говорят, что Великобритания лидирует в использовании этого «зверского метода ведения войны, этого дьявольского изобретения», оружия «дикарей».</p>\n<p> Такой же эффект произвела и подводная война. «Германии нельзя позволить принять систему открытого пиратства и убийств». (Мистер Черчилль, Палата общин, 15 февраля 1915 г.).</p>\n<blockquote>\n<p>«Сегодня впервые в истории одна из великих держав Европы предлагает начать систематическое ведение морской войны средствами, которые до сих пор осуждались нациями как пиратские». («Таймс», 18 февраля 1915 г.).\n«Нет необходимости умножать случаи яростного и справедливого возмущения со стороны прессы и отдельных лиц. Но задолго до этого события другая сторона вопроса была поставлена ​​не кем иным, как сэром Перси Скоттом, который, написав в Ответ лорду Сиденхэму в «Таймс» от 16 июля 1914 года, то есть до начала войны, дал следующую цитату из письма, написанного иностранным морским офицером, и свой комментарий к ней:</p>\n</blockquote>\n<blockquote>\n<p>«Если бы мы пошли на войну с островной стране, зависящей от поставок продовольствия из-за границы, мы должны были бы остановить эти поставки. При объявлении войны мы должны уведомить противника, чтобы он предупредил своих торговых судов, возвращающихся домой, не приближаться к острову, так как мы устанавливали блокаду из мин и подводных лодок.</p>\n</blockquote>\n<blockquote>\n<p>«Точно так же мы должны уведомить всех нейтральных стран, что такая блокада была установлена, и что, если какое-либо из их судов приблизится к острову, они будут уничтожены либо минами, либо подводными лодками, и поэтому сделают это на свой страх и риск».</p>\n</blockquote>\n<p> Комментарий, предоставленный сэром Перси Скоттом:</p>\n<blockquote>\n<p>«По моему мнению, такая декларация была бы совершенно уместной, и если бы какой-либо британский или нейтральный корабль проигнорировал ее, то, как только она была сделана, их нельзя было бы считать занятыми мирными делами, о которых говорилось. Лордом Сиденхэмом, и, если бы они были потоплены при попытке, это нельзя было бы назвать рецидивом дикости или пиратства в его самой черной форме. Чарльстоне во время Гражданской войны в Америке, я думаю, он обнаружит, что блокировавшие крейсера редко испытывали какие-либо угрызения совести в отношении того, чтобы стрелять по судам, которые они преследовали, или выгонять их на берег, и даже присыпать их, когда они оказались на мели, виноградом и снарядами. Торпеда подводной лодки будет более новым средством устрашения».</p>\n</blockquote>\n<p> В одном из характерно шутливых писем (адресованном адмиралу Тирпицу при его отставке 29 марта 1916 г.) лорд Фишер писал:</p>\n<blockquote>\n<p>«Я не виню вас за подводные дела. Я бы и сам сделал то же самое, только наши идиоты в Англии не поверили бы, когда я им рассказал».</p>\n</blockquote>\n<p> Такой же взрыв был по поводу воздушных налетов. У нас создалось впечатление, что гунны первыми обрушили с неба дождь смерти. Но среди фонарных лекций в пропагандистских целях, прочитанных в 1918 году Комитетом национальной военной службы, были слайды, иллюстрирующие сбрасывание бомб на немецкие города. Печатный синопсис одного из этих слайдов гласил:</p>\n<blockquote>\n<p>«Эти ранние налеты РНАС были первыми примерами бомбардировок с воздуха в любой войне, и жаль, что в начале войны у нас не было достаточно самолетов».</p>\n</blockquote>\n<p> Лорд Монтегю сказал в Палате лордов в июле 1917 года, что «было абсолютным вздором говорить о том, что Лондон является незащищенным городом. Немцы имели полное право совершать набеги на Лондон. Лондон защищали орудия и самолеты, и это был главный центр. Таким образом, мы обманывали себя, говоря, что Лондон — незащищенный город, а немцы, напавшие на него, виновны в поступке, недостойном цивилизованной нации. , но это был фактический факт положения. Правильная линия для правительства состояла в том, чтобы сказать гражданскому населению: «Это война народов, а не только армий, и вы должны постараться нести потери, которые вы страдают так же, как французское и бельгийское гражданское население несет потери, связанные с такого рода военными действиями».</p>\n<p> Союзники предприняли набеги на немецкие города, такие как Карлсруэ, и все разговоры о бесчеловечности были прекращены</p>\n<blockquote>\n<p>. Вы представляете себе яростное негодование в Великобритании известием о том, что немцы опустились до такой невообразимой глубины, что стали применять отравляющие газы? Британские цензоры с радостью сообщали самые ужасающие подробности страданий, причиняемых этим новым методом пыток. Вскоре лондонская цензура запретила дальнейшее упоминание об употреблении газа, что, конечно, означало, что Англия собиралась немного отравиться на свой страх и риск. Сегодня использование британцами газа приветствуется не только без стыда, но и с радостным удовлетворением. Подобно тому, как союзники убивали невинных женщин и детей в немецких городах своими летчиками, это еще раз показывает, как быстро во время войны рушатся идеалы». («Нью-Йорк Ивнинг Пост», 30 июня 1916 г.</p>\n</blockquote>\n<p> )</p>\n<p> С таким изобилием сеялась ложь, что в этот уже далекий срок невозможно было собрать весь урожай. Простого утверждения, даже от частного лица, часто было достаточно, чтобы запустить дело. Пресса была только благодарна за любое предложение, которое могло вызвать новый поток лжи, и правительство, когда оно не заботилось о своих собственных уловках, всегда было готово, сняв с себя ответственность, избежать прямого отрицания народной лжи</p>\n<p> .Почти</p>\n<p> Гувернантка.</p>\n<p> каждая иностранная гувернантка или официант в стране находились под серьезным подозрением, и о них было сочинено бесчисленное количество историй. Лучшее издание истории о гувернантке дано сэром Бэзилом Томсоном («Que er People» сэра Бэзила Томпсона):</p>\n<blockquote>\n<p>«Классическая версия заключалась в том, что гувернантка пропала во время полуденного обеда, и что, когда семья пришла открывать ее сундуки, они обнаружили под фальшдном склад фугасных бомб. Все, кто рассказывал эту историю, знали работодателя этой женщины; некоторые видели даже саму гувернантку в более счастливые дни: «Такая милая, тихая особа, такая любящая детей, а теперь, подумаешь, было в ее лице что-то, не поддающееся описанию, но нечто».</p>\n</blockquote>\n<p> Официант.</p>\n<p> Швейцарский официант, нарисовавший на карточке-меню план столов в столовой отеля, где он заведовал, был на самом деле в спешке доставлен в Скотланд-Ярд по настоятельному представлению посетителя отеля, который был убежден что план имел военное значение.</p>\n<p> Немецкая служанка в Берсдене, недалеко от Глазго, с чемоданом, полным планов и фотографий, была еще одной выдумкой.</p>\n<p> Эмалированная реклама.</p>\n<p> Было сообщение о том, что эмалированные железные рекламные объявления «супа Магги», которые были прикреплены к рекламным щитам в Бельгии, были отвинчены немецкими офицерами, чтобы они могли прочитать информацию о местных ресурсах, которая была нарисована на немецком языке на обороте шпионами, которые предшествовали им. Было это правдой или нет, но это было общепризнано, и в пригородах Лондона были сформированы группы отверток для изучения оборотов эмалированных рекламных объявлений.</p>\n<p> Бетонные платформы.</p>\n<p> Заложенные в Мобеже огневые точки, выполненные в форме теннисных кортов, привели к удивительно широко распространенному мнению, что все корты с твердым покрытием, мощеные задние сады или бетонные крыши предназначены для этой цели. Любой, кто обладал одним из них, попадал под подозрение не только на Британских островах, но и в Америке, и паника фактически распространилась на Калифорнию.</p>\n<p> В «Свидетеле» в марте 1915 года была карикатура, на которой Бернхарди писал свои книги со шпагой в зубах и револьвером в левой руке, а на стене был план с надписью «Предлагаемая бетонная кровать в Голдерс-Грин».</p>\n<p> Трубки.</p>\n<p> Трубка как убежище от рейдов дирижаблей, естественно, привлекла к себе внимание. Сэр Бэзил Томсон приводит в этой связи одну из форм изобретения.</p>\n<blockquote>\n<p>«Английская медсестра вернула немецкого офицера с порога смерти. В порыве благодарности он сказал на прощание: «Я не должен больше говорить вам, но остерегайтесь трубок (в апреле 1915 г.)». Со временем дата переносилась вперед месяц за месяцем. Мы взяли на себя труд проследить эту историю из уст в уста, пока не дошли до второй хозяйки лондонской школы-интерната. Она заявила, что слышала это от уборщицы, убиравшей в школе, но эта дама решительно отрицала, что когда-либо рассказывала такую ​​нелепую историю.</p>\n</blockquote>\n<p> Бомбардировка больниц.</p>\n<p> В мае 1918 г. Пресса была полна статей с самым бурным возмущением по поводу преднамеренных бомбардировок немцами госпиталей. «Таймс» (24 мая 1918 г.) писала: «Это было наравне со всеми мерзостями, из-за которых немецкое имя воняло в ноздрях человечества с начала войны и будет вонять, пока жива память». И рекомендовал, после того как они были побеждены, «остракизм со стороны общества цивилизованных наций». Был карикатурный <em>peach</em>, и остальная пресса завопила. Солдаты, однако, по обыкновению, не впадали в истерику и объяснили дело бомбардировкой госпиталей в Этапле, после чего в предисловии, опубликованном «Manchester Guardian», появилось следующее.</p>\n<blockquote>\n<p>«В конце прошлого месяца и в начале этого общественного мнения здесь — и, кстати говоря, мы полагаем, что и в большинстве других стран — было в ужасе от сообщений корреспондентов во Франции, которые описывали преднамеренные бомбардировки британских больниц. Немецкими летчиками. В одном случае корреспондент категорически утверждал, что ошибки быть не могло, госпитали, а не что-либо военное значение, были объектами, на уничтожение которых налетчики стремились. Чем теперь ожоги против немцев, так как бесчеловечность не могла достигать меньшей глубины, чем нападение на больных и раненых и тех, кто им служит.В действительности не было никакого места для сомнения в точности этих сообщений, ибо на местах действует цензура которая не только не позволяет корреспонденту сказать что-либо, что ему не нравится, но и может исправить ошибку, если он по какой-то случайности впал в неточность, что он легко может сделать. Эти отчеты прибыли и остались неисправленными, было правильно предположить, что они представляли факты. Но мы считаем, что военные власти считают, что нет достаточных доказательств того, что это были преднамеренные нападения на больницы. Военная точка зрения заключается в том, что госпитали иногда должны располагаться по обе стороны фронта вблизи объектов военного значения, таких как железные дороги, лагеря или склады боеприпасов, и что во время ночного рейда госпитали рискуют быть пораженными, когда военные объекты вокруг них подвергаются нападению. Но если это авторитетная военная точка зрения, то почему корреспондентам было позволено отправлять в эту страну вводящие в заблуждение сообщения или что, когда сообщения были отправлены, не были предприняты шаги, чтобы устранить впечатление, которое они произвели? Наши доводы против немцев достаточно сильны по совести и основательно доказаны. Мы можем позволить себе отдать им должное, и мы должны делать не меньше» («Manchester Guardian», 15 июня 1918 г.)</p>\n</blockquote>\n<p> . Солдатам противоречило действительности.</p>\n<p> Кронпринц.</p>\n<p> Немецкий кронпринц, когда он был жив, всегда представлялся крадущим ценности из французских замков. Вот пример того, что считалось необходимым написать по этому поводу</p>\n<blockquote>\n<p>: Наследный принц Пруссии еще может быть увековечен как принц среди грабителей и грабитель среди принцев! ... Германия ведет войну способом, который похвалил бы Билла Сайкса и старшего сына кайзера в его стремлении заполучить «хабар». Заслужил право считаться имперским Феджином ... Эта современная Германия, дух которой воплощен в наследном принце, сражается как доблестный негодяй. Он умрет, как герой, но будет убивать, как апаш, и будет воровать, как подлый карманник». («Кражи наследного принца», «Daily Express», 1 ноября 1914 г.).</p>\n</blockquote>\n<p> В 1915 году в «La Nouvelle Revue» появилась статья, написанная ирландкой, чей друг был свидетелем секретной церемонии в Менине, на которой «немецкий наследный принц был коронован королем Бельгии на рыночной площади». Это было воспроизведено в английской прессе.</p>\n<p> Туберкулезные микробы.</p>\n<p> Немцев обвинили в прививке французским военнопленным микробов туберкулеза. Это утверждение было настолько решительным, что 24 апреля 1917 года в парламенте был задан вопрос по этому поводу. Однако правительство отказалось от какой-либо информации по этому вопросу, и эта история была прекращена.</p>\n<p> Патриотический лжец.</p>\n<p> Метод патриотического лжеца можно проиллюстрировать на примере священника, который сообщил Манчестерскому географическому обществу 7 октября 1914 года: «Вы услышите только одну сотую часть реальных зверств, которые произвела эта война. Не верьте истине. Она никогда ее не услышит. Сегодня по всей Англии десятки - я преуменьшаю число - бельгийских девушек, которым отрубили руки. Это ничего из того, что мы могли бы сказать ты.\" Позднее в том же месяце преподобный джентльмен написал в «Daily News» письмо с вопросом: «Пришлет ли мне все подробности кто-нибудь, кто действительно видел такие случаи здесь, в Англии?»</p>\n<p> Сначала он сделал заявление, а потом пытался получить показания.</p>\n<p> Шахтеры, погребенные заживо.</p>\n<p> 29 августа в газете «Daily Citizen» из Глазго была опубликована статья под</p>\n<blockquote>\n<p>заголовком «Шахтеры погребены заживо! Вражеские блочные шахты бельгийских карьеров». 1 декабря «Daily Citizen» (без заголовка абзаца) передала заявление М. Ломбарда (генерального секретаря бельгийских горняков) исполнительному директору Федерации горняков Великобритании, в котором он «отрицал, что было какое-либо Правда в том, что в этой стране так свободно ходили слухи, что немцы заткнули в разных местах шахтные устья, задушив таким образом горняков под землей».</p>\n</blockquote>\n<p> Новости войны для США</p>\n<p> Бывший агент Standard Oil Company, живший в Криффе, Шотландия, снабжал США «военными новостями». «Stratearn Herald» в декабре 1914 года предоставил несколько образцов. Был, конечно, безрукий бельгийский младенец, прибывший в Глазго.</p>\n<blockquote>\n<p>«Более сотни немцев были найдены с клетками, полными почтовых голубей, в Глазго и Эдинбурге».</p>\n</blockquote>\n<p> Но самой подробной новостью было то, что когда около месяца назад британской армии пришлось отступить во Франции, генерал Френч попросил подкрепления у некоторых французских генералов, но получил отказ. Китченер отправился на континент на следующий день, и единственным оправданием было то, что французские войска устали. Однако в ходе расследования выяснилось, что у двух французских генералов были жены-немки. Китченер приказал расстрелять двоих из них»</p>\n<p> . Письмо солдата.</p>\n<p> На недавней встрече на севере Англии один из бывших военнослужащих рассказал слушателям следующее:</p>\n<p> он был ранен и взят в плен на Западном фронте, и для некоторое время находился в госпитале в Германии.На пути к выздоровлению он узнал, что его выписывают из госпиталя, так как нужны койки для раненых немцев, и что его отправляют в специальный лагерь для выздоравливающих. Короткой запиской своим родственникам он сообщил им о высылке.</p>\n<p> Вернувшись домой после войны, он был поражен, обнаружив, что местная пресса получила разрешение от его людей на использование письма и сплела вокруг него историю о «зверствах». Рассказывая, как, когда он был на грани смерти, его сняли с постели, чтобы освободить место для легкораненого немца, и отправили в путь за очень много миль в лагерь, где его раны никак не могли получить должного внимание, так что практически не было шансов его выздоровление благодаря этому варварству со стороны немцев.</p>\n<p> Фальшивый немецкий орден.</p>\n<p> Рядовой, служивший в 24-й дивизии, рассказывает, как в 1917 году в районе Соммы среди войск была распространена машинописная копия перевода якобы немецкого приказа. Приказ требовал, чтобы немецкие женщины сожительствовали с гражданскими лицами и солдатами в отпуске, чтобы не было недостатка в детях, чтобы компенсировать военные потери. Тем, кто усердно выполнял приказ, предлагались награды. Напечатанный на служебных машинах, циркуляр был вывешен в столовых.</p>\n<p> Российский арсенал уничтожен.</p>\n<p> 11 сентября 1915 года в \"Вечерних новостях\" были большие заголовки: \"</p>\n<p> Удар, который покалечил Россию</p>\n<p> только арсенал</p>\n<p> и было подробное описание того, как с помощью немецких шпионов и предательства русский \"Вулидж\" был взорван. Частей. Охта был русским вулвичем и намного больше, чем русский вулвич. Это был единственный во всей России военный завод.</p>\n<p> Впоследствии выяснилось, что взрыв «Охты» произошел вовсе не на арсенале, а в результате аварии на заводе, временно превращенном в военный завод. Никакие немецкие шпионы не имели к этому никакого отношения. Это было незначительное дело, и небольшой абзац с правдивой версией был вставлен в более поздний номер газеты.</p>\n<p> Забавно, но в том же номере и на той же странице появилась сатирическая статья о «Микробе слухов», в которой высмеивался человек, который сказал: «У его родственника был родственник, который видел, как дирижабль спускался на Хэмпстед». Хит, и какой-то человек пошел к какой-то конюшне и вытащил несколько лошадей, которые отбуксировали его».</p>\n<p> Внимательное изучение подшивок газет, британских и иностранных, за эти четыре года принесло бы поразительный урожай лжи. Так как на общественное сознание всегда производит впечатление все, что появляется в печати, влияние прессы в настраивании одних людей против других должно было быть очень значительным и, по мнению многих людей, весьма похвальным.</p>\n<p> Глава XXVIII Производство новостей</p>\n<p> «Падение Антверпена». Ноябрь 1914</p>\n<blockquote>\n<p>г. «Когда стало известно о падении Антверпена, зазвонили церковные колокола» (имеется в виду в Германии). (Kölnischer Zeitung _)</p>\n</blockquote>\n<p> Согласно _Kölnische Zeitung, духовенство Антверпена было вынуждено звонить в церковные колокола, когда крепость была взята. (Le Matin)</p>\n<p> Согласно тому, что Le Matin услышал из Кёльна, бельгийские священники, которые отказались звонить в церковные колокола, когда Антверпен был взят, были изгнаны со своих мест. (The Times)</p>\n<p> Согласно тому, что The Times получила из Кельна через Париж, несчастные бельгийские священники, отказавшиеся звонить в церковные колокола при взятии Антверпена, были приговорены к каторжным работам. (Коррьере делла Сера).</p>\n<p> По сведениям «Corriere della Sera» из Кёльна через Лондон, подтверждается, что варварские завоеватели Антверпена наказали несчастных бельгийских священников за их героический отказ звонить в церковные колокола ими, как живыми хлопающими в колокола с опущенными головами. . (Le Matin)</p>\n<p> Глава Xxix. Цели войны</p>\n<p> Поскольку существовала большая неуверенность в том, как в случае победы будет разделена добыча, государственные деятели союзных наций не могли точно определить, какие конкретные цели в отношении территориальных приспособления и колониальные приобретения можно было рассматривать как желательные цели, не вызывая ревности и подозрений между собой. Поэтому возникла необходимость провозгласить некоторые общие высокопарные моральные идеалы, которые могли бы придать войне характер почти религиозного крестового похода. Им особенно не повезло в выборе нескольких криков, каждый из которых в конечном счете оказался ложным.</p>\n<p> Война за сокрушение милитаризма.</p>\n<p> Всем известно теперь, что милитаризм нельзя сломить войной. Даже если его удалить с одной стороны, в другом месте он только усилится. Милитаризм может быть сокрушен только путем роста реальной демократии в эпоху мира. Требуется лишь несколько цифр, чтобы показать, насколько ложным был этот крик, если ему когда-либо верили. The Morning Post была достаточно честна, чтобы назвать это «абсурдным разговором».</p>\n<p> Британская империя. Расходы на боевые услуги.</p>\n<p> гг. 110 375 000 ф. Ст. 1924-25 гг. 117 525 000 ф.</p>\n<p> 1913-14покончить с милитаризмом, в любом случае очевидно.</p>\n<p> же период совокупные суммы для четырех союзных держав, Франции, Италии, Соединенных Штатов и Японии составляют:</p>\n<p> 1913 г. — 194 380 625 ф.</p>\n<p> тот 1 300 000 000 фунтов стерлингов на вооружение. Следовательно, сказать, что война сокрушит милитаризм, было бы самым экстравагантным и глупым из всех предположений. Было бы оскорблением ума любого из государственных деятелей предположить, что они хоть на мгновение поверили, что это правда.</p>\n<p> Война в защиту малых народов.</p>\n<p> Ультиматум Сербии и нарушение бельгийского нейтралитета вызвали повсеместный клич о том, что мы боремся «за права малых народностей».</p>\n<blockquote>\n<p>Это означает, далее, что необходимо найти и сохранить место для самостоятельного существования и свободного развития более мелких национальностей, каждая из которых имеет свое собственное корпоративное сознание.</p>\n</blockquote>\n<blockquote>\n<p>(Мистер Асквит о целях войны, Дублин, 26 сентября 1914 г.).</p>\n</blockquote>\n<p> Было множество других заявлений ответственных министров аналогичного характера.</p>\n<p> Но это было не более верно, чем любой другой крик. Помимо меньшинств, поставленных под чужеземное правление в результате делимитации границ, проведенных в стратегических целях, а не в соответствии с расой или национальностью, Черногория была стерта с лица земли мирными договорами, хотя восстановление Черногории было особо упомянуто премьер-министром 5 января 2008 года. 1918 г. (памфлет «Национальные цели войны» № 33), британская оккупация Египта продолжается, сирийцы подвергаются жестоким репрессиям со стороны французов (бомбардировка Дамаска), попытка риффов добиться независимости привела к их уничтожению. , Никарагуа и Панама находятся под политическим господством Соединенных Штатов, и можно было бы привести другие примеры, когда борьба «малых национальностей» рассматривается просто как революционный или подрывной шаг. Примеры, приведенные в глазах великих держав, могут иметь веские политические причины, но стремление убедить народ в том, что мы боремся за малые народности, было чистейшим лицемерием.</p>\n<p> Война за то, чтобы сделать мир безопасным для демократии.</p>\n<p> Нелепость этого бессмысленного крика со стороны союзников, среди которых была и царская Россия, очевидна. Его неискренность доказана результатами. В настоящее время в Италии установлена ​​самая безжалостная диктатура из когда-либо существовавших; имитация этого в Испании; завуалированная диктатура в Польше; серия попыток установления диктатуры в Греции; что-то близкое к диктатуре в Венгрии; В Турции и Персии доминируют люди с почти суверенными прерогативами, а советская система — это форма диктатуры. Фактически, за исключением Великобритании, Соединенных Штатов, скандинавских стран, Бельгии, Голландии и Швейцарии, парламентское правление подвергалось серьезной опасности там, где оно не было полностью вытеснено.</p>\n<p> Война, чтобы положить конец войне.</p>\n<p> Вряд ли это был оригинальный крик. Это было произнесено в предыдущих войнах, хотя каждый школьник знает, что война порождает войну.</p>\n<blockquote>\n<p>Нас давно обманывают ложные советы политиков и сентименталистов, которые и сейчас делают вид, что это война, которая покончит с войной. Война никогда не закончится, пока человеческая природа остается человеческой. («Морнинг пост», 20 октября 1915 г.).</p>\n</blockquote>\n<p> Что же касается Великой войны, то «Морнинг пост» кажется верным на сегодняшний день. С 1918 года боевые действия в мире никогда не прекращались. Была война со стороны союзников против России, война между Турцией и Грецией, подвиги черно-подпалых в Ирландии, вооруженная оккупация Рура, война Франции и Испании против рифов, война Франции против сирийцев, военные действия США в Никарагуа, боевые действия в Мексике, непрекращающаяся война в Китае.</p>\n<p> Нет территории для Великобритании.</p>\n<p> Часто делалось заявление о том, что, за что бы мы ни боролись, нам не нужны новые территории. Учитывая, что в 1914 году Британская империя занимала более тринадцати миллионов квадратных миль земной поверхности, это заявление было воспринято как мудрое и разумное. Можно привести несколько основных заявлений по этому вопросу.</p>\n<blockquote>\n<p>«У нас нет желания увеличивать наше имперское бремя ни по площади, ни по ответственности». (Мистер Асквит, октябрь 1914 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Наши прямые и эгоистичные интересы невелики». (Мистер Асквит, ноябрь 1914 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Мы не боремся за территорию». (Мистер Бонар Лоу, декабрь 1916 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Мы не ведем захватническую войну». (Мистер Ллойд Джордж, февраль 1917 г.)</p>\n</blockquote>\n<blockquote>\n<p>«Такая победа, которая не даст ни расширения территории, ни какого-либо расширения нашей Империи». (Мистер Лонг, февраль 1917 г.)</p>\n</blockquote>\n<p> Вот и все протесты для общественного потребления. Теперь о фактах того, что нам «выпало», когда все было кончено.</p>\n<p> Квадратные мили.</p>\n<p> Египет, ранее находившийся под турецким сюзеренитетом, стал частью Британской империи 350 000</p>\n<p> Кипр, ранее находившийся под турецким сюзеренитетом, стал частью Британской империи 3 584</p>\n<p> Южно-Африканскому Союзу</p>\n<p> принадлежит Великобритания 384 180</p>\n<p> Тоголенд и Камерун, разделенные между Великобританией и Францией (скажем, половина) 112 415</p>\n<p> Самоа, мандат принадлежит Новой Зеландии 1050</p>\n<p> Германская Новая Гвинея и остров к югу от экватора, мандат принадлежит Австралии 90 000</p>\n<p> Палестина, мандат принадлежит Великобритании 9 000</p>\n<p> Месопотамия ( Ирак), мандат, принадлежащий Великобритании 143 250</p>\n<p> Всего в квадратных милях 1 415 929</p>\n<p> Это неплохая сумма «завоевания», «территории», «дополнения к имперскому бремени в области и ответственности» и «расширения империи». Но, конечно, было бы лучше не делать ложных заявлений, которые неизбежно навлекут на нас обвинение в лицемерии.</p>\n<p> Глава Xxx - Иностранная ложь</p>\n<p> (A) Германия.</p>\n<p> Сходство линий, по которым велась ложь в Германии, с нашими в этой стране хорошо показывает, насколько оболванивание народа является необходимым дополнением войны во всем мире.</p>\n<p> Внутри страны цензура была строже, чем у нас. Ни слова приличного в отношении врага не допускалось, а хорошее обращение с заключенными в британских лагерях подавлялось. Такая же поразительная глупость в отношении утаивания проявилась, как и в этой стране. Но была допущена еще большая ошибка, когда до конца изображали ситуацию в розовых тонах и с преувеличенным оптимизмом. Настоящая правда о ходе событий скрывалась, каждый успех противника преуменьшался, эффект американской интервенции преуменьшался, состояние немецких ресурсов преувеличивалось, так что, когда наступила последняя катастрофа, многие люди были застигнуты врасплох. В связи с этим немцы получили более сильное обвинение против своих властей, чем мы. В этой стране не обошлось без предостережений и предостережений.</p>\n<p> Пресс-бюро (Pressekonferenz) возглавлял солдат. Потери, насколько это было возможно, скрывались. 15 ноября 1914 г. Pressekonferenz заявила, что погибло несколько сотен человек, тогда как официальный список на тот момент содержал 55 000 имен. Один из членов Pressekonferenz поддержал циркуляр нашего военного министерства, когда он сказал однажды, имея дело с ложным официальным сообщением: «Важна не столько точность новостей, сколько их воздействие».</p>\n<p> Турки были неудобными союзниками. Резню армян приходилось скрывать, хотя в некоторых газетах делались попытки их защитить.</p>\n<p> Наши поэты и профессора имели своих точных двойников в Германии и придавали ортодоксальному «патриотизму» интеллектуальный и литературный оттенок.</p>\n<p> За границей немецкое враньё было не очень искусным. Это было либо слишком тонко, либо слишком неуклюже. У них было широкое поле боя, когда против них выступало так много народов. «Окружение» было главным лозунгом, а в случае России и Франции — агрессией.</p>\n<p> В октябре 1914 года принц Рупрехт Баварский заявил, что амбиции Англии «в течение многих лет были направлены на то, чтобы окружить нас кольцом врагов, чтобы задушить нас» (uns mit einem Ring von Feinden zu umgeben und uns zu erdrosseln). Подобные заявления.</p>\n<p> Что касается преднамеренной политики окружения, что касается Великобритании, герр Рудольф Кирхер замечает в своей книге «Англия» (1926):</p>\n<blockquote>\n<p>«Личность Грея является живым доказательством того, что политика окружения как военная цель, как представлялось в Германии никогда не существовало. Все это были фантастические предположения, столь же фантастические, как мысль о том, что немецкий народ созрел и готов к нападению и борьбе за мировое господство».</p>\n</blockquote>\n<p> Германское правительство, как и все другие правительства, было безупречным и находилось во власти происков вражеских правительств. У них не было главного монстра, которого можно было бы изобразить, как это было у союзников, а было лишь несколько не очень выдающихся государственных деятелей. В первые дни паники они начались с военного доклада «о том, что французские авиаторы сбросили бомбы в окрестностях Нюрнберга» 3 августа 1914 года, и в газетах появились пламенные заголовки. Но прусский посланник в Мюнхене телеграфировал в Берлин, что «никаких свидетельств сброса бомб и тем более, естественно, что летчики французы» нет (документы Каутского, № 758). В то же время поступил доклад губернатора Дюссельдорфа, что «восемьдесят французских офицеров в форме прусских офицеров на двенадцати автомобилях предприняли тщетную попытку пересечь границу в Вальбеке». Оба эти сообщения были телеграфированы господином Ягоу, министром иностранных дел, министрам в Брюсселе и Гааге, чтобы довести их до сведения правительств как нарушение международного права. Оба, без сомнения, верили, но ни один из них не имел никакого основания. С другой стороны, до 3 августа 1914 г. Имело место несколько случаев нарушения территории Франции немецкими пограничными патрулями.</p>\n<p> Если не считать нелепостей «Готта обстреливать Англию» и «Гимна ненависти», Великобритания, естественно, выделялась особым внимание. 3 сентября 1914 года \"Франкфуртер цайтунг\" напечатала речь г-на Джона Бернса, которая была чисто воображаемой. В октябре в \"Нью-Йорк американец\" появилось интервью с \"высокопоставленным представителем британского правительства\", которое было доказано чтобы быть полностью ложным. Самолеты использовались для того, чтобы сбрасывать на французские окопы и заготовки открытки с изображениями разрушенных французских церквей с надписью на них: «Разрушено англичанами». Во вражеских странах: отчаяние, деморализация и паника, обвинения в злоупотреблении \"белым флагом\", особенно против британских войск, и прочая \"нужная\" военная ложь.</p>\n<p> Нейтральные страны, конечно, получили пропаганда с обеих сторон. Был немецкий фильм, в котором немецкие солдаты кормили бельгийских и французских детей, а английские военнопленные улыбались от восторга, работая под суровым взглядом прусских солдат.</p>\n<p> 25 ноября 1914 г. \"Norddeutsche Allgemeine Zeitung\" опубликовала факсимильный перевод доклада генерала Дюкарна бельгийскому военному министру от 10 апреля 1906 г., в котором записан визит полковника Барнардистона в связи с отправкой экспедиционного корпуса в Бельгию. События войны между Германией и Францией. В переводе, воспроизведенном в других газетах без факсимиле, было три ошибки.</p>\n<blockquote>\n<p>а) интерполяция, которая была неотъемлемой частью текста, гласила: «Вход в английскую бельгию, не связанный с нарушением нейтралитета в отношении аллеманов». (Вступление англичан в Бельгию произойдет только после нарушения Германией нашего нейтралитета.) Это было представлено в виде примечания на полях и дано по-французски, чтобы многие читатели не поняли его.</p>\n</blockquote>\n<blockquote>\n<p>(б) В отрывке: «Он (полковник Барнардистон) подчеркивал, что наша беседа должна быть абсолютно конфиденциальной», слово «беседа» переведено как «абкоммен», как если бы это было «соглашение».</p>\n</blockquote>\n<blockquote>\n<p>(c) Последняя дата на французском языке «Fin Septembre 1906» была переведена как «Abgeschlossen September 1906», т. Е. «заключено», что создавало впечатление «конвенции», которая была «заключена»</p>\n</blockquote>\n<p> . Были ошибки по небрежности, но все три вместе, несомненно, указывают на преднамеренную попытку фальсификации.</p>\n<p> В первые месяцы войны Бюро Вольфа распространило в газетах сообщение: «Сегодня французский врач при содействии двух переодетых французских офицеров попытался заразить бациллой чумы и холеры колодец в Меце; преступники были пойманы и расстреляны». Впоследствии был выпущен официальный <em>démenti</em> этой истории.</p>\n<p> Сообщается, что самый большой туннель в Германии, в Кохене, на границе, был разрушен трактирщиком Николаем из Кохена и его сыном, оба были застрелены. \"Rheinisch Westfälische Zeitung\" сообщила, что после тщательного расследования было обнаружено, что Николай был натурализованным немцем, французом по происхождению, и можно поздравить, что преступник не был настоящим немцем. На следующий день заместитель префекта Кохена объявил, что в предполагаемом заговоре нет ни слова правды; Николай был жив и был очень уважаемым гражданином, пока его сын служил в прусском полку.</p>\n<p> В Германии так же, как и в этой стране, изобиловала ложь. Выколоть глаза там, кажется, было таким же большим фаворитом, как бельгийские младенцы без рук здесь.</p>\n<p> В сентябре 1914 года одной даме из Кёльна сообщили, что целая палата в госпитале Экс-ла-Шапель отдана раненым солдатам, которым в Бельгии выкололи глаза. На запрос ведущий врач Экс-ла-Шапель заявил, что такой комнаты нет и ни одного подобного случая не наблюдалось. Но история перекочевала из Экс-ла-Шапель в Бонн, где снова главврачу больниц пришлось ее опровергнуть. Затем он отправился в Зигмаринген. «Везер Цайтунг» в Бремене подхватила это и написала в том же духе о больнице в Берлине. Это было опровергнуто Kommandatur der Residenz. Это достигло своего апогея, когда сообщили, что маленький мальчик десяти лет видел «целое ведро солдатских глаз» (ein ganzer Eimer voll Soldatenaugen).</p>\n<p> «Die Zeit in Bild» (12 января, № 38) дал косвенные сведения о священнике, который носил на шее цепь, состоящую из колец, снятых с отрезанных им пальцев.</p>\n<p> В официальном отчете компании Luttich, где это должно было произойти, говорится, что такого случая не было.</p>\n<p> В «Kölnische Volkszeitung» от 15 сентября 1914 года рассказывалось, как рота немецких солдат маршировала через бельгийскую деревню, когда священник, стоявший перед дверью церкви, пригласил капитана войти со своими солдатами: ибо хорошо, — сказал он, — даже в эти темные времена думать о Боге» (da es doch in dieser schweren Zeit gut sei auch an den lieben Gott zu denken). Капитан принял приглашение. За алтарем был спрятан пулемет. Когда церковь наполнилась, пулемет был демаскирован, и вся рота была расстреляна.</p>\n<p> Подобные истории возникали главным образом из-за антикатолической предвзятости. Священников обвиняли в укрывательстве французских солдат в своих домах, но ни одно дело не было доказано. Инцидент, о котором было дано множество различных версий, произошел с Деманжем, священником Лагард. Говорили, что он выдал врагу позицию немецких войск, поставил в башне своей церкви пулемет, из которого расстреливал немцев. Сообщается, что он был застрелен, и его тело, пронизанное тридцатью штыковыми ранами, видели перед дверью церкви Лагард. Мало того, что все это было выдумкой, но из официальных сведений выяснилось, что Деманж, который был жив, вел себя героически в сопротивлении врагу и получил похвалу от немецких офицеров.</p>\n<p> Варианты этой истории и разоблачение ее как лжи появились в «Frankfürter Zeitung» (18 сентября 1914 г.) и «Kölnische Volkszeitung» (11 октября 1914 г.).</p>\n<p> 31 августа 1914 года Berliner Lokalanzeiger_ сообщил, что медсестра в Амстердаме слышала от немецкого офицера, что после того, как Лёвен был оккупирован, все стало тихо. Но позже в подвале монастыря были обнаружены тела пятидесяти немецких солдат, расстрелянных монахами. После этого заключенные были арестованы, а настоятель расстрелян.</p>\n<p> Эта история получила широкое распространение, и, поскольку она могла озлобить религиозные чувства, генерал фон Биссинг издал полное опровержение сообщения и приказал не распространять его в прессе (Мюнстер, 6 сентября 1914 г.). Тем не менее эта история была включена в несколько немецких книг о войне.</p>\n<p> В сентябре 1914 года сержант (унтер-офицер) Адольф Шмидт рассказал в письме своим родителям, как он и его отряд были приглашены французским священником выпить кофе. Будучи подозрительным, он вызвал врача, чтобы осмотреть кофе, и обнаружил, что в нем был смешанный стрихнин. Священник и его повар были расстреляны на следующее утро («Schwarzwälder Chronik», 18 сентября 1914 г.). Вся история оказалась выдумкой сержанта, который отказался от нее.</p>\n<p> В апреле 1915 года Vossische Zeitung сообщила о вторжении сенусов в Египет с армией в 70 000 человек. Это изобретение было воспроизведено в _Corriére della Sera в Италии и опровергнуто британским посольством.</p>\n<p> В письме (26 августа 1914 г.) в «Гамбургер Фремденблатт» рассказывается, как бельгийцы снабжали немецкие войска сигарами, наполненными порохом, который ослеплял их, когда они их зажигали. В другом письме в «Berliner Tageblatt» (от 26 августа) сообщалось, что бельгийцы насыпали в письма немцев наркотический порошок.</p>\n<p> 23 января 1915 года «Kölnische Zeitung» дала самое ужасное описание, сделанное очевидцем, сцены на Восточном фронте, когда двенадцатилетний мальчик был прикован к столу гвоздями, вбитыми ему в пальцы. Судья Розенберг из Эссена поднял этот вопрос и спросил название места, где это произошло. После проволочек и увиливаний, а также значительных трудностей с поиском автора рассказа он установил, что это произошло в Просткене. Соответственно, он написал тамошним властям и получил ответ 14 сентября 1916 г. О том, что ни о каком подобном происшествии в округе ничего не известно.</p>\n<p> В том, что на Восточном фронте были случаи жестокости и варварства, не может быть никаких сомнений. Но они были преувеличены до тех пор, пока против русских не были выдвинуты массовые обвинения в том, что они обычно отрезали мужчинам руки и ноги и грудь женщинам.</p>\n<p> И на Востоке, и на Западе ходили слухи о зверствах без названий мест и лиц.</p>\n<p> Ниже приводится пример истории, которую немецкую общественность заставили принять как типичную для методов ее врагов.</p>\n<p> 29 октября 1915 г. «Kölnische Volkszeitung» описала следующий инцидент:</p>\n<blockquote>\n<p>«Вследствие провозглашения Священной войны несколько британских аскари мусульманского вероисповедания отказались воевать против немцев Восточной Африки; после этого эти 112 «мятежников» были надели наручники и избили и доставили в Найроби, где они были приговорены военным трибуналом к ​​повешению, но через несколько дней вместо повешения был отдан новый приказ, согласно которому осужденные должны были быть использованы в качестве живых мишеней для чернокожих рекрутов в стрельбе.Однажды утром в ноябре прошлого года десять из этих заключенных были доставлены в место к югу от Найроби, где находились в лагере британские аскари.Осужденные должны были прежде всего вырыть огромную яму, где затем их должны были похоронить. Затем их связали по рукам и ногам, заткнули рот и поместили в кусты, высокую траву или на деревья так, чтобы была видна лишь небольшая часть их тел. Английские офицеры давали инструкции в стрельбе. Нг. На расстоянии от 100 до 300 шагов новобранцы стреляли по живым мишеням. Эта практика продолжалась все утро и день, а к вечеру двое мужчин были найдены мертвыми, а остальные, которые были ужасно ранены, были затем убиты. Затем тела были брошены в яму. Эта практика стрельбы продолжалась ежедневно до тех пор, пока все осужденные не были убиты»</p>\n</blockquote>\n<p> . ... Утверждалось, что такое нападение подорвет престиж Великобритании. Англичанин утверждал, что это только очень поможет вербовке.</p>\n<p> Когда произошли настоящие бомбардировки Хартлпула, Скарборо и Уитби, утренняя пресса широко освещала это событие. \"Укрепленные города Хартлпул, Уитби и Скарборо подверглись бомбардировке\". Затем последовало описание Телеграфным бюро Вольфа характера укреплений на холме в Скарборо и снова в Уитби. В тексте подразумевалось, что это произошло потому, что они были хорошо... Известных укрепленных городов, что они были выбраны для бомбардировки.Вопрос обсуждался в день выхода газеты, и Немецкий профсоюз Сц снова и снова указывал на свидетельства в прессе о военном характере этих трех городов. Англичанин точно назвал Хартлпул и Скарборо любимыми курортами британских детей, а Уитби - местом паломничества посетителей из Англии и Америки. Но он не произвел впечатления. Они были сильно раздражены и предпочитали собственную ложь, общепринятую в Германии. Следует помнить, что Daily Mail ответила серией фотографий младенцев.</p>\n<p> Ложь, разоблаченная не кем-нибудь, а министром иностранных дел, непременно должна быть зафиксирована. Сэр Эдвард Грей, выступая 25 мая 1916 года в палате общин, сослался на заявление германского канцлера (герра фон Бетманн-Гольвега) в следующих выражениях:</p>\n<blockquote>\n<p>«Я нашел одну новую вещь в заявлении германского Канцлера в отношении условий мира. Это заявление о том, какой была позиция британского правительства во время дипломатических трудностей в отношении Боснии. Это заявление не соответствует действительности в отношении нас. Обвинение в том, что наша позиция была воинственной о переговорах по Боснии — первоклассная ложь. Мысль о том, что мы пытались склонить Россию к войне и что мы говорили, что эта страна должна быть готова к войне из-за Боснии, прямо противоречит истине».</p>\n</blockquote>\n<p> (В) Франция.</p>\n<p> Как бы ни критиковали французов, мы никогда не можем обвинить их в лицемерии. Они осознавали большое значение «пропаганды» и шли на работу с волей. Они не стыдятся этого факта и не пытаются его скрыть. Мы всегда смешивали нашу ложь с праведным негодованием и высокой моралью и старались сделать ее как можно более государственной и благородной, хотя история с Кадавером была, пожалуй, самой жестокой и самой успешной ложью на войне. Французские власти были в восторге от этого, и английский военный корреспондент рассказал, как французских корреспондентов заставили присылать отчеты о фабрике трупов под их собственными подписями.</p>\n<p> Следует помнить, что в насыщенные событиями дни перед 4 августа 1914 года французское правительство заявило, что оно продемонстрировало свою миролюбивую настроенность, отведя все свои войска на десять километров от границы — жест, который здесь и во Франции был воспринят как величественный, великодушный и героический . Правда, однако, заключалась в том, что французы хотели как можно дольше отсрочить объявление войны, чтобы дать все время приготовлениям в Великобритании и России. Вот как пишет об этом один француз:</p>\n<blockquote>\n<p>«Было очевидно, что если бы этот приказ хоть в малейшей степени скомпрометировал успех наших планов, то наши генералы не потерпели бы его. Где наши войска могли бы отойти на десять километров от границы, это были бы пункты, где не было бы неудобства, а в местах, где нужно было бы им быть ближе, они были бы ближе. Где они остались на границе, и многие, по свидетельству г-на Мессими (военного министра), откуда они были отведены всего на четыре-пять километров, причем после 2 августа в 17.30, т. Е. За целый день до провозглашения Германией войны приказ был подавлен под тем предлогом, что утром три немецких патруля вторглись на нашу территорию.</p>\n</blockquote>\n<blockquote>\n<p>«Без сомнения, десятикилометровое отступление было лишь ловушкой для дураков, специально предназначенной для того, чтобы англичане поверили, что французская мобилизация была мирная мобилизация» (М. Демарсьяль в \"<em>LÉvangile du Quai d'Orsay</em>\", 1926 г.).</p>\n</blockquote>\n<p> Большая часть лжи, распространяемой в Великобритании, исходила из-за Ла-Манша. Французы были знатоками фальшивых фотографий; примеры приведены под этим заголовком. Инсинуации в их безжалостных карикатурах также оказали значительное влияние на тех, кому нравятся картины.</p>\n<p> Ложь во Франции была, многие из них, такой же, как и та, которой нас снабдили здесь. Но их метод был более обширным и тщательным, как показывают разоблачения в «За кулисами французской журналистики» «Французского главного редактора», из восьмой главы которой взяты следующие выдержки.</p>\n<blockquote>\n<p>\"...Если свести ложь к научной системе, обложить ее толстым и тяжелым, с большим усилием и достаточными финансами разбросать ее по миру как чистую правду, то можно надолго обманывать целые народы и гнать их на резню по причинам, к которым они не имеют ни малейшего интереса. Мы достаточно убедились в этом во время прошлой войны и увидим в следующей, с помощью которой доброе провидение неуклюже попытается решить проблему перенаселения</p>\n</blockquote>\n<blockquote>\n<p>». Мы пришли к выводу сразу и очень правильно, что недостаточно воспламенить массы на войну и, чтобы избежать обвинения в воинственности, представить врага опасным возмутителем спокойствия и самым страшным врагом человечества.</p>\n</blockquote>\n<blockquote>\n<p>«Мы не стали дожидаться процедуры лорда Нортклиффа. Под влиянием момента мы осознали огромную важность воодушевления общественного мнения для нашего более или менее справедливого дела. Уже через три дня после начала войны Вивиани обнародовал закон, который в тот же день была принята палатой и сенатом и в качестве первого взноса мощной пропаганды выделила ничтожную сумму в двадцать пять миллионов франков золотом на создание La Maison De La Presse, гигантского здания, Франсуа Улица 3, пять этажей, без подвала, где расположены типографии, и цокольный этаж с его большим залом собраний.Суетливое, оживленное движение, как в улье, прибывающие грузовики, элегантные автомобили с претенциозным видом. В двухстах комнатах расположены мастерские, кабинеты, гостиные и приемные, где живут те обезумевшие от войны герои, мужество которых растет по мере удаления от окопов. Пятый этаж, накрытый стеклянной крышей, все это воплощение концентрированной пропаганды. В подвале стояло оборудование, необходимое для печати и размножения, под стеклянной крышей работал фотохимографический отдел. Основная его работа заключалась в фотографировании и вырезании деревянных фигур с отрезанными руками, вырванными языками, выколотыми глазами, раздробленными черепами и обнаженными мозгами. Сделанные таким образом снимки были разосланы как неопровержимые доказательства немецких зверств во все концы земного шара, где они не преминули произвести желаемый эффект. В тех же комнатах были сделаны фиктивные фотографии разбомбленных французских и бельгийских церквей, оскверненных могил и памятников, сцен разорения и запустения. Постановкой и росписью этих сцен занимались лучшие художники-декораторы Парижской Гранд-Опера... Дом печати был неутомимым гейзером, изрыгавшим непрестанно ложные военные донесения и фиктивные известия с тыла и фронта, самые подлые и самые зверские клеветы на противников, поразительные выдумки приписываемых им гнусных деяний. Коварный, но действенный яд, распространяемый таким образом, ввел в заблуждение и заразил множество благонамеренных, но неискушенных людей ... Во время войны ложь стала патриотической добродетелью. Оно было навязано нам правительством и цензурой и считалось необходимостью из-за опасности проиграть войну; кроме того, ложь была выгодна и часто публично почиталась. Было бы бесполезно отрицать успех лжи, использовавшей прессу как лучшее средство широкого и быстрого распространения. Были предприняты величайшие усилия, чтобы заклеймить каждое слово врагов как ложь, а каждую свою ложь как абсолютную истину. Все шло под флагом \"Пропаганды.?\"</p>\n</blockquote>\n<p> Воспитанием детей не пренебрегали. В «Le Matin» от 12 ноября 1915 года был параграф, озаглавленный «Учителям».</p>\n<blockquote>\n<p>«Все французские школы должны иметь коллекцию карточек «Немецкие преступления», чтобы навсегда запечатлеть в детях зверства варваров.говорилось</p>\n</blockquote>\n<p> , что известный художник создал дюжину композиций, посвященных наиболее ярким эпизодам немецких преступлений.</p>\n<blockquote>\n<p>«...Учителя, подпишитесь сегодня и разместите эти картины в своих школах».</p>\n</blockquote>\n<p> Искажения прессы были столь же распространены во Франции Как и в других странах, уже 25 июля 1914 г. Г-н Бертло, бессменный глава министерства иностранных дел г-на Пуанкаре, добился публикации в «Эхо де Пари» сильно искаженного отчета о тихоокеанских беседах между Бьенвеню Мартином и бароном Шоном. И \"Le Matin\". Правительство и пресса во Франции гораздо легче подчинили общественное мнение, чем в нашей стране. Поэтому было меньше необходимости в хитрости, больше шансов на сокрытие и мало опасений, что самая грубая ложь не будет раскрыта. Согласно epted, при условии, что они имели отличительный признак какой-то власти. Кроме того, во Франции меньше склонности проверять истории и заявления, которыми они были обмануты, и разоблачать их лживость теперь, когда все кончено. Тем не менее ни один народ не осознает глупейшей тщетности войны и ее бессмысленного варварства более разумно, чем простой народ Франции.</p>\n<p> (С) Соединенные Штаты.</p>\n<p> Не было более богатого поля для пропаганды, чем Соединенные Штаты Америки в первые годы войны. Союзные державы и центральные державы усердно соперничали друг с другом. Немецкий метод начинался с того, что был слишком тонким. Беспроводное информационное агентство, находящееся под контролем Германии, поначалу передавало самые лучшие, самые достоверные, непредвзятые и, безусловно, самые дешевые военные новости и, таким образом, привлекало большое количество подписчиков и кормило американскую прессу. Шли месяцы, и их новости стали изобретательно «наклоняться» в пользу Центральных держав. Но они слишком полагались на аргументы. Более грубые британские методы оказались гораздо более успешными, и интенсивную работу проделала британская военная миссия, которая (как заявил лорд Нортклифф в «Таймс» от 16 ноября 1917 г.) состояла из 500 чиновников и 10 000 помощников. Зверства, исключительная ответственность Германии, преступный кайзер и все другие измышления, затеянные в Великобритании, были с большим успехом сфабрикованы американскими лжецами. Бельгийский ребенок без рук был особым фаворитом. Вряд ли было домохозяйство, в котором бы это не обсуждалось на всем огромном континенте, и даже такая нелепая паника, как бетонные платформы для немецких орудий, была в ходу в Калифорнии. Шпионских историй было предостаточно, и те, кто настаивал на вступлении Америки в войну, снимали эффективные фильмы. Один особенно хороший имел дело с миролюбивым духом, который сначала преобладал. Вместо того чтобы высмеивать его, герой-пацифист изображался прекрасной, благородной фигурой, выделяющейся на фоне волнения, окружавшего его. Вторжения иностранной армии были изображены графически и драматично. Жгли деревни, уводили женщин, совершали различные жестокости. Представитель иностранной державы с безошибочно немецким выражением лица изображался как отвратительный негодяй, замышляющий заговоры со злыми намерениями. Был особенно хорош «крупный план» его, закатившего глаза с мефистофелевой хитростью, в галерее Конгресса. В конце концов герой-пацифист, увлеченный своими патриотическими чувствами, не выдерживает и с энтузиазмом поддерживает войну.</p>\n<p> После того, как Америка вступила в войну, был выпущен ряд фильмов «настоящих военных картин» (подготовленных в Голливуде). Комитет общественной информации нанял огромную армию ораторов и памфлетистов, и страна была наводнена литературой, описывающей беззакония гуннов.</p>\n<p> Трагедия гибели «Лузитании», которая, конечно же, стала поворотным моментом, была искажена до крайности. Истории о зверствах и поддельные фильмы в большей степени воздействовали на чувства женщин, поэтому, когда нейтралитет был отменен и заменен фразой «Ты нужен дяде Сэму», потребовалось очень мало дней, чтобы привести в чувство всю страну. Когда Америка оказалась в состоянии войны, вся пропаганда союзных наций была использована и еще более преувеличена.</p>\n<p> Среди активных патриотов выделялся Джон Р. Рэтом своими статьями в журнале «Providence Journal» и многочисленными лекциями. В 1917 и 1918 годах он вел кампанию против всех, кого можно было заподозрить в симпатиях к Германии. Его шпионские истории были сенсационными, и, как говорили, его тренировала британская секретная служба. В феврале 1918 года он публиковал серию статей о «Разоблачении заговора в Германии», когда газета «Нью-Йорк уорлд» прекратила их выпуск, так как они были подозрительны и считали статьи фальшивыми. В 1920 году Франклин Д. Рузвельт обвинил его в распространении ложных и клеветнических клевет, и в ходе допроса он признал, что «свободно опирался на свое воображение». В конце концов он был полностью дискредитирован, но только после того, как «Ратомания» добилась значительного успеха за то время, когда это имело значение.</p>\n<p> Некоторая ложь, малоизвестная здесь, по-видимому, успешно распространялась и была проглочена в Америке, например: отравленные леденцы, сбрасываемые немецкими самолетами для еды детей; бесчинства монахинь в бельгийских монастырях; обрезание ушей капеллану уланами; и немецкое обожествление Гинденбурга гимном «Hindenburg ist unser Gott» (кто-то с недостаточным знанием немецкого языка или слухом слышал гимн Лютера «Ein feste Burg ist unser Gott»). Преследование немцев и всего немецкого предпринималось с усердием; Вагнера неблагоприятно сравнивали с Соузой. Подчеркивалась опасность квашеной капусты, и люди выкапывали из своих огородов «холостяцкие пуговицы», как национальный цветок Германии. Безумие, с которым велась вся пропаганда в Америке, превосходило все, что мы испытали здесь. Америка, страна крайностей, цвет и акцент должны достичь исключительно высокого тона, прежде чем кто-то обратит на это внимание.</p>\n<p> В октябре 1918 года, когда часть лжи стала слишком нелепой и нелепой, генерал Першинг и военное министерство Соединенных Штатов санкционировали публикацию следующей телеграммы:</p>\n<blockquote>\n<p>«В недавно полученной здесь бумаге из Сент-Луиса (Миссури) говорится, что сержант, из пятидесяти человек, отправленных обратно в связи с кампанией «Заем свободы», произносит речи, в которых заявляет: «Немцы дают отравленные конфеты детям, чтобы они ели, и ручные гранаты, чтобы они могли с ними играть. Они радуются умирающим корчам детей и громко смеются, когда взрываются гранаты. Я видел, как один американский мальчик лет семнадцати, попавший в плен к немцам, возвращался в наши окопы. У него была вата внутри и вокруг его машин. Я спросил кого-то, для чего нужен хлопок. «Немцы отрезали ему уши и отправили обратно сказать нам, что хотят сражаться с людьми», — был ответ. «Они кормят американцев микробами туберкулеза». Поскольку на самом деле нет никаких оснований для таких заявлений, основанных на любом опыте, который у нас был, я рекомендую, чтобы этот сержант, если приведенные выше заявления были сделаны им, был немедленно возвращен в строй и чтобы эти заявления были опровергнуты. Першинга»</p>\n</blockquote>\n<p> Американская версия истории о распятии возникла из следующего заявления американского солдата:</p>\n<blockquote>\n<p>«Это было 23 октября 1918 года, когда наш отряд, пятая морская пехота, вторая дивизия, вошел в Сюип, расположенный к северу от Шалона и к западу от Аргоннский лес, деревня, только что эвакуированная немцами. Там мы нашли голую девушку, прибитую к двери сарая. Кроме того, около половины гробов на деревенском кладбище были вырваны из могил и вскрыты, по-видимому, с намерением их</p>\n</blockquote>\n<p> ограбить». Сообщение от 2 февраля 1919 г., в котором было дано описание предполагаемого инцидента, сопровождаемое рисунками, а не фотографиями. Поскольку</p>\n<p> дело было передано в Государственный архив Германии, 27 сентября 1924 г. Было заявлено:</p>\n<blockquote>\n<p>«В течение 1918 г. Немцев не было в Сюиппе, расположенном на Сюиппе и к северо-востоку от Шалона. Немецкий фронт, особенно в октябре 1918 г., проходил севернее Суэна. Эта деревня была во владении французов, а деревня Сюип находится в семи километрах к югу</p>\n</blockquote>\n<p> .</p>\n<blockquote>\n<p>»девушку распяли, ибо об этой сказке здесь ничего не известно. То, что могилы были разграблены, возможно, но только не на кладбище Сюип»</p>\n</blockquote>\n<p> . (\"Долг перед цивилизацией\" Фрэнсиса Нильсона)</p>\n<p> Ужасные жестокости, приписываемые немецким командирам подводных лодок, также были широко распространены. В апреле 1923 года адмирал Симс заявил в \"Нью-Йорк Трибьюн\":</p>\n<blockquote>\n<p>\"Нет достоверных сообщений о жестокостях, когда-либо совершенных командиром или экипаж немецкой подводной лодки. Сообщения прессы о жестокостях предназначались только для пропагандистских целей».</p>\n</blockquote>\n<p> Следы потока лжи все еще сохраняются сегодня среди наиболее невежественных слоев населения. Вся военная лихорадка исходила.</p>\n<p> Г-н Кирби Пейдж резюмирует деятельность Комитета общественной информации:</p>\n<blockquote>\n<p>«Изучение всей этой пропаганды выявляет преувеличения и искажения, которым подвергалась американская общественность... Каждое правительство систематически планировало обмануть свою собственную людей, и везде царила жесткая цензура».</p>\n</blockquote>\n<p> Недавно профессор Лассуэлл из Чикаго опубликовал интересную книгу о методах пропаганды («Техника пропаганды в мировой войне», Гарольд Д. Лассуэлл), из которой можно извлечь следующий отрывок. Цитата:</p>\n<blockquote>\n<p>«Психологическое сопротивление войне в современных странах настолько велико, что каждая война должна снова казаться войной оборонительной. St угрожающий, кровожадный агрессор. Не должно быть никакой двусмысленности в отношении того, кого общественность должна ненавидеть. Война должна быть не из-за мировой системы ведения международных дел, не из-за глупости или злобности всех правящих классов, а из-за жадности врага. Вину и бесхитростность надо оценивать географически, и вся вина должна быть по ту сторону границы. Если пропагандист должен мобилизовать ненависть людей, он должен позаботиться о том, чтобы распространялось все, что устанавливает исключительную ответственность врага».</p>\n</blockquote>\n<p> Г-н Джордж Крил был в Соединенных Штатах эквивалентом лорда Нортклиффа. Его бюро 825 670,23 доллара, которые можно было использовать на расходы».</p>\n<p> 1) Италия.</p>\n<p> Пропаганда в Италии приняла несколько иную форму. Задача правительства состояла в том, чтобы сформулировать политику, которая оправдала бы вступление Италии в войну и вселила бы в народ надежду на определенную выгоду.не столько моральное негодование, сколько политические амбиции, которые нужно было удовлетворить.</p>\n<p> возбудить Правительство и пресса развернули мощную кампанию лжи.</p>\n<p> Мадзини однажды сказал: «Истрия наша; она необходима Италии так же, как форты (forti) Далмации необходимы южным славянам».</p>\n<p> Имя Мадзини имело значение, и это высказывание было воспроизведено в газете барона Сонино «Giornale d'Italia» (11 марта 1918 г.): «Истрия наша; она необходима Италии так же, как форты (forti) Далмации необходимы Южной Италии».</p>\n<p> Когда в Палате указали на ложность этого утверждения, был дан ответ, что это «вина печатника».</p>\n<p> Николо Томассо, патриот далматинского происхождения, который до своей смерти в 1873 году был сторонником конфедерации южных славян, также без всяких доказательств был объявлен сторонником аннексии Далмации Италией.</p>\n<p> Еще более смехотворной фальсификацией была публикация в миланской газете длинного письма не кого-нибудь, а Авраама Линкольна, написанного, как утверждается, в 1853 году, в котором американский президент передал Италии все восточное побережье Адриатики, как а также Корсика и Мальта. Мадзини, который, прочитав его, расплакался, собственноручно перевел письмо, и Кардуччи и де Амичис выразили им свое восхищение. Казалось любопытным, что о столь важном документе никогда раньше не было слышно. Но, к сожалению, Авраам Линкольн, определяя различные территории, которые должны быть отнесены к Италии, использовал выражения «Venezia Tridentina» и «Venezia Giulia», обозначения, которые были впервые использованы в 1866 г. Всеобщее осмеяние французов, обезьяны парижанина. Он достаточно рад ловить рыбу в мутной воде, где не существует ни одной из тех опасностей, которых он старается избежать, насколько это возможно, как он уже показал в 1913 году.</p>\n<p> Та же газета писала после объявления войны:</p>\n<p>«Румыны теперь самым поразительным образом доказали, что они достойные сыновья древних римлян, от которых они, как и мы, произошли. Таким образом, они являются нашими ближайшими братьями, которые теперь с тем мужеством и решимостью, которые являются их особыми качествами , принимают участие в борьбе латинской и славянской расы против германской расы ... Действительно, ничего другого нельзя было ожидать от народа, который имеет честь принадлежать к той латинской расе, которая когда-то правила миром».</p>\n<p> До итальянской интервенции пресса в Италии была, как легко себе представить, массой противоречивых сообщений от воюющих сторон с обеих сторон, обвинений, встречных обвинений, обвинений в зверствах и опровержений, запугиваний, шпионских историй и всевозможных «новостей», которые просачивались не только из Великобритании, Франции, России и центральных держав, но и с фабрик более зловещих и сенсационных репортажей на Балканах.</p>\n<p> День за днем ​​публиковались совершенно ненадежные и противоречивые отчеты об обращении с кардиналом Мерсье. Папским властям пришлось отрицать существование радиотелеграфной станции в Ватикане. Большое волнение вызвало сообщение о существовании секретной фабрики по производству бомб в международной школе, которой руководили бенедиктинцы на Авентине, что было доказано полицейским расследованием безосновательно (Corriére della Sera, 11 мая 1915 г.). Вечерняя миланская газета сообщила, что немецкие шпионы были обнаружены и арестованы карабинерами, когда они составляли карты железнодорожных путей. Выяснилось, что это граждане Милана, тестирующие камеру, и их сразу же отпустили.</p>\n<p> Заявления в прессе о том, что готовность Франции вести переговоры с Германией была предотвращена британскими угрозами репрессалий (январь 1915 г.), должны были быть опровергнуты посольствами Великобритании и Франции в Риме.</p>\n<p> Хороший пример замалчивания, порождающего ложь, можно найти в искаженном отчете о парламентском вопросе в апреле 1915 года.</p>\n<p> Мистер Ченселлор спросил заместителя военного министра:</p>\n<blockquote>\n<p>«Имеется ли какая-либо официальная информация, свидетельствующая о том, что двести человек, принадлежавшие к одному кавалерийскому полку, стали серьезно болен с признаками заражения крови после прививки от брюшного тифа; если да, то не скажет ли он, умерли ли двое или трое из них; были ли два врача, проводившие прививку, по расследованию признаны австрийцами, судимы военным трибуналом и приговорен к каторжным работам...»</p>\n</blockquote>\n<p> Г-н Теннант ответил:</p>\n<blockquote>\n<p>«Нет официальной информации, соответствующей утверждениям в первых трех частях вопроса. Никто не слышал об австрийских врачах, приговоренных к каторжным работам. \"</p>\n</blockquote>\n<p> Вопрос без категорического официального опровержения этой истории был воспроизведен как заявление в «Corriére della Sera» от 18 апреля с целью, конечно, разжечь антиавстрийские настроения.</p>\n<p> Каждое сообщение о возможном присоединении Италии к одной стороне авторитетно отвергалось другой стороной, и постоянно появлялись различные предполагаемые взятки территории. Ложные сообщения о боях и приготовлениях на Балканах и в других местах помогали держать умы несчастных итальянцев в полном замешательстве.</p>\n<p> Военная ложь из России, Балкан и других частей света, к сожалению, недоступна коллекционеру. В то время как некоторые из них, возможно, были более зловещими и фантастическими, они, если бы их читали, вряд ли послужили бы по сравнению с ними для смягчения грязных потоков лжи, которые нашли свой источник в великих цивилизованных христианских странах мира.</p>\n<p> Нужны ли еще доказательства того, что международная война есть чудовище, порожденное лицемерием, питающееся ложью, откармливаемое обманом, поддерживаемое суевериями, направленное на смерть и пытку миллионов, не достигшее высоких целей, унижающее человечество, подвергающее опасности цивилизацию и приносящее в своих муках отвратительный выводок раздоров, конфликтов и войн, еще больше войн? Тем не менее, государственные деятели все еще не решаются обнажить меч своего разума, чтобы уничтожить его.\nКонец.</p>\n<!-- book end -->\n<p><a href=\"/tags/%D0%BA%D0%BD%D0%B8%D0%B3%D0%B8\">#книги</a> <a href=\"/tags/%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0_%D1%81_%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D0%BC%D0%B8\">#работа<em>с</em>данными</a></p>\n","ogImage":{"url":"/assets/blog/falsehoodInWarTime/background.png"},"coverImage":"/assets/blog/falsehoodInWarTime/background.png","issueId":"23"}},"__N_SSG":true}