{"pageProps":{"post":{"title":"Первый пост с использованием markdown и next js","titleEnabled":true,"date":"2020-05-03T21:00:07.322Z","slug":"hello-world","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"<p>Необходимость создать свой блог назревала уже много месяцев (а может быть и лет). Не для публичности. А лишь для того, чтобы куда-то складывать собственные идеи и отчеты об безумных экспериментах.</p>\n<h2>Хеллоу, ворлд, товарищи</h2>\n<p><img src=\"/assets/blog/hello-world/Hello_world.gif\" alt=\"Hello World\"></p>\n<p>Представлюсь, чтобы не забыть собственное имя. Меня зовут Носов Роман. И я программист. Не очень хороший программист, зато интересный. Люблю танцы с бубном и изобретать велосипеды. (О которых будет информация в моих дальнейших постах.) </p>\n<h2>Нелёгкая это задача — выбирать стек</h2>\n<p>Как и всегда, мозг найдет миллион причин для прокрастинации. В моём случае — это была проблема выбора стека — на чём же хостить, и как организовывать свой блог.</p>\n<h3>Какие были претенденты:</h3>\n<ol>\n<li><em>PHP + MySql + WordPress + VDS</em> — очень скучно и избито, медленно, и загрузит и без того мой слабенький сервер.</li>\n<li>Что-нибудь маленькое, милое, и самописное с нуля — лень</li>\n<li><em>Medium/Яндекс Дзен</em> — интересно. Но всё-таки хочется чуть большей свободы действий и отсутствия большой и страшной модерации.</li>\n<li>... Что-нибудь ещё, что посоветует гугл</li>\n</ol>\n<p>Долго разрываясь между разными инструментами для ведения блога, я всё-таки выбрал статический сайт на <strong>next.js</strong> + <strong>markdown</strong>. Почему? Потому что я очень не хочу думать о том, в каком состоянии мой хостинг — не лежит ли он от DDOS'a, не забыл ли я за него вовремя заплатить, и т.д.</p>\n<p>В то время, как статический сайт можно без зазрения совести залить на бесплатный и ооочень быстрый <em>github pages</em>, привязать к нему свой домен и наслаждаться жизнью, постепенно набрасывая постики на markdown.</p>\n<p>Ещё увидимся.</p>\n<p>#болтология </p>\n","ogImage":{"url":"/assets/blog/hello-world/завтра_будет_лучше.jpg"},"coverImage":"/assets/blog/hello-world/завтра_будет_лучше.jpg","issueId":"1"}},"__N_SSG":true}