{"pageProps":{"post":{"title":"Пробросить VPN+RDP подключение на домашний компьютер: пособие для маленьких и тупых","date":"2021-06-11T19:06:05.108Z","slug":"hamachi-on-chromebooks","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"<p>Так уж вышло, что бывает нужно с работы/поездки/откуда-то_ещё подключаться к домашнему компьютеру. Например, чтобы показать свой проект на презентации. Или подключиться к локальному сервису, развернутому на машине.</p>\n<p>Но что, если ситуация усложняется тем, что ты дурак и купил хромбук вместо нормального устройства?</p>\n<p><img src=\"../assets/blog/hamachi-on-chromebooks/chromebooks.jpg\" alt=\"Chromebook meme\"></p>\n<p>Выход через оконный проём всегда имеется. И даже есть постой и понятный путь решения задачи: развернуть <em>l2tp/ipsec</em> VPN-сервер (например, великолепный <a href=\"https://www.softether.org/\">SoftEtherVPN</a>), который бы торчал наружу, и подключить к нему все необходимые устройства. </p>\n<p>Более того, <strong>именно такая схема</strong> у меня и была раньше. <em>(Пока я не забывал платить за VDS)</em></p>\n<h2>Ковальски, варианты!</h2>\n<p>Есть максимально <strong>тупой и небезопасный</strong> путь: вытащить из-за <strong>NAT/фаерволов</strong> \"<em>наружу</em>\" домашний компьютер и подключать напрямую. Но если комплюхтер на шиндоусе, все мы с вами знаем, с какой скоростью к нему получит доступ кто-нибудь ещё... </p>\n<p>Какой-нибудь абстрактный лейтенант <em>КейДжиБи</em> спустя несколько секунд сделает из домашнего компьютера хранилище <strong>ц</strong>ентральных <strong>п</strong>роцессоров. И меня же за это посадит. </p>\n<h2>А есть какой-то VPN для бедных?</h2>\n<p>Мне вспомнился легендарный сервис, который знал каждый школьник моего детства. Именно через него играли во всякие доты, контерстрайки, и <a href=\"https://smallgames.ws/18239-uboijnoe-delo.html\">убойные дела</a> -- <a href=\"https://www.vpn.net/\">Hamachi</a>.</p>\n<p>С тех пор, как я им в последний раз пользовался, он сильно коммерциализировался и стал ограничивать сети лишь 5-ю устройствами, а за увеличение лимита вымогать деньги. Довольно мерзко, но для личного использования должно хватить. </p>\n<p>Суть этой софтины в том, что она <em>не предоставляет</em> VPN-сервер в классическом понимании (не пропускает весь шифрованный трафик через себя). А лишь <em>\"знакомит\"</em> устройства сети друг с другом, и помогает им поднять <strong>P2P</strong> подключение. Т.е. пинг и скорость подключения будут ровно такими же, как если бы устройства подключались напрямую без дополнительного софта. Но при этом устройства будут продолжать быть глубоко за NAT и быть недоступны для внешних глаз. </p>\n<h2>А дальше что?</h2>\n<p>Создать аккаунт и свою приватную сеть на <a href=\"https://www.vpn.net/\">официальном сайте</a> элементарно. Но для меня оставалось загадкой: смогу ли я подключиться к этой сети из своего экзотического хромбука?</p>\n<p>Найти клиент под windows не составляет труда. А вот страница скачивания ARM-linux-клиента меня встретила вот таким выбором:</p>\n<p><img src=\"../assets/blog/hamachi-on-chromebooks/hamachi.png\" alt=\"Выбор клиента под ARM\"></p>\n<p>Во первых, вы узнаём, что билд под <strong>ARM</strong> до сих пор остаётся в <em>beta</em>. Но мы не будем использовать его в <em>production</em>, так ведь? :) Во вторых мне предлагают выбрать между <strong>ARMEL</strong> и <strong>ARMHF</strong> версиями. И я тут впервые столкнулся с этими аббревиатурами. </p>\n<p><a href=\"https://linuxhint.com/about-arm64-armel-armhf/\">Быстрым гуглением выяснилось</a>, что <strong>ARMHF</strong> -- это процессоры с хардварным обработчиком операций над <em>floating-point-числами</em>, а <strong>ARMEL</strong>, соответственно, софтверным. </p>\n<p>Поскольку я живу в 2021 году, то выбрал deb-пакет с ARMHF. Но при установке меня ждало следующее испытание:\nустановщик сваливался с ошибкой, где ругался на то, что архитектура ARM64 != ARMHF. </p>\n<h2>Що робити? Гуглити!</h2>\n<p><a href=\"https://community.logmein.com/t5/LogMeIn-Hamachi-Discussions/Hamachi-for-ARM-HF-getting-error-167-while-trying-to-connect-to/td-p/138634\">Вот тут</a> нашел возможное решение. Там юзверь смог установить и запустить ARMHF-версию после того, как добавил эту архитектуру в <strong>dpkg</strong> и установил для неё libc6 и libstdc.</p>\n<pre><code class=\"language-bash\">sudo dpkg --add-architecture armhf\nsudo apt-get update\nsudo apt-get install libc6:armhf\nsudo ln -s /lib/ld-linux-armhf.so.3 /lib/ld-linux.so.3\nsudo apt-get install libstdc++6:armhf\n</code></pre>\n<p>После таких танцев с бубном, deb-пакет с hamachi успешно устанавливается. Осталось подключиться к созданной ранее сети:</p>\n<pre><code class=\"language-bash\">sudo /etc/init.d/logmein-hamachi start\nsudo hamachi set-nick chromebook\n# sudo hamachi join %network id% %network password% у меня (как и у того пользователя) не завелось\n# возвращая безымянную ошибку #167 \n# но можно привязать свой аккаунт logmein к этому клиенту. И подключиться к сети через веб-интерфейс\nsudo hamachi attach %почта, используемая при регистрации%\n</code></pre>\n<p>После этого в <a href=\"https://www.vpn.net/\">личном кабинете</a> появится запрос на подключение клиента. Нужно его подтвердить и привязать к сети. На этом любопытная часть закончилась. VPN на хромбуке поднят. Если всё пошло, как и ожидалось -- в терминале мы должны видеть примерно следующее:</p>\n<pre><code class=\"language-bash\">sudo hamachi \n  # version    : 2.1.0.203\n  # pid        : 1150\n  # status     : logged in\n  # client id  : XXX-XXX-XXX\n  # address    : XXX.XXX.XXX.XXX    %ipv6addr%\n  # nickname   : chromebook\n  # lmi account: %your email%\nsudo hamachi list\n#  * [XXX-XXX-XXX]%network name%  capacity: 1/5, subscription type: Free, owner: %your email%\nip addr show\n# >> Появился интерфейс\n#3: ham0: &#x3C;BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1404 qdisc pfifo_fast state UNKNOWN group default qlen 1000\n</code></pre>\n<h2>На стороне домашнего компьютера</h2>\n<p>Подключение к Hamachi из-под windows-x64 происходит без каких-либо дополнительных сложностей: просто скачиваем клиент, запускаем, логинимся, радуемся поднятым VPN.</p>\n<h2>Поднимаем RDP сервер</h2>\n<h3>А нахрена?</h3>\n<p>Конечно, для простого удалённого управления можно воспользоваться <strong>Chrome Remote Desktop</strong>. Но в нём очень куцая функциональность. Например, он не может шарить буфер обмена, файлы и подключенные по USB устройства между компьютерами. А классический RDP делает это элементарно из коробки. </p>\n<p>Что-ж. Чтобы включить RDP сервер на PRO* версиях windows нужно лишь нажать на переключатель в настройках. Но если вы  <del>жадный русский</del> бедный житель страны третьего мира, то внезапно можете обнаружить вот такую заглушку:</p>\n<p><img src=\"../assets/blog/hamachi-on-chromebooks/rdp_not_working.png\" alt=\"Windows 10 home: try to enable RDP server\"></p>\n<p>По умолчанию в эту сборку не входит RDP сервер. Но есть замечательный проект на гитхабе, который поможет решить проблему: <a href=\"https://github.com/stascorp/rdpwrap\">RDPWrap</a>. Сия шайтан-софтина не очень friendly в установке и у меня завелась только после такого алгоритма действий (<a href=\"https://github.com/stascorp/rdpwrap/issues/999\">который я подсмотрел здесь</a>):</p>\n<ul>\n<li>Скачал релиз в zip (а не инсталлятор)</li>\n<li>Добавил папку с распакованными фалами в исключения защитника шиндовс</li>\n</ul>\n<p><img src=\"../assets/blog/hamachi-on-chromebooks/exceptions_microsoft_guard.png\" alt=\"Исключение защитника\"></p>\n<ul>\n<li>Запустил install-скрипт</li>\n<li>Погасил сервер</li>\n<li>Заменил ini-файл <a href=\"https://raw.githubusercontent.com/affinityv/INI-RDPWRAP/master/rdpwrap.ini\">на тот, что здесь</a>.</li>\n<li>Запустил сервис</li>\n</ul>\n<pre><code class=\"language-bash\">install.bat\nnet stop termservice\n# Подменил ini-файл в директории C:\\Program Files\\RDP Wrapper\\rdpwrap.ini\nnet start termservice\n</code></pre>\n<ul>\n<li>...</li>\n<li>PROFIT!</li>\n</ul>\n<p><img src=\"../assets/blog/hamachi-on-chromebooks/profit.jpg\" alt=\"PROFIT\"></p>\n<h2>Всо</h2>\n<p>На этом этапе должно уже всё заработать. Из-под хромбука по RDP можно подключаться через <a href=\"https://www.freerdp.com/\">FreeRDP</a> клиент, который есть в apt и уже был <a href=\"./remote-workplace-linux\">описан вот здесь</a>.</p>\n<p>К остальным поднятым сервисам можно будет \"достучаться\" также, как если бы компьютеры были в локальной сети. ¯\\<em>(ツ)</em>/¯</p>\n<iframe frameborder=\"0\" style=\"border:none;width:100%;height:180px;\" width=\"100%\" height=\"180\" src=\"https://music.yandex.ru/iframe/#track/76128507/13437222\">Слушайте <a href='https://music.yandex.ru/album/13437222/track/76128507'>Веснянка</a> — <a href='https://music.yandex.ru/artist/4827898'>Go_A</a> на Яндекс.Музыке</iframe>\n","ogImage":{"url":"/assets/blog/hamachi-on-chromebooks/background.jpg"},"coverImage":"/assets/blog/hamachi-on-chromebooks/background.jpg","issueId":"21"}},"__N_SSG":true}