{"pageProps":{"post":{"title":"Авторесайз объединенных ячеек в EXCEL","date":"2020-09-25T18:08:48.775Z","slug":"autoresize-excel-tables","author":{"name":"Roman A. Nosov","picture":"https://avatars3.githubusercontent.com/u/21103635?s=120&v=4","url":"https://github.com/JustAddAcid"},"content":"<p>Прежде чем перейти к сути, давайте на минуточку остановимся и осознаем всю степень сюрреализма, который творится в государственном документообороте. Подумайте над тем, что если вы отправляете государству какую-то распечанную <em>EXCEL</em> табличку на бумажке(потому что именно так требует закон), то на принимающей стороне есть <strong>ОТДЕЛЬНЫЙ, МАТЬ ЕГО, ЧЕЛОВЕК</strong>, который руками забивает эти данные куда-то себе в базу?</p>\n<p>Осознали? Прекрасно. Продолжаем.</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/lN-Y242GOgk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>Так уж исторически сложилось, что часто по работе люди встречаются со \"стандартными\" формами в <em>EXCEL</em>, которые нужно автоматически растягивать в зависимости от контента в ячейках. </p>\n<p>Казалось бы, достаточно распространённая тема, по которой <strong>уйма</strong> информации в этих ваших интернетах. Но проводить по этому поводу ликбез мне уже приходилось несколько раз за последние пару месяцев. Так что, лучше <strong>записать</strong> это дерьмо, чтобы не повторять одно и то же. И потратить сэкономленное время на <del>прокрастинацию</del> более важные дела.</p>\n<h2>Формулируем задачу</h2>\n<p>Представим ситуацию, в которой есть какая-то программа, которая на основании данных в <em>БД</em> заполняет какой-то <em>ГОСТ</em>-овский <em>EXCEL</em>-темплейт данными, который в будущем кому-то отправляется и/или распечатывается. И в этой (уже абсурдной) ситуации совершенно никому не хочется тратить собственное время на растягивание ячеек вручную. И очень хочется как-то этот процесс автоматизировать.</p>\n<h2>Чо делать?</h2>\n<p><del>do a barrel roll</del></p>\n<p>Ресайзить макросом, очевидно. Тут у нас два пути в зависимости от того, насколько над нами хотят поиздеваться окружающие:</p>\n<h3>Самый простой вариант</h3>\n<p>Это когда мы видим, что в документе напрочь отсутствуют объединённые ячейки, которые нужно ресайзить. А ресайзинг одиночных — <em>EXCEL</em> поддерживает нативно. Достаточно ругнуться на него вот такой командой:</p>\n<pre><code class=\"language-vb\">Cells.EntireRow.AutoFit ' Растянуть ячейки в высоту по контенту\n' Или\nCells.EntireColumn.AutoFit ' Растянуть ячейки в ширину по контенту\n\n' Или, на конкретную ячейку \nОбъектЯчейки.EntireColumn/EntireRow.AutoFit \n</code></pre>\n<h3>Вариант \"как всегда\"</h3>\n<p>Но если вы читаете это, то скорее всего, у вас возникли сложности посерьёзнее. Вероятно, у вас самый обычный документ, в котором огромное количество связанных ячеек.</p>\n<p><em>Що робити в цій ситуації?</em></p>\n<p>Можно, конечно, попробовать изобрести очередной велосипед. А можно воспользоваться готовым кодом, который честно <del>спиз</del> сохранил из интернетов ваш покорный слуга.</p>\n<p>Автором кода числится некий <strong>The_Prist (Щербаков Дмитрий)</strong> с сайта <a href=\"https://www.excel-vba.ru\">excel-vba.ru</a>. Идея кода в том, что скрипт сначала временно отключает объединение ячеек, ресайзит первую ячейку с текстом нативными методами экселя, а затем объединяет ячейки обратно.</p>\n<p>Получается достаточно просто и лаконично. Я лишь от себя добавил в код небольшой фикс, чтобы учитывались паддинги и масштабирование не \"съезжало\" при большом количестве ячеек.</p>\n<p><a href=\"https://github.com/JustAddAcid/Excel_RowHeightForContent\">Репозиторий с кодом можно найти здесь.</a></p>\n<p>Как этим пользоваться:\n1. Проверить, что у вас тип файла с поддержкой макросов (с \"m\" на конце)\n2. Залезть в <em>Вид</em> -> <em>Макросы</em> -> <em>Ввести %randomName%</em> -> <strong>Создать</strong>\n3. ПКМ по <em>Modules</em> -> <em>Insert</em> -> <strong>Module</strong>\n4. Скопировать содержимое файла <strong>RowHeightForContent.vb</strong> из <a href=\"https://github.com/JustAddAcid/Excel_RowHeightForContent\">репозитория</a> в новый созданный модуль\n5. Вызвать <strong>RowColHeightForContent</strong> с нужными ячейками. </p>\n<p>Но! Один вызов функции принимает в аргументы рейндж <strong>из одной</strong> связанной ячейки. Нельзя сразу выделить всю страницу и попытаться её отмасштабировать.  </p>\n<p>Итоговый код вызова будет примерно вот таким</p>\n<pre><code class=\"language-vb\">' Две статичные ячейки\nRowColHeightForContent ActiveWorkbook.Sheets(1).Range(\"S32\")\nRowColHeightForContent ActiveWorkbook.Sheets(1).Range(\"AV30\")\n\nDim i As Integer\n\n' Масштабирование строк в таблицах циклом\n' На втором листе\ni = 8\nDo While Len(ActiveWorkbook.Sheets(2).Cells(i, 7).Value) > 0\n    RowColHeightForContent ActiveWorkbook.Sheets(2).Cells(i, 7) ' Седьмой столбец\n    RowColHeightForContent ActiveWorkbook.Sheets(2).Cells(i, 228) ' 228 столбец\n\n    '(или вложенным циклом от N до M столбца)\n    \n    i = i + 1\nLoop\n\n' На третьем листе\ni = 5\nDo While Len(ActiveWorkbook.Sheets(3).Cells(i, 7).Value) > 0\n    RowColHeightForContent ActiveWorkbook.Sheets(3).Cells(i, 7)\n    i = i + 1\nLoop\n</code></pre>\n<h2>Когда делать?</h2>\n<p>По какому событию вызывать этот код? У нас не много вариантов: </p>\n<ol>\n<li>Если происходит заполнение темплейта через EXCEL-OLE API, то можно попробовать подвязаться на событие завершения сборки файла. (Тут нужно смотреть документацию вашего инструмента, который выгружает)</li>\n<li>Во всех остальных случаях — можно выполнять код по событию <strong>\"Открытие файла\"</strong> (<em>Workbook_Open</em>).<ol>\n<li>Для этого, нужно открыть модуль \"Эта книга\": <img src=\"/assets/blog/autoresize-excel-tables/this_book.png\" alt=\"Эта книга\"></li>\n<li>Затем создать функцию <strong>Workbook_Open</strong> примерно вот так:</li>\n</ol></li>\n</ol>\n<pre><code class=\"language-vb\">Private Sub Workbook_Open()\n\n' Здесь код ресайза\n\nEnd Sub\n</code></pre>\n<p>В которую положить <del>болт</del> код ресайза нужных вам ячеек в документе. При открытии файла у пользователя будет всплывать запрос на разрешение выполнения макроса. И если он согласится — выбранные программистом ячейки будут растянуты по размеру содержимого. Собсна, всё.</p>\n<h2>Послание читателю</h2>\n<p>Возможно, я недостаточно раскрыл тему. Так что, если у вас остались вопросы — <del>гугл вам в помощь</del> прошу нафлудить в комментариях.</p>\n<p>Всех благ</p>\n","ogImage":{"url":"/assets/blog/autoresize-excel-tables/background.jpg"},"coverImage":"/assets/blog/autoresize-excel-tables/background.jpg","issueId":"16"}},"__N_SSG":true}